[
    "1",
    "An Organisation Study Report of Bajaj Electricals Ltd",
    "By",
    "VARALAKSHMI B V",
    "(1CR19MBA88)",
    "Submitted to",
    "VISVESVARAYA TECHNOLOGICAL UNIVERSITY, BELAGAUM",
    "In partial fulfilment of the requirement for the award of the degree of",
    "MASTER OF BUSINESS STUDIES",
    "Under Guidance of",
    "Internal Guide",
    "Prof. Preksha Yadav",
    "Assistance Professor",
    "Department of Management Studies",
    "CMR Institute of Technology, Bangalore",
    "Department of Management Studies and Research Centre,",
    "CMR Institute of Technology",
    "#132, AECS Layout, IT Park road, Bangalore-560037",
    "2019-2021",
    "2",
    "3",
    "DECLARATION",
    "I, Ms. Varalakshmi B V bearing USN 1CR19MBA88  hereby declare that the organization study",
    "conducted at Bajaj Electricals Limited is record of independent work carried out by me under the",
    "guidance of Prof. Preksha Yadav faculty of M.B.A Department of CMR Institute of Technology,",
    "Bengaluru. I also declare that this report is prepared in partial fulfillment of the university Regulations",
    "for the award of degree of Master of Business Administration by Visvesvaraya Technological",
    "University, Belagavi. I have undergone an organization study for a period of four weeks. I further",
    "declare that this report is based on the original study undertaken by me and has not been submitted for",
    "the award of any degree/diploma from any other University /Institution.",
    "Disclaimer",
    "The enclosed document is the outcome of a student academic assignment, and does not represent the",
    "opinions/views of the University or the institution or the department or any other individuals",
    "referenced or acknowledged within the document. The data and Information studied and presented in",
    "this report have been accessed in good faith from secondary sources/web sources/public domain,",
    "including the organisation’s website, solely and exclusively for academic purposes, without any",
    "consent/permission, express or implied from the organization concerned. The author makes no",
    "representation of any kind regarding the accuracy, adequacy, validity, reliability, availability or",
    "completeness of any data/information herein contained.",
    "Place:  Bangalore              Signature of the Student",
    "Date:                               USN:1CR19MBA88",
    "4",
    "ACKNOWLEDGEMENT",
    "I acknowledge the deep gratitude to all those who have made organisation study successful and helped",
    "in preparing the report.",
    "I would like to express my sincere thanks to Dr. Sanjay Jain , Principal of CMR Institute of",
    "Technology, Bengaluru for his valuable support and guidance throughout the course of organisation",
    "study.",
    "I am grateful to Mr. Sandeep Kumar N  , HOD of the Department of  MBA, CMR Institute of",
    "Technology, Bengaluru for his constant motivation and inspiration.",
    "I thank my internal guide Prof. Preksha Yadav , Department of MBA, CMR institute of Technology,",
    "Bengaluru for the  guidance and support throughout the organisation study.",
    "Name : Varalakshmi B V",
    "USN  : (1CR19MBA88)",
    "5",
    "TABLE OF CONTENTS",
    "Chapter No . Particulars Page No.",
    "EXECUTIVE SUMMARY        7",
    "1 INTRODUCTION ABOUT THE ORGANISATION &",
    "INDUSTRY     8 - 10",
    "2 ORGANISATION PROFILE    10 - 37",
    "i. Back ground",
    "ii. Nature of Business",
    "iii. Vision, mission & quality policy",
    "iv. Workflow model",
    "v. Product / service profile",
    "vi. Ownership pattern",
    "vii. Achievements and awards",
    "viii. Future growth and Prospects",
    "3 Mckensy’s 7S framework and Porter’s Five Force Model        38 - 43",
    "4 SWOT Analysis       43 - 45",
    "5 Analysis of financial statements        46 - 53",
    "6 Learning experience           53",
    "Reference           54",
    "6",
    "LIST OF TABLES",
    "Table No.                           Title Page No.",
    "1 Service charges of bajaj electricals 31-32",
    "2 Ownership pattern 33",
    "3    Board of directors 35",
    "4 Balance sheet 46-49",
    "5 P&L account 50-52",
    "List of Charts",
    "Chart No. Title Page no.",
    "1 Mckency’s Framework 38",
    "2 Structure (Mckensy’s framework) 38",
    "3 Porter’s five forces model 42",
    "4 Financial statements for 5 years  46",
    "7",
    "EXCLUSIVE SUMMARY",
    "Bajaj Electricals Limited (BEL), a globally renowned and trusted company, with a turnover of ₹6,744",
    "crores (FY 18-19), is a part of \"Bajaj Group\". Bajaj Electricals business is spread across – Consumer",
    "Products (Appliances, Fans, Lighting), Exports, and EPC (Illumination, Transmission Towers and",
    "Power Distribution). Bajaj Electricals has 20 branch offices spread in different parts of the country",
    "besides being supported by a chain of distributors, authorised dealers, retail outlets, exclusive",
    "showrooms called ‘Bajaj World’ and approximately 500 customer care centres. We also have a",
    "presence in premium home appliances and cookware segments with brands like Morphy Richards and",
    "Nirlep.",
    "But to know Bajaj Electricals, one must understand our core principles. We get our Gandhian set of",
    "values by our founding father - Jamnalal Bajaj. While walking towards the future, our current leaders",
    "aim to carry forward his legacy. “Inspiring Trust”, our tagline, is something that we associate with and",
    "try to fulfil in our everyday endeavours. Apart from work, we also believe in bringing about a change",
    "in our society through our philanthropic work. Our Corporate Social Responsibility (CSR) division",
    "strongly rests on sustainability, gender diversity, employee volunteering and community outreach",
    "programmes.",
    "To increase our footprint globally and in India, we have partnered with reputed brands from across the",
    "world to give you the best of services. BEL has marketing arrangements with Teleco Automation of",
    "Italy, tie-ups with CREE Lighting of USA and Securiton of Switzerland for Luminaires, Delta Controls",
    "of Canada for Integrated Building Management Systems, Gooee of USA for IOT based lighting",
    "solutions, Greystone of Canada and Magnum Energy of USA for Wired and Wireless Sensors, Disney",
    "of USA and Midea of China for Fans, and Morphy Richards of UK for Appliances. Bajaj Electricals",
    "has also invested in Starlite Lighting for manufacturing energy-saving lamps (CFL). With such a vast",
    "portfolio under our banner, we have managed to touch lives at every juncture.",
    "8",
    "AN ORGNISATION STUDY OF BAJAJ ELECTRICALS LTD",
    "Chapter 1",
    "INTRODUCTION ABOUOT ORGANISATION & INDUSTRY",
    "INDUSTRY                      BAJAJ EQUIPMENT",
    "Founded                            July 14 1938",
    "Head quarters                    Mumbai, Maharashtra, India",
    "Anant Bajaj (Managing Director )",
    "Products                            Home Appliances, Fans, Lighting & Engineering",
    "and Products",
    "Revenue                            Rs.27.7 billion (US$390 million) (2011)",
    "Parent                                Bajaj Group",
    "Subsidiaries                      Starlite lighting",
    "Website                             www.bajajelectricals.com",
    "Key people                        Shekhar Bajaj (Chairman and MD)",
    "9",
    "ORGANISATION PROFILE",
    "Bajaj Electricals Limited is engaged in engineering and projects; power distribution, illumination and",
    "consumer durables businesses. The Company's business segments consist of Lighting; Consumer",
    "Durables; Engineering & Projects, and Others. The Lighting segment includes lamps, tubes and",
    "luminaries. The Consumer Durables segment includes appliances and fans. The Engineering &",
    "Projects segment includes transmission line towers, telecommunications towers, highmast, poles and",
    "special projects. The Others segment includes diecasting and wind energy. It has a range of domestic",
    "and kitchen appliances comprising water heaters, room heaters, coolers, irons, mixers, induction",
    "cookers, toasters, kettles, microwave, rice cookers, gas stoves, non-electrical kitchen aids and pressure",
    "cookers. It offers ceiling, table, pedestal, wall, fresh air and industrial fans, and lighting solutions, such",
    "as light sources, light emitting diode-based lighting products, domestic luminaires, torches and",
    "lanterns.",
    "INDUSTRY PROFILE",
    "Established in the year 1975, we, “Bajaj Products,”  are renowned organization engaged in",
    "manufacturing and exporting a wide range of Construction Support Equipment. We are one of the",
    "largest manufacturers of this equipment in Northern India and also specialize in offering Centering &",
    "Staging Systems and some Special Machinery Parts.",
    "We have developed a state-of-the art manufacturing units located in Delhi & Haryana  (India). These",
    "units are equipped with all requisite facilities, which enables us to manufacture our range in strict",
    "compliance with the defined industry standards. Being a professionally managed organization, we are",
    "backed by highly qualified engineers, CAs & MBAs, who hold rich industry experience in the",
    "respective domain. Owing to their expertise and in-depth industry knowledge, we also",
    "give Consultancy regarding the usage and functionality of the equipment. Also, we provide",
    "Computerized Erection drawings as per the application requirements of leading  Construction",
    "Companies based at Oman, Dubai, Bahrain, Emirates,  Kuwait, Iraq, Saudi Arabia, Nepal, SriLanka,",
    "Philippines.",
    "We have successfully completed various prestigious consignments and projects, for renowned",
    "companies involved in the construction of Dams, Large Industrial  Establishments,  Power Stations,",
    "Ports, Bridges and Flyovers.  Further, we are also capable to provide credits through bill re-discounting",
    "scheme of SIDBI.",
    "We are guided by our mentor Mr. Vivek Bajaj, who is an engineer from BIT & has also done",
    "management program in exports. Under his supervision, we have completed many pioneering jobs &",
    "10",
    "challenging projects for our clients. BAJAJ ELECTRICALS LTD is an Indian customer electrical",
    "equipment manufacturing company based in Mumbai, Maharashtra. It is a part of the Rs.380 billion",
    "(US$5.3 billion) Bajaj Group. It diversified with interests in lighting, luminaries, appliances, fans, LPG",
    "based Generators, engineering and products.",
    "Its main domains are lighting, consumer durable, engineering and products. Lighting includes lamps,",
    "tubes and luminaire. Consumer durable include appliances and fans. Engineering and products include",
    "transmission line towers, telecommunications towers, high-mast, poles and special projects and others",
    "include die casting, wind energy and solar energy. Some notable project includes lighting works at the",
    "commonwealth games stadium and the bandra worli sea link. It has 19 branch offices spread in",
    "different parts of the country with a chain of about 1000 distributors, 4000 authorized dealers, over",
    "400000 retail outlets and over 282 customer care centers.",
    "CHAPTER 2",
    "ORGANISATION PROFILE",
    "HISTORY",
    "“Enhancing quality of life and bringing happiness with sustainability”",
    "Bajaj Electricals was incorporated on 14 July 1938 as radio lamp works limited under the Indian",
    "Company Act, 1913 as a public company limited. On 1 October 1960 it was renamed to Bajaj Electrical",
    "Limited. In 1964, Matchwell Electricals (India) Limited, (Matchwell), a manufacturer of electric fans",
    "became a subsidiary of the Company and subsequently, with effect from1 July 1984, the business and",
    "undertaking of Matchwell was amalgamated with the Company.",
    "In the financial year 1993-1994, Bajaj Electrical entered into a joint venture with Black and Decker",
    "Corporation, US, for the manufacture and marketing of power tools, household appliances, and related",
    "accessories, through a separate company named Black & Decker Bajaj Private Limited, (Black &",
    "Decker Bajaj).",
    "During the financial year 1999-2000 Black & Decker Bajaj became a 100% subsidiary of the Company",
    "upon the Company acquiring a further 50% of the shareholding thereof from Black & Decker",
    "Corporation, after which Black & Decker Bajaj was renamed as Bajaj Ventures Limited. However, in",
    "the financial year 2002-2003, the Company divested 50% of its shareholding in Bajaj Ventures Limited",
    "and Bajaj Ventures Limited ceased to be a subsidiary of the Company. In January 1998, the Company",
    "established a new manufacturing unit at chakan near Pune and commenced operations of",
    "11",
    "manufacturing of fans and die-cast components. The production of fans at the manufacturing activities",
    "of the Matchwell unit also was gradually shifted to the Chakan unit. In September 1999, Bajaj",
    "established and commissioned a wind energy generation unit with an installed capacity of 2.8 mega",
    "watts  in the village of Vankusawade in Satara, Maharashtra. The facility continues to run profitably",
    "till date.",
    "In the year 2000-2001 the Company set-up manufacturing facilities including a fabrication unit and a",
    "galvanising plant at Ranjangaon, near Pune for the manufacture of high masts, lattice towers, and",
    "related products, and the said manufacturing facilities commenced commercial production with effect",
    "from 1 April 2001.",
    "In November 2002, the company entered into a technical collaboration and brand licensing agreement",
    "with Morphy Richards, United Kingdom, for the sales and marketing of electrical appliances under the",
    "brand name of \"Morphy Richards\" in India.",
    "In the year 2005 the company entered into a distribution agreement with Trilux Lenze of Germany for",
    "high end technical lighting.",
    "In the year 2007, the company acquired 32% of the share capital of Starlite Lighting Limited, a",
    "company engaged in the manufacture of Compact Fluorescent Lamps (\"CFLs\").",
    "In 2012-2013, they have completely divested the stake and association with Black and Decker",
    "Corporation, USA.",
    "In 2015 Bajaj Electrical appointed On Ads Communications as their sole creative partner.",
    "To increase our footprint globally and in India, we have partnered with reputed brands from across the",
    "world to give you the best of services. BEL has marketing arrangements with Teleco Automation of",
    "Italy, tie-ups with CREE Lighting of USA and Securiton of Switzerland for Luminaires, Delta Controls",
    "of Canada for Integrated Building Management Systems, Gooee of USA for IOT based lighting",
    "solutions, Greystone of Canada and Magnum Energy of USA for Wired and Wireless Sensors, Disney",
    "of USA and Midea of China for Fans, and Morphy Richards of UK for Appliances. Bajaj Electricals",
    "has also invested in Starlite Lighting for manufacturing energy-saving lamps (CFL). With such a vast",
    "portfolio under our banner, we have managed to touch lives at every juncture.",
    "12",
    "i.COMPANY BACKGROUND",
    "BAJAJ ELECTRICALS",
    "Industry Name                                       Domestic Appliances",
    "House Name                                           Bajaj Group",
    "Collaborative Country Name               N.A",
    "Joint sector Name                                  N.A",
    "Year of incorporation                            1938",
    "Year of commercial production           N.A",
    "REGD. OFFICE",
    "Address                                  45/47, Veer Nariman road,,N.A",
    "District                                    Mumbai",
    "State                                        Maharashtra",
    "Pin code                                  400001",
    "Tel. No.                                    022-61107800, 022-61497000",
    "Fax No.                                     022-22851279, 022-22852179",
    "Email                                         legal@bajajelectricals.com",
    "Internet                                    http://www.bajajelectricals.com",
    "Auditors                                    S R B C & Co. LLP",
    "Company status                       N.A",
    "REGISTRARS",
    "Name                          Link Intime India Pvt. Ltd.",
    "Address                      C 101, 247 park, L.B.S. Marg, Vikhroli(west), Maharashtra",
    "Tel. No.                       022-49186270, 49186200",
    "Email                           N.A",
    "Fax No.                        022-49186060",
    "Internet                       http://www.linkintime.co.in",
    "ii. NATURE OF BUSINESS",
    "Bajaj Electricals is definitely a powerhouse in the EPC segment with years of experience and",
    "expertise in execution of projects. The portfolio under the EPC segment of Bajaj covers everything",
    "under the spectrum of power transmission, distribution and illumination. A leader in its own right,",
    "this business unit has a substantial amount of market share.",
    "The areas of operation include EHV transmission line projects, EHV substations, monopoles for",
    "transmission and distribution, rural electrification projects, RAPDRP, feeder separation, lift irrigation",
    "projects, underground power cabling, HV substations, high mast and street lighting, sports lighting,",
    "13",
    "power plant lighting, specialized illumination projects and electrification projects on total turnkey",
    "basis.",
    "iii.VISION, MISSION AND QUALITY POLICY",
    "MISSION",
    " Integrity:  Having complete integrity alignment in what we feel, what we speak and what we",
    "do, thereby demonstrating honesty and having strong moral principles. Having firm belief in",
    "the reliability, truth and ability of all stakeholders and company processes.",
    " Team work:  Believing in ‘one for all and all for one’ thereby working together to exceed our",
    "expectations in achieving organizational objectives.",
    " Empowerment:  Creating conditions and enabling people to take responsibility for enhanced",
    "contribution towards personal and organizational objectives.",
    " Customer delight:  proactively anticipating internal and external customer needs and",
    "relentlessly working towards exceeding their expectations.",
    " Innovation:  To continuously explore, develop, create and implement new technology,",
    "processes, ideas and products .",
    "VISSOIN :",
    "“Enhancing quality of life and bringing happiness with Sustainability”",
    "Our vision has always been to be the leader in the industry and a consumer’s original choice. We strive",
    "to fulfil this everyday by being open to change and constantly improving ourselves. We, at Bajaj",
    "Electricals, also believe in enhancing the quality of life of our customers, stakeholders and of course",
    "our employees through everything that we do. We also understand the significance of sustainable",
    "growth, and hence endeavour to be a responsible company. Our core business strategy has",
    "14",
    "sustainability embedded into it right from the beginning. We believe in giving back to the community",
    "and are attuned to the importance of being socially and environmentally conscious in all that we do.",
    "InHaving complete integrity alignment in what we feel, what we speak and what we do, thereby",
    "demonstrating honesty and having strong moral principles.",
    "TBelieving in ‘One for all and all for One’ thereby working together to exceed our expectations in",
    "achieving organisational objectives.",
    "Creating conditions and enabling people to take responsibility for enhanced contribution towards",
    "personal and organisational objectives.",
    "EMPOWERMENT",
    "INTEGRITY",
    "TEAM WORK",
    "15",
    ".",
    "Proactively anticipating internal and external customer needs and relentlessly working towards",
    "exceeding their expectations.",
    "ITo continuously explore, develop, create and implement new technology, processes, ideas and",
    "products.",
    "Having firm belief in the reliability, truth and ability of all associates and company processes .",
    "TRUST",
    "INNOVATION",
    "CUSTOMER DELIGHT",
    "16",
    "BAJAJ ELECTRICALS LIMITED (BEL) QUALITY POLICY ON CORPORATE SOCIAL",
    "RESPONSIBILITY:",
    "BEL’s Values",
    "BEL endeavors to act as a responsible corporate citizen at all times and across the value chain. BEL",
    "conducts its business with integrity, honesty and with a commitment to a profitable and sustainable",
    "growth.",
    "BEL believes that respecting and engaging with stakeholders is of paramount importance to build a",
    "sustainable business. BEL will continue to work with all the stakeholders viz. customers, shareholders",
    "and investors, suppliers, employees and communities in an accountable and transparent manner and",
    "make its best efforts to deliver environmental-economic-social value.",
    "Ethical Business Practices",
    "Customers",
    "BEL strives to develop and provide innovative, safe, resource-efficient and high quality products. BEL",
    "will continue to provide effective after sales support. BEL will also endeavor to communicate to the",
    "customers on the safety, responsible usage and disposal of its products. BEL is committed to adopt",
    "good corporate governance practices in all its dealings across all functions and processes in every",
    "business. This is further articulated in BEL’s Code of Business Conduct and Ethics that is applicable",
    "to all its employees and the members of the Board of Directors BEL will endeavor to protect the",
    "personal information of customers, business partners and other stakeholders, in accordance with the",
    "prevalent privacy laws.",
    "Shareholders and Investors",
    "BEL will continue to strive to enhance shareholder value while achieving a stable and long term",
    "growth. BEL will adhere to transparency in disclosure of financial and other relevant information,",
    "protection of minority shareholders interest and adopt good governance practices.",
    "Suppliers",
    "BEL aims to build long-term relationships with its suppliers by conducting fair business practices,",
    "encourage and support small, local and specialist producers. BEL will maintain fair and free",
    "competition in accordance with the country’s prevailing competition laws.",
    "BEL will communicate its responsible sourcing expectations to the suppliers in the areas of health,",
    "safety, employee & worker welfare and sustainable environmental practices.",
    "17",
    "Employees",
    "BEL believes in providing equal employment opportunities across all categories of employees and",
    "seeks to actively address the issues of gender and inclusion. BEL remunerates its employees fairly in",
    "accordance with their skills, performance and also provides opportunities for career advancement. BEL",
    "makes best efforts to uphold human rights principles laid down by the UN Declaration and the",
    "applicable International Labour Organisation conventions concerning worker’s rights.",
    "Community",
    "BEL will continue to actively engage with communities to generate shared value and contribute to the",
    "inclusive growth wherever it does business. BEL will comply with all applicable legal and other",
    "requirements relating to its community spends.",
    "BEL will strive to support the creation of educated and healthy communities with the involvement of",
    "stakeholders by undertaking programs for development of vocational skills, environment",
    "sustainability, capacity building, protection of national heritage, art and culture, preventive healthcare,",
    "women’s empowerment and livelihood enhancement projects .",
    "Environment",
    "BEL aims to achieve profitable growth in harmony with the environment. BEL will continue to follow",
    "high standards of efficiency, quality and safety in its manufacturing processes and technologies. BEL",
    "will strive to attain optimal resource use over the product life cycle.",
    "BEL will promote judicious use of natural resources through recycling/reuse and material waste",
    "management. BEL will strive to minimize adverse environmental and social impacts from its business",
    "operations. It is also committed to continual performance improvement and encourages the same",
    "across its supply chains.",
    "Public Policy",
    "BEL will always advocate public policies that are conducive in achieving its mission to bring greater",
    "happiness to its customers and enhance stakeholder value.",
    "BEL will advocate its position on specific issues, as may be determined by its Board of Directors, and",
    "the same shall be voiced through appropriate trade and industry chambers and associations.",
    "Policy Performance",
    "BEL will endeavor to implement various facets of this policy through adequate capacity building of",
    "relevant stakeholders, implementing various programmes by itself or in collaboration with",
    "18",
    "organizations having domain expertise. BEL will conduct audits at regular intervals to ensure",
    "conformity to the same.",
    "BEL shall deploy policy linked programs through allocating resources and assigning responsibilities,",
    "setting performance targets, and appropriate monitoring mechanisms.",
    "BEL shall implement community programs/projects/activities as approved by the CSR committee in",
    "project mode through its own team or partnering with registered trust/society/ company. This shall be",
    "done post evaluation of CSR proposals and track records of the implementing partner organization(s).",
    "CSR activities shall be deployed in project mode viz. baseline survey, programs objectives,",
    "implementation schedules, responsibilities and authorities, monitoring process, measurable outcomes",
    "& reporting and payment terms. An Agreement/MoU shall be signed with the implementing partner to",
    "such effect to protect the interest of BEL.",
    "4 Pillars CSR",
    "At Bajaj Electricals Limited, our Corporate Social Responsibility programs are focused towards",
    "environmental sustainability, education, health, arts & culture and community development initiatives,",
    "through both direct implementation as well as via NGO partners, while ensuring participative,",
    "engaging employee volunteering within these focus areas. This commitment is balanced on four pillars,",
    "namely sustainability, diversity and inclusion, employee volunteering and community initiatives.",
    ".",
    "Diversity and inclusion are embedded in the very culture of the organisation. We strive to inculcate a",
    "high performing inclusive environment and commitment to attract and retain capable talent while",
    "respecting the diversity.",
    "DIVERSITY & INCLUSION",
    "19",
    "Employees engage and drive the volunteering programmes of the company through collective social",
    "responsibility and strong individual commitment. We believe in giving back to the community and",
    "that is seen in all employees of our Bajaj family .",
    "The community initiatives are undertaken to address to certain social and environmental challenges,",
    "which are directed towards benefitting community at large. At BEL, we see this as an integral part of",
    "our social and individual responsibility .",
    "EMPLOYEE VOLUNTEERING",
    "COMMUNITY INITIATIVES",
    "20",
    "Sustainability",
    "We, at Bajaj, ensure that our long-term business goals are aligned with sustainable development",
    "without compromising on the economic, environmental and social factors. Sustainability is always",
    "integrated in our strategies, as it is a vital part of how we perceive ourselves as an organisation .",
    "iv. BUSINESS MODEL",
    "MARKETING STRATEGY",
    " Marketing Strategy of Bajaj Electricals",
    "The world-renowned & trusted company, Bajaj Electricals Limited (BEL) with a presence in more",
    "than 20 countries globally is a part of the “Bajaj Group”. The company’s business is spread across –",
    "Luminaires, Exports, consumer products (Appliances, Fans, Lighting) and EPC (Illumination,",
    "Transmission Towers, and Power distribution Apart from the low-end segment products the company",
    "has a presence in the Hi-End range of appliances also under the brand name of Platini and Morphy",
    "Richards .",
    " Segmentation, targeting, positioning",
    "Since the company is operating in a large number of products categories so clearly defining the",
    "population characteristics will help Company to align its strategy for customer acquisition. Bajaj",
    "Electricals uses a mix of demographic and psychographic segmentations strategies.In order to serve",
    "the customers with its offerings meant for the particular segment, it uses differentiated targeting",
    "strategy. It has positioned itself as a company offering all sorts of white consumer goods, durables",
    "SUSTAINIBILITY",
    "21",
    "products under one brand and at the same time connect with youth, since India has 65% of the",
    "population under the age of 35 years.",
    " Competitive advantage of the Marketing strategy",
    "Renowned Brand - The Company comes under umbrella brand structure of Bajaj Group, a",
    "conglomerate with more than 75 years of existence and which have a presence in diverse businesses",
    "such as automobile, insurance, financial services and ancillary businesses. Bajaj Electrical is one of",
    "the 25 companies that Bajaj Group operates into with more than 36000 employees.",
    "Broad product portfolio : Having a presence in large product categories is helping the company is",
    "offering a bouquet of products & services to the customers thereby optimising the customer acquisition",
    "cost and increasing the product linkages with customers .",
    " BCG Matrix in the Marketing strategy",
    "In order to offer a full range of products and related services to customers, the company has been",
    "offering products under Strategic Business units (SBU’s) such as Engineering Procurement &",
    "construction (EPC), Luminaries, Exports and Consumer Goods.",
    "Further, EPC deals in Power transmission, Power distribution, and Illumination; Luminaries deals in",
    "businesses such as LED, Integrated building management system; Exports business deals in B2B and",
    "B2c segments while consumer goods business deals in kitchen & home appliances.",
    "All the business segments/ SBU’s in which Bajaj Electricals operate into are Stars in the BCG matrix .",
    " Distribution strategy in the Marketing strategy",
    "The Company has been expanding its touch points through Range & Reach Expansion Programme",
    "(RREP) in new geographies across the country along with the Retailers Bonding Programme is helping",
    "the Company in expanding its topline products to new markets.",
    "It distributes its products & services through a mix of channels depending on the business segment like",
    "for power distribution it uses government build network or self-developed distribution network, for",
    "other business like consumer goods, illumination and export-import business it uses channels of",
    "distributions like distributors, resellers, e-commerce sites, wholesalers and company own sales team.",
    "The Company has increased its service centers to 418 in 298 cities in order to make it more convenient",
    "for the customers to resolve their issues in a speedy manner.",
    "22",
    " Brand equity in the Marketing strategy",
    "The company has bagged many award and accolades over the years in the field of",
    "IT technology, advertising, Consumer care, Luminaries and power distribution such as Innovative CIO",
    "Award 2016 from Bitstream India and many others. Also, the company has been part of various",
    "sponsorships programs such as Pro-Kabaddi league, Pro-badminton league, Wimbledon",
    "Championship-2016, Rio Olympics-2016 and even through partnerships like Kala Ghoda in February",
    "2017 which is India’s largest Art & Cultural Festival .",
    "The brand has been valued at Rs. 3171 crores as of March 2017 ( market  capitalization value method)",
    "generating revenue of Rs. 4334 crores.",
    " Competitive analysis of the Marketing strategy",
    "Factors such as unsold inventory, pricing pressures, increasing bargaining power of the customers as",
    "well as suppliers, competition from the unorganized sector are some of the factors affecting the",
    "company’s performance.",
    "It competes with companies across the business segments it operates into by maintaining high-quality",
    "standards and making its products & services available in the remotest areas of the market. Some of",
    "the competitors of Bajaj Electricals are crompton Havells, greaves, philips, 3M, samsung and others",
    "electrical companies .",
    " Market analysis of the Marketing strategy",
    "Young population of India supported by the digital push by the government along with penetration to",
    "the distant areas of the country, these are driving factors for the companies operating the electronics",
    "and power distribution business.The Factor such as counterfeit Products, the short life cycle of",
    "technological products, labour cost, increasing pressure from the unorganized sector, and shrinking",
    "margin are some of the factors affecting companies operating in this market to which Bajaj Electricals",
    "is not an exception.",
    " Customer analysis in the Marketing strategy",
    "The company has strong Customer relationship management system to understand the",
    "changing needs of the different customer groups. The company serves the B2B customers such as",
    "government organizations, Corporate and other institutions while in the retail segment its caters",
    "customers in the age group of 20-45 years who are from middle-income group social class.",
    "23",
    "Bajaj Electricals Marketing Mix (4Ps) Strategy",
    "Marketing Mix of Bajaj Electricals analyses the brand/company which covers 4Ps (Product, Price,",
    "Place, Promotion) and explains the Bajaj Electricals marketing strategy. As of 2020, there are several",
    "marketing strategies like product/service innovation, marketing investment, customer experience etc.",
    "which have helped the brand grow. Marketing strategy helps companies achieve business goals &",
    "objectives, and marketing mix (4Ps) is the widely used framework to define the strategies. This article",
    "elaborates the product, pricing, advertising & distribution strategies used by Bajaj Electricals.",
    " Bajaj Electricals Product Strategy",
    "The product strategy and mix in Bajaj Electricals marketing strategy can be explained as follows:",
    "Bajaj Electricals is a leading brand name in electrical equipment and appliances in India. The products",
    "of Bajaj Electricals mainly cater to the domains of luminaries, consumer products, engineering",
    "procurement and construction (EPC) and exports. The luminaries mainly target the segments like",
    "industry, cityscape, commercials and infrastructure with its products like LED, accessories and light",
    "sources. The consumer products of Bajaj Electricals include various appliances in food preparation,",
    "home comforts and essentials which includes iron box, fans, induction and electrical cookers, pans,",
    "room coolers and water heaters etc. For EPC projects the company is involved in illuminations, power",
    "transmissions and power distribution on larger scale. This shows the strong product portfolio in its",
    "marketing mix, which is relevant to consumers as well as enterprises.",
    " Bajaj Electricals Product Strategy",
    "The product strategy and mix in Bajaj Electricals marketing strategy can be explained as follows:",
    "Bajaj Electricals is a leading brand name in electrical equipment and appliances in India. The products",
    "of Bajaj Electricals mainly cater to the domains of luminaries, consumer products, engineering",
    "procurement and construction (EPC) and exports. The luminaries mainly target the segments like",
    "industry, cityscape, commercials and infrastructure with its products like LED, accessories and light",
    "sources. The consumer products of Bajaj Electricals include various appliances in food preparation,",
    "home comforts and essentials which includes iron box, fans, induction and electrical cookers, pans,",
    "room coolers and water heaters etc. For EPC projects the company is involved in illuminations, power",
    "24",
    "transmissions and power distribution on larger scale. This shows the strong product portfolio in its",
    "marketing mix, which is relevant to consumers as well as enterprises.",
    " Bajaj Electricals Price/Pricing Strategy",
    "Below is the pricing strategy in Bajaj Electricals marketing strategy:",
    "Bajaj Electricals has adopted distinctive pricing strategy for each of its product segments which include",
    "the household appliances on one end and the large scale projects on the other segment. The consumer",
    "products indeed have a competitive pricing strategy in its marketing mix to get the required market",
    "share in terms of rising competition among rivals. However the Bajaj Electricals brand also offers",
    "discount and other incentives in terms of service for attracting larger customer base. It has also some",
    "of the products sold at premium price based on the value offerings it provides to the consumer base.",
    "The products of Bajaj Electricals focus more in providing quality products and gives lower importance",
    "towards earning more margin. This has clearly helped the brand to gain a trustworthy image among",
    "the consumers.",
    " Bajaj Electricals Place & Distribution Strategy",
    "Following is the distribution strategy of Bajaj Electricals:",
    "Bajaj Electricals has a well-established manufacturing plant in Maharashtra near Pune which has world",
    "class facilities involved in production of different electrical products. Bajaj Electricals has established",
    "seamless distribution system enabling its consumer and electrical appliances to reach different parts of",
    "the country. There is a strong dealership network which provides a clear strategy to make its products",
    "more accessible to consumers. They act as intermediaries or direct selling point for making the",
    "products available to consumers. Bajaj Electricals appliances have a considerable demand in both rural",
    "and urban area in comparison. It has established showrooms and retail outlets which has provided",
    "greater visibility for the products compared to its competitors. Warehouses across different regions",
    "also facilitate storage of the products and reach the outlets in shorter duration. Service centres have",
    "been established across various places to enable quick and efficient services thereby enabling better",
    "consumer experience. Currently online platform has also been utilized by Bajaj Electricals .",
    " Bajaj Electricals Promotion & Advertising Strategy",
    "The promotional and advertising strategy in the Bajaj Electricals marketing strategy is as follows:",
    "Bajaj Electricals relies heavily on the traditional means of promotional campaigns like television media",
    "and print advertisement for bringing awareness among the masses. The campaign of ‘Hamara Bajaj’",
    "25",
    "is still relevant for the products in electrical consumer goods. There has been changes in the promotion",
    "being carried out, however the core values and principle have remained the same over years. Taking",
    "cue from modern methods of promotion using social media platform and online it has been trying to",
    "connect with younger mass. There has been lot of promotion in terms of announcing seasonal discounts",
    "and offers through such media. The brand Bajaj has become quite synonymous with the household and",
    "this has helped in designing and communicating the product in promotional campaign. Hence, this",
    "gives an insight in the marketing mix of Bajaj Electrical.",
    "V.PROUCT/ SERVICE PROFILE",
    "CONSUMER PRODUCTS",
    "GAS STOVES",
    "FOOD PROCESSORS",
    "WET GRINDERS",
    "ELECTRIC COOKERS",
    "IRONS",
    "ROOM HEATERS",
    "WATER",
    "HEATERS",
    "AIR COOLERS",
    "26",
    "TOP UP TOASTERS",
    "PANS & TAVAS",
    "ELECTRIC KETTLE",
    "MICROWAVE OVEN",
    "INDUCTION COOKERS",
    "JUICERS",
    "27",
    "Indore solutions",
    "Integrated Building",
    "management",
    "systems(IMBS ) INDUSTRIAL LIGHTING",
    "SMART & CONNECTED",
    "SOLUTIONS COMMERCIAL LIGHTING",
    "28",
    " Outdoor solutions",
    "STREET & ROAD",
    "LIGHTING",
    "AREA & YARD",
    "LIGHTING",
    "CITY FURNITURES",
    "SPORTS LIGHTING  FLAG MASTS & SPECIAL",
    "MASTS",
    "29",
    " SOLAR ENERGY SOLUTIONS",
    "RESIDENTIAL",
    "COMMERCIAL &",
    "INDUSTRIAL INSTITUTIONAL/SOCIAL",
    "SECTOR SOLAR CAR",
    "PARKING/CARPORT",
    "MICROGRID  UTILITY SOLAR GROUND",
    "MOUNT PROJECTS",
    "30",
    "EXPORTS",
    "The smallest BU with the largest market place is what the Exports Division at Bajaj Electricals is all",
    "about. The company, synonymous with quality products in India, is growing the seed of a dream to",
    "build a brand presence across the globe with a host of products both for Consumers and in Projects.",
    "Bajaj Electricals has already made its presence felt in Sri Lanka, Bangladesh, Singapore, Myanmar,",
    "Mauritius Nigeria, Ethiopia, Uganda, Ghana, Tanzania, Madagascar, Kenya, Egypt, UAE, Oman,",
    "Bahrain, Iraq and Jordan among other countries. The Company has its first branch office in Dubai to",
    "cater specifically to UAE, Middle East and North Africa markets. The BU also plans to expand with",
    "branch offices in other countries as well.",
    "Bajaj Electricals takes pride in participating in various exhibitions like Dhaka International Trade Fair",
    "(DITF) in Bangladesh, the FIEE Exhibition in Sao Paulo, Brazil, as well as conducting Dealer Meets",
    "in Sri Lanka, besides participating in B2B Exhibitions in Ghana, Kenya, Dubai and Abu Dhabi.",
    "BEL values different cultures and prides itself on understanding the diverse requirements of the client",
    "or the consumer. The company comes with a legacy of experience and expertise, and is looking to",
    "unlock opportunities globally. This BU of BEL has been granted the status of One Star Export House.",
    "Countries we export :",
    "Ghana                     Ethiopia                     UAE                           Jordan",
    "Oman                      Sri Lanka                   Kenya Myanmar",
    "Nigeria                    Uganda                      Tanzania Zambia",
    "Mozambique           Bangladesh                Togo Kuwait",
    "Egypt                       Saudi Arabia              Madagascar Qatar",
    "Mauritius                  Malaysia                    Yemen Senegal",
    "Sudan                      Bahrain                       Iraq Gambia",
    "Maldives                  Indonesia                   Singapore      Guinea Bissa",
    "Service And Support",
    "31",
    "For any service related queries or complaints, please call us at: 022 - 4128 0000 (9.00 AM To 6.00",
    "PM)If for any reasons, you are not able to register your queries / complaints,",
    "please email us at:   consumercare@bajajelectricals.com",
    "Service Charges for Bajaj Electricals/Morphy Richards Products which are out of warranty .",
    "Product Group Product Type Charge at",
    "service center Charge at",
    "customer",
    "/Dealer place",
    "Cookers Food steamer, Rice cooker",
    "100",
    "200 Irons Dry / stream irons",
    "Kettles Electric kettle, Tea maker",
    "Mixer Chopper, Citrus juicers, Hand",
    "blender, Hand mixer, Juice extractor,",
    "mixer grinder",
    "Water heaters Immersion heater",
    "Coffee makers Coffee maker",
    "150",
    "250 DVD players DVD player",
    "Fans All types of fans",
    "Gas stoves Cook top, Gas stove",
    "Induction cookers Induction / Radient cookers",
    "mixers Food processors, wet grinders",
    "Room heaters Oil Filled Radiator(OFR), Carbon,",
    "Halogen, Fan heater",
    "Toasters Pop-up toasters, sandwich toasters",
    "UPS Home Lite, Stabilizers",
    "Vacuum cleaners Vacuum cleaner",
    "Water heaters Instant geyser",
    "32",
    "Air Circulators Industrial/  Pedestal / Table/ wall Fan",
    "250",
    "350 Coolers Desert, Double Blower, Personal,",
    "single blower",
    "Gas stoves Cooker Hood, Gas hob",
    "Industrial Exhaust",
    "fans Industrial Fan",
    "Microwave Oven Microwave Oven",
    "OTG Big / Small OTG",
    "Installation Charges for Bajaj Electrical Chimneys.",
    "Product code            Cooker Hood Models            Suggested Charges for Standard Installations",
    "450029                      HX1                                                            300",
    "450070                      HX7 SS BF                                                 400",
    "450098                      HX8 BF                                                      500",
    "450037                      HX12                                                          500",
    "450101                      HX15                                                          500",
    "450130                      HX17 Auto Clean PC                                 500",
    "450131                      HX18 Auto Clean SS                                  500",
    "Notes on Installation  :",
    " Warranty valid only if the Installation is carried out by company appointed Service centres",
    " Installation Charges are subject to change without any prior notice",
    " Customers to arrange on their own Plumbing/Electrical/Carpentry works if any",
    " Hose Pipe charges shall be charged extra",
    " 50% of Charges to be paid by the customers at the time of site inspection and the balance to be",
    "paid after the installation",
    " The Service Centre shall attend outstation installations as per mutual understanding of local",
    "conveyance decided between the parties",
    "33",
    "vi. Ownership Pattern",
    "The Shareholding Pattern page of Bajaj Electricals Ltd. presents the Promoter's holding, FII's holding, DII's",
    "Holding, and Share holding by general public etc .",
    "Holder's Name No of Shares % Share Holding",
    "Promoters 71870858 63.17%",
    "Foreign Institutions 10456884 9.19%",
    "N Banks Mutual Funds 12999314 11.43%",
    "Others 4727733 4.16%",
    "General Public 11648391 10.24%",
    "Financial Institutions 2064534 1.81%",
    "No Of Shares 113767714 100%",
    "Founding Fathers",
    "Jamnalal Bajaj was the founding father of the Bajaj Group. The adopted",
    "‘fifth’ son of Mahatma Gandhi, and the 'merchant prince' who held the wealth",
    "he created in trust for the people of his country. Trust - a simple word that",
    "contains a whole philosophy handed down by Jamnalal Bajaj to his",
    "successors. He valued honesty over profit, actions over words and common",
    "good over individual gain.",
    "Kamalnayan Bajaj, elder son of Jamnalal Bajaj, followed the footsteps of his",
    "illustrious father and consolidated the Bajaj foundation. With characteristic",
    "foresight and pragmatic vision, he launched a steady diversification",
    "programme which gave the current name \"Bajaj\" both its shape and size. His",
    "unique management style created a work culture that matched well with the",
    "national spirit he had inherited.",
    "34",
    "Ramkrishna Bajaj took over the reins of the \"Bajaj group\" in 1972 after",
    "Kamalnayan Bajaj had steered the Group from strength to strength for over 22",
    "years. He had also actively participated in the freedom struggle of the country.",
    "In post independent India, he had led the youth movement. All along, he",
    "actively strengthened the foundations of business through ethics and practices",
    "both within the group and                          amongst the business community as",
    "well.",
    "Shekhar Bajaj, Chairman & Managing Director of Bajaj Electricals Ltd.,",
    "started his career with Bajaj Sevashram after which he worked at Bajaj",
    "International, the group's export company. Mr. Shekhar Bajaj joined Bajaj",
    "Electricals in 1980, became the Managing Director in 1987 and took over as",
    "the Chairman and Managing Director in 1994. Mr. Bajaj is the Chairman of",
    "Bajaj Group companies Bajaj International and Hercules Hoist Pvt. Ltd. and",
    "on the Board of Directors of Bajaj Auto and IDBI Bank. He was past President of ASSOCHAM, Indian",
    "Merchants Chamber (IMC) and Council for Fair Business Practices (CFBP) .",
    "Mr. Anant Bajaj was the Managing Director of Bajaj Electricals",
    "Limited from June to August, 2018.",
    "He started his career in Bajaj Electricals as a Project Coordinator",
    "in the year 1999, where he was responsible for setting up Rs.",
    "450mn High Mast Manufacturing and Galvanizing Plant for the",
    "Company at Ranjangaon, near Pune. As an acknowledgement of",
    "his growing understanding of the intricacies of managerial",
    "duties, he was appointed as the General Manager, Special Assignments, in 2005. Under his leadership,",
    "the exports arm, Bajaj International Pvt. Ltd. made successful forays into businesses as diverse as IT",
    "and Solar products. In February 2006, Mr. Bajaj was appointed to the Board of Bajaj Electricals Ltd.",
    "as Executive Director, later appointed as the Joint Managing Director on April 01, 2012.",
    "Mr. Anant Bajaj was the driving force behind integrating some of the important initiatives in the",
    "company, such as implementation and rollout of Theory of Constraints (TOC) and Range Reach",
    "Expansion Program (RREP). This has led to maximum distribution & outreach for the organisation.",
    "35",
    "Because of this program, the organisation services 1.6 lakh retail counters across 440 districts every",
    "week.",
    "He was also responsible for setting up the R&D centre ‘AB Square’ that focuses on utilising cutting-",
    "edge technologies to create next-generation appliances. He also got the entire organisation on board",
    "with IoT analytics – a move that he believed will drive product development and create better offerings.",
    "In the year 2014, he initiated ‘Project Evolve’ to enhance the customer experience in the B2B and B2C",
    "segment. In addition, he had played a vital role in company’s strong connects with the youth",
    "demographic of the nation by partnering with some of the top youth-centric events across India. He",
    "was also on the Board of Director of Hind Lamps Ltd. and Starlite.",
    "Board of Directors",
    "Name Designation",
    "Shekhar Bajaj Chairman & Managing Director",
    "Madhur Bajaj Non Executive Director",
    "Pooja Bajaj Non Executive Director",
    "Indu Shahani Independent Director",
    "Rajendra Prasad Singh Independent Director",
    "Shailesh Haribhakti Addnl. & Ind.Director",
    "Anuj Poddar Executive Director",
    "Rajiv Bajaj Non Executive Director",
    "Harsh Vardhan Goenka Independent Director",
    "Munish Khetrapal Independent Director",
    "Siddharth Mehta Independent Director",
    "36",
    "vii. Achievements / awards",
    "37",
    "viii. Future growth and prospects",
    "Bajaj Appliances",
    " Tie up with Morphy Richards (UK) for manufacturing & marketing premium products in India",
    " Bajaj Platini introduced at the Premium end",
    " New Ad-campaign on “Rock star mommy” launched",
    "Bajaj Luminaires",
    " Tie up with Trilux Lenze (Germany) for premium technical lighting and RUUD Lighting (US)",
    "for LED",
    " New Foray into IBMS , HVAC , Fire Alarms and Security systems",
    "Bajaj Fans",
    " Tie up with one of the world’s leading fan manufacturers - Bajaj Midea",
    " Targeting kids segment by supplying specially designed fans through a tie up with Disney.",
    "Bajaj Lighting",
    " Significant network expansion undertaken",
    " Significant capacity expansion in Starlite Lighting for CFLs",
    " Focus on Rural markets.",
    "38",
    "Chapter 3",
    "MCKENSY’S 7S FRAMEWORK and PORTER’S FIVE FORCE MODEL with special",
    "reference to organisation study",
    "1.Structure",
    "39",
    "2.Strategy",
    "Chairman & managing director Shekhar Bajaj’s bold RREP (Range, Reach Expansion Programme)",
    "distribution game-plan has enabled the homegrown electrical major Bajaj Electricals Ltd to maintain",
    "operating margins in its consumer products segment. This is despite a sharp decline in demand for the",
    "company’s conventional lighting products such as CFLs and FTLs, as consumers are increasingly",
    "shifting to LED. Bajaj’s consumer products segment comprises lighting, fans, geysers, room heaters",
    "and coolers, among other appliances. The RREP strategy, which Bajaj had revealed in an exclusive",
    "interview to SEL in October 2016, envisaged integrating multi-electrical products dealers, eliminating",
    "wholesalers, and setting up centralised warehouses in the company’s supply channel.  “Consumer",
    "products segment registered a good performance in spite of steep fall in demand for compact",
    "flourescent lamps (CFL) and flourescent tubelights (FTL) on account of consumer shift to LED-based",
    "products. However, growth in certain other product categories and improvement in first level margins",
    "due to RREP distribution helped the segment maintain its operating margins,” commented Bajaj, on",
    "the company’s results for the fourth quarter and year-ended March 2017.",
    "The Board of Directors has proposed dividend of Rs 2.80 per equity share (140%) for the financial",
    "year, subject to approval by shareholders in the ensuing Annual General Meeting.",
    "3.Staff",
    "Employee Value Proposition:- “We take pride in providing opportunities to our people to learn and",
    "grow. We do this in an environment which is friendly, has the right ethical & human values, in which",
    "people feel empowered to offer their best!” Why should you join us?",
    "We provide opportunities for Innovation",
    "We offer an open & transparent Work Culture",
    "We believe in Empowerment across levels",
    "We offer Equal Opportunities to learn & grow",
    "We support Work Life Balance",
    "Life at BEL:- We are a young and dynamic team with a legacy of over 75 years of spreading happiness",
    "through our products & services. A strong sustainable culture of mutual trust and respect is what makes",
    "40",
    "us an ever-flourishing business. We promote fun at work with an open culture and strongly believe in",
    "empowering our employees.",
    "We believe that excellence is not a destination but a journey of continuous improvement. With our",
    "focus on innovation, we strive to improve our existing systems and processes every single day. We",
    "believe that our employees are the best spokespersons for their experience at Bajaj Electricals, so let’s",
    "hear what they have to say.",
    "4.Skills",
    "Learning & Development:- We nurture a learning environment to address functional and behavioral",
    "training needs. Our interventions include Corporate Induction, Classroom training, Outbound training,",
    "MDPs and a focused learning platform for High Potential employees. We also provide support to our",
    "employees for pursuing professional courses to upgrade their skills.",
    "Rewards & Recognition:- We have an enthusiastic workforce committed to the organization’s",
    "success. To recognize their contribution, we have a quarterly, half yearly and annual Reward &",
    "Recognition program called ‘Achievez’ that acknowledges and celebrates the accomplishments of our",
    "best performing employees. Our ‘Sarvottam Club’ is a platform for extraordinary performers, who get",
    "a chance to go for a company sponsored foreign trip.",
    "5. Style",
    "Communicating a shared vision shows how providing a project team with a vision, can help improve",
    "team motivation and ensure project success. Leadership is the key to change management. Leading",
    "teams through change discusses the challenges of change management and how to motivate your team",
    "during a period of change. A leader's public image is just as important as his or her management ability.",
    "This course examines the expanding role of today's business leaders outside their organizations.",
    "Leadership essentials' uses innovative approaches to develop leaders to better think strategically,",
    "critically, and make decisions that influence their environment. Successful leadership is about acting",
    "and thinking like a leader, activating your best self and unlocking potential in others. So to define",
    "purpose, build credibility and exercise influence, start by asking hard questions about who you are and",
    "what you stand for.",
    "41",
    "6.Systems",
    "Energy management is one of the key concerns of every building owner. Keeping your energy costs",
    "and your carbon footprint down, while maintaining a healthy productive environment, makes your",
    "facility more valuable.",
    "Energy management is no different than most other business tasks. If you can measure it, you can",
    "manage it. The more you measure, the better you can manage. These days it is becoming advantageous",
    "to measure energy usage in great detail, with building owners measuring consumption wherever they",
    "can.",
    "Bajaj Electricals offers complete end-to-end energy management solutions. From meters, to public",
    "displays, to sophisticated dash board based management software, Bajaj has the right products to help",
    "you reduce consumption and save money.",
    "Delta Controls is a market leader in Canada for BMS and HVAC Systems. It has a strong presence",
    "through a global distribution channel spread across 200 locations in 60 countries. It has a strong",
    "presence in USA, UK, Australia, New Zealand and China. It’s a leading BACnet manufacturer and is",
    "a leader in BACnet development globally. Delta Systems are present in 60,000 facilities worldwide",
    "and include commercial offices, manufacturing, airports, hotels and retail applications. Delta controls",
    "provide the world’s first fully integrated systems of Native BACnet controllers for HVAC and Lighting",
    "Controls. Delta’s vision is “Do it right”. Delta’s BACnet building control systems are completely",
    "scalable in size and complexity, providing cost effective solutions for all facility types, including",
    "corporate and government office buildings, schools, colleges and universities; hospitals and health care",
    "facilities; sports, entertainment and recreation centers; hotels, casinos and convention centers;",
    "laboratories and manufacturing plants; airports and transportation. This is an exclusive tie-up with",
    "Bajaj Electricals to market Delta Controls products in India.",
    "7.Shared values",
    " Having complete integrity alignment in what we feel, what we speak and what we do, thereby",
    "demonstrating honesty and having strong moral principles.",
    " Believing in ‘One for all and all for One’ thereby working together to exceed our expectations",
    "in achieving organisational objectives.",
    " Creating conditions and enabling people to take responsibility for enhanced contribution",
    "towards personal and organisational objectives.",
    "42",
    " Proactively anticipating internal and external customer needs and relentlessly working towards",
    "exceeding their expectations.",
    " To continuously explore, develop, create and implement new technology, processes, ideas and",
    "products.",
    " Having firm belief in the reliability, truth and ability of all associates and company processes.",
    "PORTER’S FIVE FORCES MODEL",
    "1.Bargaining power of suppliers",
    "Given the large number of suppliers, they do not have much bargaining power with the limited number",
    "of premier market players. Also, the availability of imports at cheaper prices from other countries could",
    "also present the local suppliers from demanding higher prices.",
    "2. Bargaining power of customers",
    "Since most of the manufacturers offer some kind of products and varieties, customers can easily switch",
    "from one brand to another. Also, as none of the market players have a strong hold of market leadership,",
    "Competitive prices are maintained in the market which gives the customer the freedom to go for a",
    "particular brand he/she wishes. So though customer can switch from one brand to another the price set",
    "by the company depends on the market and not according to will of customer.",
    "43",
    "3. Threat of New Entrants",
    "The technology requirements for setting up an electrical fan company are not much advanced, But",
    "considering the recent mandates set by the government boards on the energy efficient standards, it",
    "requires a reasonable capital to invest. Also the stiff competition in the industry may prevent the",
    "competitors from entering into the market.",
    "4. Threat of substitutes",
    "The unorganised sector has always been posing as a threat with almost 30% market share. But",
    "considering the awareness among consumers on the quality levels, energy efficient products for power",
    "saving, there has been a shift to premier brands. Hence, it can subsequently be eliminated as a threat",
    "in the future course. Also there is no cheaper substitute of a fan for summers.",
    "5. Industry Rivalry",
    "There a fierce competition in the industry to distinguish their brands, which is resulting in continuous",
    "product innovations in the design and technology. In effect, the market shares are invariantly small",
    "equally distributed among the top players themselves.",
    "Chapter 4",
    "SWOT ANALYSIS OF BAJAJ ELECTRICALS",
    "Bajaj Electricals is a company that manufactures electrical products in the Indian market. It is an",
    "initiative of the Bajaj company and is based in Mumbai, India. It has introduced several products in",
    "the market at affordable price. They are best known for their fans and lights but they also produce lots",
    "of other electrical devices.",
    "They have made the name by lighting the Bandra Worli Sea Link and also the stadium of",
    "Commonwealth Games. The current revenue generated by the company is Rs 27.7 million. They have",
    "also tied up with the British company Morphy Richards to sell their products in India.",
    "Strength in The SWOT analysis of Bajaj Electricals",
    "Every company possesses some strengths that define their success in the market. Let us see the",
    "strengths of Bajaj Electricals:",
    "44",
    " Variety in their products and services:  Bajaj has several kinds of product that one can go",
    "for. Along with the mass consumer market, they also work for technology companies to",
    "provide them there needs. The electrical goods range from light bulbs to blenders to sewing",
    "machine which is a very diverse field. An array of products are found that Indians never",
    "imagined about. They have everything from room heaters to innovative roti makes at great",
    "prices.",
    " Reputed company: Bajaj is present in one way or other in every Urban and Rural household",
    "of India. People trust them for the quality and service that they provide. The parent company",
    "has also invested in making hair oils which is also quite good.",
    " Brilliant Service:  The company has set up 19 big offices throughout India and has",
    "282 customer care  centers that can be found easily. This is important as a customer is able to",
    "sort out any problems with a device of the company.",
    " Availability : Bajaj products are found in almost all electrical supply stores in India. There are",
    "over 400,000 retail outlets of Bajaj which is quite remarkable. They have also kept their",
    "products in several options so that people can use them easily.",
    " Pricing:  Bajaj products are priced very well and almost all families are able to afford it. They",
    "have brought items like the rice cooker, otg ovens, hand mixers into India in a very cost-",
    "effective way. They have made sure for a long time and everyone is able to use the products",
    "that they make.",
    "Weakness in The SWOT analysis of Bajaj Electricals",
    "Points like weaknesses can become threatening to the company if they do not work on it. Here are",
    "some weaknesses of Bajaj electricals:",
    " Very Competitive Market:  Bajaj has to deal with a market that has the second largest",
    "population of the world. So, there are also other companies who are interested in the market.",
    "The brand Philips has created a lot of problem in the recent years because of their eminent and",
    "modern lighting system. This is a point in which Bajaj Electricals definitely need to work a lot.",
    " Only available in India : To grow a company one has to spread it outside their local market.",
    "Bajaj has been unable to do that which has caused them to be limited to India. Spreading into",
    "other countries does help in propagating any company a lot and also helps them in",
    "understanding different choices around the world.",
    "45",
    "Opportunities in The SWOT analysis of Bajaj Electricals",
    "When a company grabs the opportunities in front of them, they succeed much more. Here are some",
    "opportunities for Bajaj Electricals:",
    " Expanding into the Global Market: This is a must do the thing for Bajaj. They can definitely",
    "start by introducing themselves to the neighbouring countries of India to create themselves a",
    "bigger market. This lets them taste new things and also helps them create a reputation on",
    "an internationa l level.",
    " New and Innovative Products:  Yes, Bajaj has lots of product in their range but they need",
    "more. They need to make sleeker products that are more easy to use. Also, luxury electrical",
    "products are also needed in the current Indian market. They can do this to have a better",
    "competition in the market.",
    " Introducing better technology: Anything Bajaj has made is always contended by-product for",
    "another company. But now they need to do something that would be totally exclusive to them.",
    "They also need to bring more technology into the lighting field to make it more eco-friendly",
    "and energy efficient.",
    " Eco-friendly and energy saving products: Bajaj should focus on making things eco-friendly",
    "and help in innovating devices based on that. This is crucial in case of household lighting as",
    "other companies have already started to focus on that field.",
    "Threats in The SWOT analysis of Bajaj Electricals",
    "Threats can soon derail a company and that is why it is important to tackle them soon. Here are some",
    "threats that Bajaj electricals can face:",
    " Competition in Price:  Several small start ups in India are  pricing  their products in affordable",
    "options. People are often gravitating towards them.",
    " Competition: The Dutch company Phillips is already threatening the lighting market of",
    "Bajaj. Crompton Greaves  is also contending them in appliances and other files. They can pull in",
    "existing consumers of Bajaj Electricals.",
    "46",
    "Chapter 5",
    "ANALYSIS OF FINANCIAL STATEMENTS",
    "Financial statements for 5yrs chart",
    "Balance sheet of bajaj electricals",
    "BALANCE SHEET OF BAJAJ",
    "ELECTRICALS (in Rs. Cr.) MAR 20 MAR 19 MAR 18 MAR 17 MAR 16",
    "12 months 12 months           12",
    "months  12 months 12 months",
    "EQUITIES AND LIABILITIES",
    "SHAREHOLDER'S FUNDS",
    "Equity Share Capital 22.75 20.48 20.41 20.26 20.19",
    "TOTAL SHARE CAPITAL 22.75 20.48 20.41 20.26 20.19",
    "Reserves and Surplus 1,343.90 1,048.08 924.13 851.24 723.44",
    "TOTAL RESERVES AND SURPLUS 1,343.90 1,048.08 924.13 851.24 731.31",
    "47",
    "TOTAL SHAREHOLDERS FUNDS 1,379.26 1,077.70 944.54 871.50 751.50",
    "NON-CURRENT LIABILITIES",
    "Long Term Borrowings 79.91 212.62 11.47 16.95 95.98",
    "Deferred Tax Liabilities [Net] 0.00 0.00 0.00 0.00 0.00",
    "Other Long Term Liabilities 146.17 67.92 67.59 75.02 14.16",
    "Long Term Provisions 22.38 16.44 11.30 13.39 44.71",
    "TOTAL NON-CURRENT",
    "LIABILITIES 248.47 296.98 90.36 105.37 154.84",
    "CURRENT LIABILITIES",
    "Short Term Borrowings 657.57 1,364.92 706.15 528.58 100.94",
    "Trade Payables 900.30 1,092.13 854.42 635.74 1,145.24",
    "Other Current Liabilities 1,285.59 1,238.85 812.33 880.00 656.70",
    "Short Term Provisions 87.35 89.64 64.68 65.53 69.78",
    "TOTAL CURRENT LIABILITIES 2,930.81 3,785.54 2,437.59 2,109.85 1,972.67",
    "TOTAL CAPITAL AND",
    "LIABILITIES 4,558.54 5,160.30 3,472.70 3,086.72 2,879.00",
    "ASSETS",
    "NON-CURRENT ASSETS",
    "Tangible Assets 401.35 318.01 312.55 310.04 278.93",
    "Intangible Assets 2.85 4.27 3.28 0.02 0.00",
    "Capital Work-In-Progress 9.37 6.93 3.50 7.85 20.67",
    "Other Assets 0.00 0.00 0.00 0.00 0.00",
    "FIXED ASSETS 415.14 331.61 322.17 317.91 299.60",
    "Non-Current Investments 52.86 50.74 14.49 80.34 56.09",
    "48",
    "Deferred Tax Assets [Net] 45.31 63.77 73.53 55.95 50.32",
    "Long Term Loans And Advances 41.87 16.07 0.06 2.90 146.53",
    "Other Non-Current Assets 715.19 717.85 386.03 504.42 307.13",
    "TOTAL NON-CURRENT ASSETS 1,270.36 1,180.04 796.29 961.53 859.67",
    "CURRENT ASSETS",
    "Current Investments 0.00 0.00 0.00 0.00 3.33",
    "Inventories 690.77 821.03 579.16 571.20 506.68",
    "Trade Receivables 2,048.99 2,622.94 1,748.75 1,342.26 1,362.07",
    "Cash And Cash Equivalents 104.68 16.02 25.74 65.27 55.50",
    "Short Term Loans And Advances 0.03 0.02 0.05 0.07 52.56",
    "OtherCurrentAssets 443.71 520.25 322.71 146.40 39.20",
    "TOTAL CURRENT ASSETS 3,288.18 3,980.26 2,676.41 2,125.19 2,019.33",
    "TOTAL ASSETS 4,558.54 5,160.30 3,472.70 3,086.72 2,879.00",
    "OTHER ADDITIONAL",
    "INFORMATION",
    "CONTINGENT LIABILITIES,",
    "COMMITMENTS",
    "Contingent Liabilities 361.83 297.30 242.09 296.47 291.33",
    "CIF VALUE OF IMPORTS",
    "Raw Materials 0.00 0.00 0.00 0.00 10.85",
    "Stores, Spares And Loose Tools 0.00 0.00 0.00 0.00 305.65",
    "Trade/Other Goods 0.00 0.00 0.00 0.00 305.65",
    "Capital Goods 0.00 0.00 0.00 0.00 3.93",
    "EXPENDITURE IN FOREIGN",
    "EXCHANGE",
    "49",
    "Expenditure In Foreign Currency 339.29 480.50 0.00 0.00 15.80",
    "REMITTANCES IN FOREIGN",
    "CURRENCIES FOR DIVIDENDS",
    "Dividend Remittance In Foreign",
    "Currency  -- -- -- -- --",
    "EARNINGS IN FOREIGN",
    "EXCHANGE",
    "FOB Value Of Goods -- -- -- -- 35.83",
    "Other Earnings 114.42 88.95 -- -- 0.25",
    "BONUS DETAILS",
    "Bonus Equity Share Capital 11.04 11.04 11.04 11.04 11.04",
    "NON-CURRENT INVESTMENTS",
    "Non-Current Investments Quoted Market",
    "Value -- -- -- -- --",
    "Non-Current Investments Unquoted",
    "Book Value  12.86 10.74 7.65 62.82 56.11",
    "CURRENT INVESTMENTS",
    "Current Investments Quoted Market",
    "Value -- -- -- -- --",
    "Current Investments Unquoted Book",
    "Value -- -- -- -- 3.33",
    "50",
    "P&L Account of bajaj electricals",
    "PROFIT & LOSS ACCOUNT OF",
    "BAJAJ ELECTRICALS (in Rs. Cr.) MAR",
    "20 MAR",
    "19 MAR",
    "18 MAR",
    "17 MAR",
    "16",
    "12",
    "months  12",
    "months  12",
    "months  12",
    "months  12",
    "months",
    "INCOME",
    "REVENUE FROM OPERATIONS",
    "[GROSS] 4,929.26  6,633.69  4,695.96  4,282.28  4,628.14",
    "Less: Excise/Service Tax/Other Levies  0.00 0.00 8.94 36.55 36.41",
    "REVENUE FROM OPERATIONS",
    "[NET] 4,929.26  6,633.69  4,687.02  4,245.73  4,591.74",
    "TOTAL OPERATING REVENUES 4,977.09  6,673.14  4,707.45  4,261.71  4,611.95",
    "Other Income  52.63 65.43 53.19 35.59 22.85",
    "TOTAL REVENUE 5,029.72  6,738.57  4,760.64  4,297.30  4,634.80",
    "EXPENSES",
    "Cost Of  Materials Consumed  305.12  469.21  327.13  195.46  178.59",
    "Operating And Direct Expenses  310.63  443.76  310.43  293.79  294.57",
    "Changes In Inventories Of FG,WIP",
    "And Stock -In Trade  87.97 -216.71  0.11 -15.12  -31.82",
    "Employee Benefit Expenses  383.40  356.66  317.88  328.90  283.69",
    "Finance Costs  169.16  115.88  58.86 80.44 101.40",
    "Depreciation And Amortisation",
    "Expenses  68.01 38.46 33.94 29.87 27.24",
    "Other Expenses  744.74  810.53  681.23  639.00  692.59",
    "TOTAL EXPENSES 5,007.33  6,479.13  4,506.81  4,129.26  4,481.21",
    "51",
    "PROFIT/LOSS BEFORE",
    "EXCEPTIONAL,",
    "EXTRAORDINARY ITEMS AND",
    "TAX 22.39 259.44  253.83  168.04  153.58",
    "Exceptional Items  0.00 0.00 -89.36 0.00 0.00",
    "PROFIT/LOSS BEFORE TAX 22.39 259.44  164.47  168.04  153.58",
    "TAX EXPENSES-CONTINUED",
    "OPERATIONS",
    "Current Tax  1.19 80.30 100.60  66.00 59.30",
    "Less: MAT Credit Entitlement  0.00 0.00 0.00 0.00 0.00",
    "Deferred Tax  21.33 12.07 -19.77 -5.62 -1.44",
    "Tax For Earlier Years  0.00 0.00 0.02 0.00 0.12",
    "TOTAL TAX EXPENSES 22.52 92.37 80.85 60.38 57.98",
    "PROFIT/LOSS AFTER TAX AND",
    "BEFORE EXTRAORDINARY",
    "ITEMS -0.13 167.07  83.62 107.66  95.60",
    "PROFIT/LOSS FROM",
    "CONTINUING OPERATIONS -0.13 167.07  83.62 107.66  95.60",
    "PROFIT/LOSS FOR THE PERIOD -0.13 167.07  83.62 107.66  95.60",
    "OTHER ADDITIONAL",
    "INFORMATION",
    "EARNINGS PER SHARE",
    "Basic EPS (Rs.)  -0.01 16.34 8.23 10.65 9.48",
    "Diluted EPS (Rs.)  -0.01 16.30 8.19 10.63 9.46",
    "VALUE OF IMPORTED AND",
    "INDIGENIOUS RAW MATERIALS",
    "STORES, SPARES AND LOOSE",
    "TOOLS",
    "52",
    "Imported Raw Materials  0.00 0.00 0.00 0.00 12.54",
    "Indigenous Raw Materials  0.00 0.00 0.00 0.00 160.23",
    "STORES, SPARES AND LOOSE",
    "TOOLS",
    "Imported Stores And Spares  0.00 0.00 0.00 0.00 0.00",
    "Indigenous Stores And Spares  0.00 0.00 0.00 0.00 8.35",
    "DIVIDEND AND DIVIDEND",
    "PERCENTAGE",
    "Equity Share Dividend  0.00 35.75 28.40 0.00 28.28",
    "Tax On Dividend  0.00 7.35 5.78 0.00 5.75",
    "Equity Dividend Rate (%)  0.00 175.00  175.00  140.00  140.00",
    "Report on Financial Statements",
    "We have audited the accompanying standalone financial statements of Bajaj Electricals Limited (\"the",
    "Company\"), which comprise the Balance Sheet as at March 31,2016 , the Statement of Profit and Loss,",
    "the Cash Flow Statement for the year then ended, and a summary of the significant accounting policies",
    "and other explanatory information.",
    "Management's Responsibility for the Standalone Financial Statements",
    "The Company's Board of Directors is responsible for the matters stated in Section 134(5) of the",
    "Companies Act, 2013 (\"the Act\") with respect to the preparation of these standalone financial",
    "statements to give a true and fair view of the financial position, financial performance and cash flows",
    "of the Company in accordance with the accounting principles generally accepted in India, including",
    "the Accounting Standards specified under Section 133 of the Act, read with Rule 7 of the Companies",
    "(Accounts) Rules, 2014. This responsibility also includes maintenance of adequate accounting records",
    "in accordance with the provisions of the Act for safeguarding of the assets of the Company and for",
    "preventing and detecting frauds and other irregularities; selection and application of appropriate",
    "53",
    "accounting policies; making judgments and estimates that are reasonable and prudent; and design,",
    "implementation and maintenance of adequate internal financial controls, that were operating",
    "effectively for ensuring the accuracy and completeness of the accounting records, relevant to the",
    "preparation and presentation of the financial statements that give a true and fair view and are free from",
    "material misstatement, whether due to fraud or error.",
    "Opinion",
    "8. In our opinion and to the best of our information and according to the explanations given to us, the",
    "aforesaid standalone financial statements give the information required by the Act in the manner so",
    "required and give a true and fair view in conformity with the accounting principles generally accepted",
    "in India, of the state of affairs of the Company as at March 31, 2016, and its profit and its cash flows",
    "for the year ended on that date.",
    "Learning Experience:",
    "Knowledge comes out by studying volumes of books through continuous learning.",
    "It had been privilege to undertake an organization study about “the largest & most profitable",
    "construction equipment company” which is conferred with Mini-Ratna status. Though the study was",
    "online based on secondary sources, It was a wonderful experience & indeed a great learning about a",
    "multi-technology company which offers high quality products to the various sectors of the economy.",
    "The learning’s acquired from the India’s largest wealth creator BAJAJ ELECTRICALS LTD are many",
    "along which a few are penned.",
    " A part from learning as to how the organization function, its structure, departments, policies &",
    "processes the study has opened the doors to explore the organization, whose operation are",
    "highly refined.",
    " The study has also helped to know about the technological advancement in various equipment",
    "of different sectors.",
    " The contributions made in enhancement of infrastructure and others sectors in the country.",
    " The functioning of the various departments quality policies of the organization & innovative",
    "management practices followed by the organization.",
    " The cordial relationship between the workers & the management has helped in understanding",
    "the fact that, the success of the organization depends not on employees or on management alone",
    "but it depends on the combined efforts of both the employees and management.",
    "54",
    " The commitment of the employees towards quality is a great inspiration.",
    " The working of the entire Bajaj Electricals Ltd as one family taught the basic concepts of team",
    "building.",
    "The overall study in the organization has ignited the spark in the mind to take part in such",
    "company as an employee in the later days that would serve as an asset to the entire country &",
    "the human race.",
    "Reference :",
    " https://www.bajajelectricals.com/about-us/",
    " https://www.moneycontrol.com/financials/bajajelectricals/ratiosVI/BE",
    " https://www.marketing91.com/swot-analysis-of-bajaj-electricals/",
    " http://www.moneycontrol.com/company-management/bajajelectricals/board-of-directors/BE",
    " https://www.bajajelectricals.com/our-vision/",
    " https://www.bajajelectricals.com/csr/",
    " https://www.bajajelectricals.com/consumer-products/",
    " https://illumination.bajajelectricals.com/blog",
    " https://economictimes.indiatimes.com/bajaj-electricals-ltd/shareholding/companyid-13978.cms",
    " https://www.bajajelectricals.com/exports/",
    "55",
    "WEEKLY PROGRESS REPORT",
    "Student Name Varalakshmi B V",
    "USN 1CR19MBA88",
    "Title of the Study An Organisation study of Bajaj Electricals Ltd.",
    "Organization Bajaj Electricals Limited",
    "WEEK-1",
    "Duration (start date - End date) 6.8.2020 - 12.8.2020",
    "Chapter s covered Chapter 1 and Chapter 2",
    "Descriptions of activities performed",
    "during the week Introduction to organization, Industry profile and",
    "company profile",
    "WEEK-2",
    "Duration (start date - End date) 13.8.2020 - 18.8.2020",
    "Chapter s covered Chapter 3",
    "Descriptions of activities performed",
    "during the week McKensy's 7S framework, Porter's Five Force",
    "Model.",
    "WEEK-3",
    "Duration (start date - End date) 19.8.2020 - 26.8.2020",
    "Chapter s covered",
    "Chapter 4 and Chapter 5",
    "Descriptions of activities performed",
    "during the week SWOT Analysis and analysis of financial",
    "statements",
    "WEEK-4",
    "Duration (start date - End date) 27.8.2020 - 30.8.2020",
    "Chapter s covered Chapter 6",
    "Descriptions of activities performed",
    "during the week Learning experience and Bibliography",
    "Signature of the Student                                   Signature of the Guide",
    "1CR19MBA88"
]