[
    "FINANCIAL PERFORMANCE ANALYSIS OF",
    "RELIANCE  RETAIL LIMITED , MUMBAI",
    "PROJECT  REPORT",
    "Submitted to Mahatma Gandhi University in partial fulfillment",
    "of the requirements for the  award  of the  Degree  of",
    "MASTER  OF  BUSINESS  ADMINISTRATION",
    "Submitted  by",
    "JOJIS P JOSEPH",
    "Reg.  No:  190031000660",
    "Under  the guidance  of",
    "Prof. Dr. VP Vijayamohan",
    "Faculty  Guide",
    "Accredited  by NAAC  with  ‘A’  Grade",
    "DEPARTMENT  OF  MANAGEMENT  STUDIES",
    "MAR ATHANASIOS COLLEGE FOR ADVANCED STUDIES",
    "THIRUVALLA",
    "2021",
    "CERTIFICATE",
    "This is to certify that the project report entitled “FINANCIAL PERFORMANCE OF",
    "RELIANCE RETAIL Ltd. Mumbai.” is a bonafide report of the project work undertaken by",
    "JOJIS P JOSEPH , fourth semester MBA student of our college during a period of  8 weeks",
    "commencing from 1st April to 31st May,2021.",
    "Prof.Dr. VP Vijayamohan                                                    Dr. Sudeep B. Chandramana",
    "Faculty Guide                                             Head, Dept. of management Studies",
    "Rev. Dr. Cherian  J.Kottayil",
    "Principal                                                                                                               University Examiner",
    "MAR ATHANASIOS COLLEGE",
    "FOR ADVANCED STUDIES",
    "TIRUVALLA",
    "Ph: 0469 2730323 Fax: 0469 2730317  macfast@macfast.org",
    "www.macfast.org",
    "DECLARATION",
    "I hereby  declare  that  this  project  report  entitled  “FINANCIAL",
    "PERFORMANCE ANALYSIS OF RELIANCE RETA IL L IMITED, MUMBAI ”",
    "is a bonafide report of the study undertaken by me, under the  guidance of Prof.",
    "Dr. VP Vijayamohan , Department of Management Studies,  MACFAST,",
    "Tiruvalla.",
    "I also  declare  that  this  project  report  has  not  been  submitted  to any  other",
    "University  or Institute  for the  award  of any  degree  or diploma.",
    "Place  : Tiruvalla",
    "Date  : 31-05-2021  Jojis  P Joseph",
    "ACKNOWLEDGEMENT",
    "With  immense  pleasure,  I would  like  to present  this  project  report  of Reliance  Retail  Ltd,  which",
    "would  not  have  been  possible  without  the goodwill  and  support  of the people  around.  I express",
    "my  sincere  gratitude  to Prof.  Dr.  VP  Vijayamohan,  who  provided  his valuable  suggestions  and",
    "precious time in accomplishing my project report. Under his guidance, I had successfully",
    "completed this project on time. I also extend my sincere appreciation to all the Faculties of",
    "Management at Macfast to shape my understanding towards the project. As a student of “Mar",
    "Athanasios  college of  Advanced  Studies”,  Tiruvalla.  I would  like to  exte nd my sincere",
    "gratitude and thanks to our principal ‘Fr. Cherian J Kottayil’ for providing me an opportunity",
    "to undergo  Project  at Reliance  Retail  Limited.  It was  because  of their  immense  help  and  support",
    "that  this project has been  duly  completed.",
    "Lastly,  I would  like  to thank  the almighty  and  my  parents,  teachers  for their  moral  support  and",
    "my  friends  with  whom  I shared  my  day -to-day  experience  and  received  lots  of suggestions  that",
    "improved my  quality  of work.",
    "JOJIS  P JOSEPH",
    "LIST  OF TABLES",
    "Table  No.  Title  Page  No.",
    "5.1 Comparative  Balance  Sheet  of Reliance  Retail Limited",
    "(RRL)  for the year  2015  & 2016  60",
    "5.2 Comparative  Balance  Sheet  of Reliance  Retail  Limited",
    "(RRL)  for the year  2016  & 2017  61",
    "5.3 Comparative  Balance  Sheet  of Reliance  Retail  Limited",
    "(RRL)  for the year  2017  & 2018  62",
    "5.4 Comparative  Balance  Sheet  of Reliance  Retail  Limited",
    "(RRL)  for the year  2018  & 2019  63",
    "5.5 Comparative  Balance  Sheet  of Reliance  Retail  Limited",
    "(RRL)  for the year  2019 &  2020  64",
    "5.6 Common  –size  Balance Sheet  of Reliance  Retail",
    "Limited  (RRL)  for the year  2015  & 2016  65",
    "5.7 Common  –size  Balance Sheet  of Reliance  Retail",
    "Limited  (RRL)  for the year  2016  & 2017  66",
    "5.8 Common  –size  Balance Sheet  of Reliance  Retail",
    "Limited  (RRL)  for the year  2017  & 2018  67",
    "5.9 Common  –size  Balance Sheet  of Reliance  Retail",
    "Limited  (RRL)  for the year  2018  & 2019  68",
    "5.10  Common  –size  Balance Sheet  of Reliance  Retail",
    "Limited  (RRL)  for the year  2019  & 2020  69",
    "5.11  Table  calculating  trend  analysis  for Net  Profit  70",
    "5.12  Table  showing  the trend  for Estimated  Profit  from",
    "2020 -21 to 2024 -25 71",
    "5.13  Table  calculating  trend  analysis  for Net  Sales  72",
    "5.14  Table  showing  the trend  for Estimated  Sales from",
    "2020 -21 to 2024 -25 73",
    "5.15  Table  Showing  Current  Ratio  for the 5 years",
    "(2016  – 2020)  74",
    "5.16  Table  Showing  Quick  Ratio  for the 5 years",
    "(2016 -2020)  75",
    "5.17  Table  Showing  Cash/absolute  ratio  for the 5 years",
    "(2016 -2020)  76",
    "5.18  Table  showing  Debt -Equity  Equity  ratio  for the years",
    "(2015 -16 to 2019 -20)  77",
    "5.19  Table  showing  Proprietary  ratio  for the years",
    "(2015 -16 to 2019 -20)  78",
    "5.20  Table  showing  Solvency  ratio for  the years",
    "(2015 -16 to 2019 -20)  79",
    "5.21  Table  showing  Fixed  Asset  ratio  for the years",
    "(2015 -16 to 2019 -20)  80",
    "5.22  Table  showing  Interest  Coverage  ratio  for the years",
    "(2015 -16 to 2019 -20)  81",
    "5.23  Table  showing  Fixed  Assets  ratio  for the years",
    "(2015 -16 to 2019 -20)  82",
    "5.24  Table  showing  Gross  profit  ratio  for the years",
    "(2015 -16 to 2019 -20)  83",
    "5.25  Table  showing  Operating  ratio  for the years",
    "(2015 -16 to 2019 -20)  84",
    "5.26  Table  showing  Operating  Profit  Margin for  the years",
    "(2015 -16 to 2019 -20)  85",
    "5.27  Table  showing  PAT  Margin  for the years",
    "(2015 -16 to 2019 -20)  86",
    "5.28  Table  showing  Return  on Equity  for the years",
    "(2015 -16 to 2019 -20)  86",
    "5.29  Table  showing  Return  on Investment  for the years",
    "(2015 -16 to 2019 -2020)  87",
    "5.30  Table  showing  Capital  Turnover  ratio  for the years",
    "(2015 -16 to 2019 -20)  88",
    "5.31  Table  showing  Inventory  Turnover  ratio  for the years",
    "(2015 -16 to 2019 -20)  89",
    "5.32  Table  showing  Fixed  asset  turnover  ratio",
    "for the years  (2015 -16 to 2019 -20)  90",
    "5.33  Table  showing  Working  Capital  turnover  ratio",
    "for the years  (2015 -16 to 2019 -20)  91",
    "5.34  Table  showing  Trade  Receivables turnover  ratio",
    "for the years  (2015 -16 to 2019 -20)  92",
    "5.35  Table  calculating  Net  Profit  Margin  93",
    "5.36  Table  calculating  Total  asset  turnover  94",
    "5.37  Table  calculating  Leverage  factor  94",
    "5.38  Table  calculating  Du-pont  analysis  94",
    "5.39  ROE  comparison  95",
    "5.40  Calculating  Correlation  analysis  –sales and  profit  96",
    "LIST  OF GRAPHS",
    "Graph.  No.  Title  Page No.",
    "5.1 Graph  showing  estimated profit  for the years",
    "2020 -21 to 2024 -25 71",
    "5.2 Graph  showing  estimated  net sales for  the period of  next five",
    "years  (2020 -21 to 2024 -25)  73",
    "5.3 Graph  Showing  Current  Ratio  analysis  (2015 -16 to 2019 -20) 74",
    "5.4 Graph  showing  Quick/  Liquidity  Ratio for  the 5 years",
    "(2015 -16 to 2019 -2020)  75",
    "5.5 Graph  showing  Cash/ Absolute  Ratio",
    "(2015 -16 to 2019 -2020)  76",
    "5.6 Graph  showing  Debt -Equity  ratio  for the years",
    "(2015 -16 to 2019 -20)  77",
    "5.7 Graph  showing  Proprietary  ratio  for the years",
    "(2015 -16 to 2019 -20)  78",
    "5.8 Graph  showing  Solvency  ratio for  the years",
    "(2015 -16 to 2019 -20)  79",
    "5.9 Graph  showing  Fixed  Asset  ratio  for the years",
    "(2015 -16 to 2019 -20)  80",
    "5.10  Graph  showing  Interest  Coverage  ratio  for the years",
    "(2015 -16 to 2019 -20)  81",
    "5.11  Graph  showing  Fixed  assets  to Net  worth  ratio  for the years",
    "(2015 -16 to 2019 -20)  82",
    "5.12  Graph  showing  Gross  profit ratio  for the years",
    "(2015 -16 to 2019 -20)  83",
    "5.13  Graph  showing  Operating  ratio  for the years",
    "(2015 -16 to 2019 -20)  84",
    "5.14  Graph  showing  Operating  Profit  Margin  for the years",
    "(2015 -16 to 2019 -20)  85",
    "5.15  Graph  showing  PAT  Margin  for the years",
    "(2015 -16 to 2019 -20)  86",
    "5.16  Graph  showing  Return on  Equity  for the years",
    "(2015 -16 to 2019 -20)  87",
    "5.17  Graph  showing  Return  on Investment  for the years",
    "(2015 -16 to 2019 -20)  88",
    "5.18  Graph  showing  Capital  turnover  ratio for  the years",
    "(2015 -16 to 2019 -20)  89",
    "5.19  Graph  showing  Inventory  turnover  ratio",
    "for the years  (2015 -16 to 2019 -20)  90",
    "5.20  Graph  showing  Fixed  Asset  turnover  ratio",
    "for the years  (2015 -16 to 2019 -20)  91",
    "5.21  Graph  showing  Working  Capital  turnover  ratio",
    "for the years  (2015 -16 to 2019 -20)  92",
    "5.22  Trade  Receivables  turnover  ratio  93",
    "5.23  Du-pont  analysis  95",
    "5.24  Correlation  analysis  97",
    "ABBREVIATIONS",
    "FDI: Foreign Direct Investment",
    "ROI:  Return  on Investment",
    "RoE: Return on Equity",
    "PAT:  Profit  After  Tax",
    "PBIT:  Profit  before  Interest  & Tax",
    "EBITDA:  Earning  before  Interest  Tax  Depreciation  & Amortisation",
    "CAGR  : Compounded Annual Growth Rate",
    "FMCG:  Fast  Moving  Consumer  Goods",
    "FY: Indian Financial Year (April to March)",
    "IT: Information Technology",
    "MoU: Memorandum of Understanding",
    "MT:  Million Tonnes",
    "MTPA: Million Tonnes Per Annum",
    "RIL: Reliance Industries Limited",
    "RRL:  Reliance  Retail  Limited",
    "SEZ: Special Economic Zone",
    "US$:  US Dollar",
    "GMV:  Gross  Merchandise  Value",
    "CONTENTS",
    "Page  No.",
    "ACKNOWLEDGEMENT  (i)",
    "LIST  OF  TABLES  (ii-iii)",
    "LIST  OF  FIGURES  (iv)",
    "ABBREVIATIONS  (v)",
    "Sl.No.  CHAPTERS  Page  no.",
    "1. CHAPTER  I – INTRODUCTION",
    "1.1 Background of the  Study",
    "1.2 Statement  of the Problem",
    "1.3 Relevance  & Scope  of the  Study",
    "1.4 Objectives of the Study  1",
    "2",
    "3",
    "4",
    "4",
    "2. CHAPTER  II – INDUSTRY  PROFILE",
    "2.1 Business  Process  of the Industry",
    "2.2 Market  Demand  & Supply  – Contribution to  GDP  – Revenue  Generation",
    "2.3 Level  and  Type  of Competition  – Firms  Operating  in the Industry",
    "2.4 Pricing  Strategies  in the Industry",
    "2.5 Prospects  and  Challenges  of the Industry",
    "2.6 Key  Drivers  of the Industry  5",
    "6",
    "17",
    "28",
    "33",
    "35",
    "37",
    "CHAPTER  III – REVIEW  OF  LITERATURE",
    "3.1 Brief  Theoretical  Construct  related  to the Problem",
    "3.2 An Overview  of Earlier  Studies",
    "3.3 Uniqueness  of Research Study  42",
    "3. 43",
    "53",
    "55",
    "4. CHAPTER  IV – METHODOLOGY  OF  THE  STUDY",
    "4.1 Research  Approach  and  design",
    "4.2 Sources  of Data",
    "4.3 Data  Analysis  Tools",
    "4.4 Report  Structure",
    "4.5 Limitations  of the Study  56",
    "57",
    "57",
    "57",
    "57",
    "57",
    "5.",
    "CHAPTER  V DATA  ANALYSIS,  INTERPRETATION  AND  INFERENCE",
    "58",
    "6.",
    "CHAPTER  VI FINDINGS  OF  THE  STUDY",
    "98",
    "7.",
    "CHAPTER  VII  CONCLUSION",
    "102",
    "ANNEXURE",
    "BIBLIOGRAPHY",
    "1",
    "CHAPTER I",
    "INTRODUCTION",
    "2  The concept of financial performance analysis is the process of identifying financial strength",
    "of the company with the help of its Profit and loss account, and Balance sheet.  Reliance",
    "Retail is an Indian retail company, a subsidiary of Reliance Industries Limited . Founded in",
    "2006,  it is the largest  retailer  in India  in terms  of revenue.  Its retail  outlets  offer  foods,  groceries,",
    "apparel, footwear, toys, home improvement products, electronic goods, and farm implements",
    "and  inputs.  Apart  from  physical  outlets,  the company  also  sells  products  on its e-",
    "commerce channels.",
    "The  financial  performance  analysis  of the company  is done  for the period  of five  years,  starting",
    "from the financial year 2015 -2016 to 2019 -2020. The objective of this study to evaluate the",
    "financial  position  of the company,  analyse  financial  changes  and  identify  future  result  by using",
    "ratio and trend analysis, to know whether the business is making profit or not, is maintaining",
    "liquidity  position, and  to know the growth of the  company.",
    "The ratios used  in this project are in terms of solvency, liquidity, turnover, and profitability",
    "ratios.  The  trend  analysis  has  done  for the indicators  such  as Sales  and  Expenses.  The  company",
    "performance  was  good  during  the period  2016,  2017,  2018  and  2019  but  in 2020,  the company",
    "performance was not affected, due to lockdown happened cause of Covid -19 Pandemic across",
    "countries and affected the  exports of  the company.",
    "1.1 BACKGROUND  OF  THE STUDY",
    "Analysis of financial performance of a company is the process of determining th e significant",
    "operating  and  financial  characteristics  of a firm  from  the accounting  data.  It is the treatment  of",
    "the information  contained  in the financial  statements  to afford  a full  diagnosis  of the",
    "profitability  and  financial  position  of the firm.  It helps  executives  to evaluate  past  performance,",
    "present financial position, liquidating situation, profitability of the firm and to make forecast",
    "for the future  earnings.",
    "Financial  performance  analysis  is the process  of identifying  the financial  strengths  and",
    "weaknesses of the firm by properly establishing the relationship between the items of balance",
    "sheet and profit and loss account. There are many tools to find financial performance of the",
    "company,  one  of the  most useful tools is  ratio and trend analysis.",
    "The  analysis  of financial  statements  consists  of a study  of relationships  and  trends  to determine",
    "whether or not the financial position of the concern and its operating efficiency have been",
    "satisfactory.  Here,  In the process  of this  analysis  various  tools  or methods  are used  which",
    "3  include: (1) Comparative Statements, (2) Common -size Statements, (3) Trend Ratios (trend",
    "percentages), (4)  Ratio Analysis (5)  Correlation and (6)  Du-pont  Analysis.",
    "The financial performance analysis is done to find the firm’s current position with that of",
    "market  situation.  Although  performance  measurement  systems  can  play  a key  role  in",
    "communicating,  evaluating,  and  rewarding  the achievement  of strategic  objectives.  One  of the",
    "primary criticisms of performance measurement systems is that they are generally limited to",
    "financial indicators, thereby focusing the organization on past performance and encouraging a",
    "short -term  view of  strategic objectives.",
    "Financial  performa nce  analysis  involves  using  financial  data  to assess  a company’s",
    "performance and make recommendations about how it can improve going forward. The study",
    "helps to assess the earning capacity / profitability, solvency, financial strength, operating",
    "efficiency  and to analyze the trends of Reliance Retail Industries by comparing the ratios for",
    "the same over  a period of  five  years.",
    "This  study  helps  to evaluate  the relationship  between  component  parts  of a  financial  statement",
    "to obtain a better understanding of a firm’s position and performance. This study aims to",
    "present complex data contained in the financial statement in simple and understandable form",
    "to provide investors (current and potential), creditors and management to evaluate the past,",
    "current and project conditions and performance of the firm and use to compare the strengths",
    "and weaknesses in various firms by  using  secondary  data.",
    "1.2 STATEMENT  OF  THE  PROBLEM",
    "Though financial statements are relevant and useful for the con cern, still they do not present a",
    "final picture of the concern. The analysis is based on annual reports of the company’s five",
    "financial year. Because of the flexibility of accounting principles, certain liabilities are not",
    "provided for that and to that ext ent the data taken will give a misleading picture. Sometimes it",
    "may fail to disclose the present value as figures given in the Balance sheet are on a historical",
    "basis.",
    "While  preparing  it, the replacement  cost  of the asset  is totally  ignored.  Also  financial  statement",
    "does  not  disclose  information  relating  to changes  in the management,  loss  of markets  etc.  which",
    "have a vital bearing on the earnings of the company. The financial statements as such are not",
    "sufficient for decision making. They can be made useful  for managerial decision only after",
    "analysing  the data by  using  different tools and techniques.",
    "4  1.3 RELEVANCE  & SCOPE  OF  THE  STUDY",
    "The study covers almost the entire area of financial operations covered by “Reliance Retail",
    "Limited” the study has been conducted with the help of data obtained from audited financial",
    "records.  The  audited  financial  records  are the company  annual  reports  pertaining  to past  5 years",
    "from  2015 -2016  to 2019 -2020  and  the audited  financial  records  are obtained  from  the",
    "company’s  annual report.",
    "The financial statements become meaningless unless they are analysed and interpreted. This",
    "study focuses on proper analysis and interpretation of the results, so that it become valuable",
    "and  useful  for taking  manage rial  decisions.  The  researcher  tries  to measure  the performance  of",
    "the organization with the  help of ratios  and trend analysis.",
    "This research study is conducted in a way that it provides proper interpretation on the basis of",
    "analysis done on the financial statements. Proper interpretation leads to proper conclusion and",
    "judgement and there by taking effective decisions.  The study may provide assistance to",
    "investors (current and potential), creditors and management to evaluate t he past, current and",
    "project  conditions regarding  performance  of the Reliance  Retail  Limited.",
    "1.4 OBJECTIVES  OF  THE STUDY",
    "The  objectives of the  study  include: -",
    " To evaluate  the financial  performance  of Reliance  Retail  Ltd  in terms  of solvency,",
    "profitability,  turnover ratios  for the years  from 2015 -2016 to  2019 -2020.",
    " To identify  any  consistent results or trends by  using  trend  analysis.",
    " To analyze  the financial  changes  over  a period  of five  years.",
    " To estimate  the trend in sales  & profit of  the firm.",
    " To suggest  effective  measures  in the existing  system  of the company.",
    "5",
    "CHAPTER II",
    "INDUSTRY  PROFILE",
    "6  2.1 BUSINESS  PROCESS  OF  THE  INDUSTRY",
    "2.1.1  Indian  Retail  Industry",
    "India ranks among the best countries to invest in Retail space. Factors that make India so",
    "attractive include the second largest population in the world, a middle class of 600 million",
    "people, increasing urbanisation, rising household incomes, connected rural consumers and",
    "increasing  consumer spending.",
    " India  ranked  No.  2 in Global  Retail  Development  Index (GRDI)  in 2019. ",
    " Retail is India's largest industry, currently accounting for over 10% of the country's",
    "GDP  and 8%  of total employment. ",
    "Recent policy changes allow 100% FDI under the automatic route for single -brand retail",
    "trading.",
    "Indian  retail  industry  has  emerged  as one  of the most  dynamic  and  fast -paced  industries  due  to",
    "the entry of several new players. It accounts for over 10% of the country’s gross domestic",
    "product (GDP) and around 8% of the employment. India is the world’s fifth -largest global",
    "destination  in the  retail space.",
    "India  is expected  to become  the world’s  fastest  growing  E-commerce  market,  driven  by robust",
    "investment in the sector and rapid increase in the number of internet users. Various agencies",
    "have  high expectations about growth  of India’s  E-commerce  market.",
    "Indian retailing is a rapidly growing industry,  amounting to nearly 10% of the overall GDP. It",
    "has  a potential  market  of nearly  a trillion  dollars.  The  point  really  is on the share  of unorganized",
    "sector in Indian retailing, nearly 90% of the market. Nevertheless, the trend is shifting more",
    "towards the ‘Organized Retail’ and ‘E -commerce’. The modern retailing is expected to grow",
    "at a CAGR of 20% and the traditional retailing at 10% per annum in the coming years. The e -",
    "commerce  is set to grow  at an even  faster  rate.  Therefore,  the potential  for players  like  Reliance",
    "Retail,  which  spreads  its wings  through  most  of the consumer  space,  is huge.  Furthermore,  with",
    "the organized sector expanding into rural areas, the opportunities are huge. With the changing",
    "aspirations and preferences, consumers ar e moving towards the modern retail shops, in turn",
    "prioritizing  quality.",
    "7  2.1.2  Evolution  of Retail  in India",
    "2.1.3  Retail  formats  in India",
    "8  Figure  2.1:  Indian  retail  snapshot",
    "The  retail  sector  in India  has  seen  organised  players  grabbing  a larger  pie.  Favourable  structural",
    "macro trends —improving consumer sentiment, rising disposable incomes, urbanisation and",
    "lower penetration of organised retail —are likely to fuel this boom. Moreover, the recent",
    "pathbreaking reforms —demonetisation and GST —have catalysed development of organised",
    "retail. Besides, after an unsettling period of cut -throat competition, offline and online players",
    "seem  to have  come  to terms  with  reality  and  are toying  with  the omni -chann el platform  in their",
    "quest  for success.",
    "Given  the potential  in organised  retail,  we are seeing  wars  intensify  between  organised  players",
    "– offline as well as online. In grocery retail, players such as Reliance Retail, Future Retail,",
    "Avenue Supermarts, Big B asket, Flipkart and Amazon are fighting tooth and nail to gain",
    "customer mindshare. Likewise, in apparel retailing, players such as Reliance Retail, Future",
    "Lifestyle, ABFRL, Arvind,  Trent, V -Mart  and foreign  players are  vying  for top spots.",
    "2.1.4  Reliance  Retail - Operating  Model",
    "Reliance Retail is India’s largest and most successful retailer. In just 14 years of launch,",
    "Reliance Retail has accomplished a feat which no other retailer has achieved. Reliance Retail",
    "touches every aspect of its consumers’ life from morning to evening, food to fashion, items of",
    "necessities to luxuries of life, cities to towns, online to offline and much more, enabling the",
    "ease of living for every Indian. Reliance Retail is not only India’s foremost retailer, but it has",
    "emerged as  the fastest growing retailer in the world and features among the top 100 retailers",
    "globally.",
    "Reliance  Retail  has  adopted  multi -channel  strategy  and  has  integrated  “offline -online”  models",
    "to truly differentiate the customer experience. Reliance Retail also became the first organised",
    "retail  chain in  India to support UPI -based payments.",
    "9  Reliance  Retail  has  established its  business  across five  key  consumption baskets  of:",
    " Consumer  Electronics,",
    " Fashion  & Lifestyle,",
    " Grocery,",
    " Petro  Retail  and",
    " Connectivity  with deep business moats.",
    "The dimensions of the business span across 11,784 physical retail stores across 7,000+ towns",
    "and cities, direct to consumer, Digital commerce chann els and B2B channels serving millions",
    "of Indian consumers across underserved markets. The adjacent table sets out the spread of",
    "Reliance  Retail’s business.",
    "Fig  2.2:  spread  of Reliance  Retail’s  business.",
    "Retail - Reliance Retail continues to grow in scale, driven by new store expansion across the",
    "geography, improving store throughput and favourable product mix. Operating leverage is",
    "resulting  in release  of strong  operating  cash  flows  to continue  making  requisite  investments  for",
    "securing future readiness and delivering profitable growth. The business continues to improve",
    "customer experience across all store concepts and focuses on providing unmatched value",
    "proposition,  which  has  resulted  in robust  growth  in footfalls  and  operating  metrics.  Roll -out  of",
    "the Digital Commerce initiative will open up further growth opportunities for the organised",
    "retail business, leveraging the best of our consumer and digital platforms. Reliance Retail and",
    "WhatsApp  have  entere d into  a commercial  partnership  agreement  to further  accelerate  Reliance",
    "Retail’s Digital Commerce business on the JioMart platform using WhatsApp and to support",
    "small  businesses  on WhatsApp.  Reliance  Retail  has  the largest  customer  franchise  for over  125",
    "million  registered  customers who  cherish  all its unique  store  concepts.",
    "Organised  Retail  revenues  grew  by 24.8%  y-o-y to `  1,62,936  crore.  Segment  EBITDA  for FY",
    "2019 -20 grew  by 55.7%  y-o-y to ` 9,654  crore.  EBITDA  margins  improved  130  bps  to 6.6%",
    "10  boosting  operating  profitability.  Reliance  Retail  further  consolidated  its leadership  position  and",
    "is India’s  largest,  most profitable and  fastest growing  retailer.",
    "Reliance Retail’s operating model is based on customer centricity, whil e leveraging common",
    "centers of excellence in technology, business processes and supply chain. In an endeavor to",
    "serve  customers  across  geographies,  segments  and  consumption  occasions,  Reliance  Retail  has",
    "built and refined multiple store concepts with a focus to serve diverse needs of its customers.",
    "Reliance Retail has consistently endeavoured to provide best store experience, unmatched",
    "value  proposition  and  seamless  anytime,  anywhere  shopping  experience,  through  omni -",
    "channel initiatives. This strategy has resulted in strong operating performance, broad -based",
    "growth  and leadership across consumption baskets.",
    "Fig  2.3:  Reliance  Retail  Operating  Model",
    " Buying:  Vendor  Ecosystem  Comprehensive  network  of vendors  from  farmers  to large",
    "enterprises",
    "11   Channel  Ecosystem:  Comprehensive  network  of vendors  from  farmers  to large",
    "enterprises",
    " Moving:  Efficient  and  seamless  supply:",
    "• Direct  delivery  to stores  from  chain  network,  fleet  of vehicles  and  logistic partners",
    "• Direct  delivery  to stores  from  suppliers  in select  cases",
    " Selling:  Providing anytime, anywhere, shopping experience through stores, e -com,",
    "connected kiosks and catalogue sales; after sales service through resQ and dedicated",
    "customer  care",
    " Data Analytics:  Serving individuals, kiranas, hotels, restaurants, caterers and B2B",
    "customers; engagement through loyalty programme, enriching shopping experience",
    "through  consumer insights",
    " Design & Develop Solutions:  Combination of inhouse and external desi gn support for",
    "product  development",
    "In the current retail landscape where competition is intensifying unabated, Reliance Retail is",
    "honing  its unique  plan  of connecting  “Online  and  offline  through “O2O  model.",
    "Fig  2.4: current  distribution  model",
    "12  In the current  model: -",
    " Customer  places  an order  through  one  of the online  marketplace  platforms.",
    " In case  of an online  order,  the marketplace  runs  cost  of procurement  from  OEM,  storage  cost",
    "at warehouse, packaging  and assortment cost  and logistics cost.",
    " The  cost of delivery  to customer  constitutes 10 –15%  of revenue.",
    " For marketplaces, which anyway make slim margins – partially owing to nature of the",
    "business and partially due to heavy discounting – such costs take a toll on their overa ll",
    "profitability.",
    " Considering increasing usage of smartphones and deepening internet penetration, it is a",
    "foregone conclusion that usage of the online platform as the shopping platform is likely to",
    "increase hereon. This, in turn, implies achieving profitab ility for existing online marketplaces",
    "will  not be easy.",
    " That said, it may change if irrational discounting ebbs or marketplaces start focusing on",
    "private  labels  (and  attain  huge  success)  or the underlying  business  model  undergoes  a change.",
    "Envisaged distribution model under Reliance Retail Most offline retailers are talking about",
    "omni -channel. Some have launched their own version of omni -channel. But omni -channel or",
    "the O2O model being rolled out by Reliance Retail is something that we belie ve will be a big",
    "disruptor.  How?  Here’s the  lowdown.",
    "Fig  2.5:  Reliance  Retail  O2O  model",
    "13  In the model  that  Reliance  Retail  plans to  adopt…",
    " Reliance  Retail  will  create  its own  ecosystem  of carrying  out the  business.  To illustrate,  here",
    "explain  how its grocery  retail ecosystem might work.",
    " Prior to the rollout, Reliance Retail will onboard millions of mom -and -pop (kirana) stores",
    "onto its platform. Currently 85 –88% of its overall FMCG business is being handled by this",
    "neighbourhood  kirana  stores.  For  its grocery  business,  Reliance  Retail  will  essentially  leverage",
    "this  network  of existing  stores.",
    " Such  kirana  stores  may  be called  “Affiliated  Stores”.  Such  stores  will  have  a JIO  pointof -sale",
    "(POS) terminal, which will maintain everything – ord er procurement, order delivery status,",
    "inventory management, receivables, payables, etc. In other words, realtime information about",
    "the statistics per store  will be available.",
    " This platform will mean Reliance will have the strongest offline presence in India and that",
    "too  with limited capital employed.",
    " In this backdrop, when a customer places an order through online/app platform, depending",
    "on the type, size and urgency of order, the same will be routed to either Reliance affiliated",
    "kirana  stores or its warehouse",
    "2.1.5  Business  process - Strategies  adopted by  retail  industries",
    " Strong  distribution  and  logistic  network:",
    "It is imperative for a retailer to have a strong distribution and logi stic network to succeed in",
    "this sector. Players follow a distribution network that suits them the best. For example,",
    "Shoppers Stop follows a “hub and spoke” model for its distribution network to increase",
    "efficiency and productivity. In November 2020, Mahin dra Logistics Ltd. developed a ‘Built -",
    "to-Suit’  warehousing  capacity  in Tamil  Nadu.  This  workspace  will  cater  to two  key  customers",
    "in e-commerce  and  auto -engineering  industries..",
    " Expansion :",
    " In March  2021,  Realme announced to  expand  retail  footprint  in India with  flagship  stores;",
    "it is planning  to launch its first  flagship store  (over a  10,000 sq. ft.  area) in Gujarat.",
    " On March  25, 2021,  Xiaomi  introduced  a new  initiative  ‘Develop  with  Mi’  (GWM).  GWM",
    "plans  to have  30,000  touchpoints  in a year and 6,000+  retail  stores  in the next  two years.",
    " In March  2021,  ASICS  expanded  its retail  concept  in India  with  a new  store  in Bengaluru.",
    "14   In March  2021,  Vivo  announced  plan  to open  ~100  exclusive  retail  stores  across  India  in",
    "2021;  aims to cross  the 650 -store  mark in  India by  2021.",
    " In February  2019,  Future  Consumer  partnered  with  T Choithram  & Sons  to start  offering",
    "products  in the Middle East.",
    " Huawei  signed a  partnership  with  Micromax  to expand  its retail  presence  in India.",
    " The dimensions of the business span across 12,711 physical retail stores (1,456 stores",
    "opened during the  year)  across 7,000+ towns  and cities, direct to consumer, Digital",
    "commerce  channels  and  B2B  channels  serving  millions  of Indian  consumers  across",
    "unders erved  markets.",
    " Omni -channel  retailing:",
    "Retailers are exploring multiple channels to maximise sales. Omni -channel retailing is",
    "being adopted by many retailers in India. Shoppers Stop is making efforts to be an omni -",
    "channel  retailer.  Ezone  has  launched  an online  platform,  which  has  led to increase  in sales.",
    "Omni -channel retailing is being adopted by companies like Reliance Retail Ventures,",
    "Aditya Birla  Fashion and  Retail  Limited and, OnePlus.",
    " Lowering  prices:",
    "Certain retailers adopt ‘first price right’ approach. Retailers do not offer discounts under",
    "this strategy, they directly compete on the selling price by offering best price without any",
    "markdowns.",
    " Offering  discounts:",
    "Most retailers have advanced off -season  sales from 15 days to a month with discounts of",
    "20-70 per cent on certain products. Also, higher discounts and other value -added services",
    "are offered to members.",
    " Offering  value  added  services:",
    "Companies offer innovative value -added services like customer loyalty programmes and",
    "happy hours on shopping deals. Offers for senior citizens, contests for students and lottery",
    "gains  are now very  common.",
    " Leveraging  partnership:",
    "To keep customers on shop floors for a longer time and increase conversions, retailers ar e",
    "now pitching to partner with manufacturers, service providers, and financial companies to",
    "create  a buzz  around  certain product categories.",
    "In March 2021, Unicorn, a premium Apple reseller, announced plan to launch 4 -6 new",
    "flagship  stores in  India by  FY22.",
    "15  In February  2021,  Reckitt  Benckiser,  a consumer  health  and  hygiene  company,  in",
    "partnership  with  Grofers,  an online  grocery  retailers,  launched  the ‘Deliver  Safe",
    "Programme’.  The  programme  includes  processes  and  protocols  to meet  the highest",
    "standards  of cleaning  and  disinfection.",
    "In February 2021, Panasonic India joined forces with Fortune Marketing Pvt. Ltd. to",
    "expand its presence in the Indian market. Fortune Marketing Pvt. Ltd. will be responsible",
    "for distributing  Panasonic’s  wide  enterprise  range,  comprising  commercial  android  signage",
    "display,  4K UHD  commercial  high  brightness  displays,  multi -touch  interactive",
    "professional  displays and  professional  video wall range  of products.",
    " Strong  supply  chain:",
    "Critical components of supply ch ain planning applications help retailers to maintain profit",
    "margins. Innovative solutions like performance management, frequent sales operation",
    "management,  demand  planning,  inventory  planning,  production  planning  and  lean  systems",
    "can  help retailers to  get advantage  over  competitors.",
    "In March 2021, Mi India launched a Rs. 100 -crore (US$ 13.62 million) support plan over",
    "the next two  years  for its retail partners.",
    " Joint  Venture  (JV):",
    "To diversify the product offerings and tab the growing luxury retail segm ent, retailers are",
    "forming JV with foreign luxury brands. Reliance Brands Ltd entered a JV with Bally, a",
    "Swiss  luxury  brand, to exclusively  market its products  in India.",
    "In May 2019, Warburg Pincus and Runwal Group entered into a JV to form US$ 1 billion",
    "retail  mall platform.",
    " Changing  the perception:",
    "Retailers are providing more assortments for private level brands to compete with other",
    "supplier  brands.  New  product  development,  aggressive  retail  mix  and  everyday  low  pricing",
    "strategy  might help to  get edge  over supplier brands.",
    " Hyper  personalisation:",
    "Indian  retailers  use  hyper -personalisation  models  based  on behavioral  data,  brands",
    "performance,  demographic  preference  and  pin  codes as  marketing  strategy  to boosts sales.",
    " Cash -on-delivery:",
    " Online retail segment offers cash -on-delivery and manufacturers’ warranty to boost E -",
    "retailing  in consumer  durables  sector. ",
    " Cash -on-delivery is the preferred payment option with over 30 per cent buyers opting for",
    "it in India. ",
    "16  Reliance  Retail  is eying  the huge  potential  in consumer -focused  retail  businesses  in India.  This",
    "is an opportune time for the company to realise its retail ambition considering the evolving",
    "retail landscape (especially post change in e -commerce regulation effected f rom February",
    "2019), particularly since the cash -burning JIO business has become stable. Reliance Retail is",
    "playing its retail cards and its unique omnichannel strategy (offline to online model) likely to",
    "be rolled out by December. India’s retail sector off ers an immense opportunity (~USD650bn",
    "market size with just 10% organised share) and that organised players have so far barely",
    "scratched the surface. In this backdrop, the entry of deep -pocketed Reliance Retail may well",
    "stiffen  competition and compress mar gins across the  board.",
    "Reliance Retail is India’s largest retailer in terms of reach, scale and revenues. Deep insight",
    "into India’s economic, cultural and consumption diversity drives Reliance Retail’s vision in",
    "the retail  universe.  Reliance  Retail  business  is being  led by the following  four  strategic  pillars:",
    "Fig  2.6:  Business  process  of Reliance  Retail  Limited",
    " Customer  Centricity : Reliance  Retail  endeavours  to offer  rich  customer  shopping",
    "experience through wide product assortment, convenient shopping layout, trained store",
    "staff and hassle free checkouts. Keeping customers at the centre, Reliance Retail has",
    "embraced  customer service  as a way  of life  in everything  it does to operate its busi ness.",
    " Own  Brand  Strategy : Reliance  Retail  continues  to extend  its portfolio  of own  brands  across",
    "all consumption baskets. Reliance Retail offers superior quality through these brands",
    "through  an active  engagement  with  manufacturers  at every  stage  starting  from  design  and",
    "17  quality testing to final product rollout. Many of these own brands have grown in size and",
    "scale  to compete  with national and international brands.",
    " Innovation:  Reliance Retail has been swift in embracing latest technology across its stores",
    "and supporting infrastructure. Reliance Retail has built nimble yet scalable operations to",
    "enhance  customer  experience  in the evolving  digital  era.  Reliance  Retail  is gradually  rolling",
    "out  its innovative  omni -commerce  initiatives  with  multichannel  sales  approach  that",
    "provides  its customers with an integrated  shopping experience.",
    " Productivity  and  Efficiency:  Reliance  Retail  operates  on a highly  process  based  approach",
    "so that  the customers  gets  seamless  experience every time  they shop.  Its highly trained",
    "people and robust processes ensure consistent execution resulting in superior productivity.",
    "Reliance Retail has been one of the key catalysts in the growth of modern retail in India. With",
    "its pan India presence, Reliance Retail has attaine d a leadership position in the industry that is",
    "capable  of delivering  unmatched  customer experience  at a scale comparable  to none.  Reliance",
    "Retail  has  once  again  delivered  strong  revenues  and  profits  for the  year. The  performance is  a",
    "reflection  of strong business  fundamentals  and  focused  execution  by a  highly trained  and",
    "capable  team.  Reliance  Retail  continues  to deliver  its promise  of trust  to all its customers,",
    "suppliers  and  employees.",
    "2.2 MARKET  DEMAND  & SUPPLY  – CONTRIBUTION  TO  GDP  – REVENUE",
    "GENERATION",
    "2.2.1  Global  Economy Overview",
    "The  global  economy  grew  at 2.4%  in CY  2019,  slowing  from  3%  in CY  2018  amid  global  trade",
    "war, tariff related uncertainties, and Brexit. Chinese growth moderated but held up at 6.1%",
    "despite escalation of trade tensions with the United States (US). Amidst trade tensions and",
    "Brexit related uncertainty, EU growth also weakened to 1.1%. However, with talks of trade",
    "resolution  in second  half  of 2019,  Europe  started  to see  some  recovery  in growth.  Brexit,  which",
    "was  a key  uncertainty  for Europe  over  the last  two  years,  also  saw  resolution  towards  end  2019.",
    "The  US economy  remained relatively  strong  growing  at 2.3%.",
    "Global trade environment remained challenging due to heightened trade tensions. However,",
    "negotiations between the US and China since mid -October resulted in Phase One agreement.",
    "Partial roll -back of some US tariffs in exchange for Chinese commitments to ma ke additional",
    "purchases  of US products mark a  deescalation of trade  tensions.",
    "18  The  21-day  India  lockdown  (effective  25-Mar -2020  onwards)  courtesy  the COVID -19",
    "outbreak will impact RRVL’s operations too (especially ex -grocery segments). F& L revenue",
    "takes a haircut of 5% each in FY21/22. The COVID -19 Impact is expected to fasten the",
    "inventory liquidation process by the value  fashion tail (already dealing with burgeoning",
    "working  capital) once  the lock -down is lifted.",
    "Global  growth  outlook  has  changed  since  the outbreak  of COVID -19.  There  has  been",
    "coordinated global  monetary  policy  easing  and  fiscal support  from governments.  These  policy",
    "support  measures  would  act as cushions  offsetting  weakness  in growth  to some  extent.",
    "However,  global  economic  activity  is likely  to contract  in 2020  and  global  growth  environment",
    "will  remain challenging  in the short term.",
    "2.2.2  Indian  Economy Overview",
    "The Indian economy grew by 4.2% in FY 2019 -20 still remaining one of the fastest growing",
    "major  economies  in the world.  Industrial  activity  remained  healthy  in the beginning  of the year,",
    "but saw some weakness later. Auto sales suffered due to weak credit conditions, demand",
    "softness, and change in regulatory norms. However, services credit averaged at a healthy 10 %",
    "y-o-y growth  even  as credit  growth  deteriorated.  Despite  weak  trade  environment  amid",
    "increasing protectionism, services exports remained resilient at about 8%. On the rural side,",
    "with food prices firming up, demand saw some recovery with three -wheeler sa les returning to",
    "positive  growth in  December  quarter  (+8%  y-o-y), but reversed  the recovery  in 4Q.",
    "With continued policy initiatives, India further continued its climb in the Ease of Doing",
    "Business  rankings,  climbing  up 14 places  to reach  the 63rd  rank.  India  is the only  major  country",
    "to have moved up by 67 places in just 4 years. FY 2019 -20 also saw corporate tax cut being",
    "announced, further easing business environment. Government also  announced significant",
    "rebates for new manufacturing units to attract global supply chains. Outbreak of COVID -19",
    "would  make  growth  environment  challenging  in first  half  of FY  2020 -21 but  liquidity  measures",
    "announced  by the government should help provide  support.",
    "2.2.3  Retail  Market  Overview: -",
    "Indian retail  is one  of the fastest  growing  markets  in the world  due  to economic  growth.",
    " Retail  market  in India  is projected  to grow  from  an estimated  US$  672  billion  in 2017  to",
    "US$  1,200 billion in 2021F.",
    "19   Retail  industry  reached  to US$  950  billion  in 2018  and  is expected  to reach  US$  1.1 trillion",
    "by 2020.",
    " Total  consumption  expenditure  is expected  to reach  nearly  US$  3,600  billion  by 2020  from",
    "US$  1,824 billion in 2017.",
    " India  is the world’s  fifth  largest  global  destination  in the retail  space  and  ranked  63 in World",
    "Bank’s Doing  Business 2019.",
    " According  to a report  from  Cushman  & Wakefield,  Delhi's  upscale  Khan  Market  has",
    "become  the world's 20th  most expensive retail location.",
    " Rising  income  and demand  for quality  products will  boost consumer expenditure.",
    "Fig  2.7:  Consumer  expenditure  in India",
    "India’s retail market is estimated at US$822 billion in FY 2019 -20 and is expected to grow at",
    "a CAGR of 10% over next 5 years to reach US$1,315 billion by FY 2024 -25. The penetration",
    "of organised retail market is estimated at 11% in FY 2018 -19 and is expected to grow to 17%",
    "by FY  2024 -25E.  The  organised  retail  market  is estimated  at US$89  billion  in FY  2018 -19 and",
    "is expected  to grow  at a CAGR  of 21%  over  next  5 years  to reach  US$230  billion  by FY  2024 -",
    "25E.",
    "India continues to be one of the fastest growing major economies globally with GDP growth",
    "rate  of 7.1%  in FY  2016 -17. Government  continues  to lay focus  on structural  reforms,",
    "infrastructure development, agricultural and rural development, removal of labour regulations",
    "and  improve  ease  of doing  business.",
    "20  Fig  2.8:  Retail  market  in India",
    "The year 2016 -17, marked several momentous economic policy decisions. The passage of the",
    "constitutional amendment for implementation of the Goods and Services Tax (GST), and the",
    "demonetisation of highest denomination notes were the two key measures taken d uring the",
    "year.  GST  is anticipated  to have  positive  impact  on almost  all aspects  of business  operations  in",
    "the country. The reform is expected to benefit GDP growth rate as well as simplify taxation",
    "structure  in the  country  among  other  benefits.",
    "With income levels improving, Indian Retail landscape has witnessed numerous changes over",
    "the last decade – consumer demand is shifting, shopping preferences are evolving and high",
    "degree of technology adoption is taking place which are pushing up the India n Retail sector",
    "into a new growth orbit. By 2020, Indian retail market is projected to reach US$1.3 trillion",
    "from  US$672 billion in 2016 growing  at a CAGR  of 17%.",
    "Organised retail is estimated at US$ 60 billion (~9% of the total retail market) as of 2016 a nd",
    "is projected to reach US$180 billion (contributing 14% of the total retail market) by 2020",
    "growing at a CAGR of 25%. In contrast to retailers in advanced economies who are facing",
    "growth  challenges  with  saturated  home  markets  and  tough  macro -economic  con ditions, Indian",
    "retail scenario remains positive with retailers registering healthy growth across categories and",
    "formats. Sustained economic growth, rising income levels, growing aspirations, increased",
    "awareness  and technology  adaptation continues to  drive  consumption in  India.",
    "2.2.4  Contribution  to GDP",
    "The  retail  sector  in India  is emerging  as one  of the largest  sectors  in the economy.  It contributes",
    "10 per cent to GDP and 8 per cent to employment. India continues to be one of the fastest",
    "growing  major economies  globally  with  GDP  growth rate over the  years.",
    "21  Fig  2.9:  Income  growth  to drive  demand  for  Retail  Industry",
    " Multiple  drivers  are leading  to strong  growth  in Indian  retail  through  a consumption  boom.",
    " Significant growth in discretionary income and changing lifestyles are among the major",
    "growth  drivers of  Indian  retail.",
    " Easy availability of credit and use of ‘plastic money’ have contributed to a strong and",
    "growing  consumer  culture  in India.",
    " Acceptance an d usage of E -retailers by consumers are increasing due to convenience and",
    "secured  financial transactions.",
    " Expansion in the size of the upper middle class and advertisement has led to greater",
    "spending  on luxury  products  and high brand consciousness.",
    " In FY20 , GDP at current prices was US$ 2,891.87 billion and GDP per capita at current",
    "prices  was  US$ 2,156.50.",
    " India’s real gross domestic product (GDP) at current prices stood at Rs. 195.86 lakh crore",
    "(US$ 2.71 trillion) in FY21, as per the second advance estima tes (SAE) for 2020 -21. And,",
    "the per capita income at current prices was estimated at Rs. 127,768 (US$ 1,765.43) in",
    "FY21.",
    "The total market size of Indian retail industry stood at US$ 950 billion in 2018 and is forecast",
    "to reach  US$  1,200  billion  by 2021  and  US$  1,750  billion  by 2026.  As per  Forrester  Research,",
    "in 2020, India's retail sector was estimated at US$ 883 billion, with grocery retail accounting",
    "for US$ 608 billion. The  market is projected to  reach ~US$ 1.3 trillion by  2024.",
    "22  Fig 2.10:  Market size  over  the past  years",
    "India will become a favourable market for fashion retailers on the back of a large young adult",
    "consumer base, increasing disposable income and relaxed FDI norms. Revenue of India’s",
    "offline retailers, also known as brick and mortar (B&M) retailers, was expected to increase by",
    "Rs 10,000 -12,000 crore  (US$ 1.39 -2.77 billion)^ in FY20.",
    "According to the Ground Zero Series findings of the consulting firm RedSeer, the retail sector",
    "is expect ed to recover ~80% of pre -Covid revenue (amounting to US$ 780 billion) by end -",
    "2020.",
    "Business activity among micro -retailers is reaching near normal levels, as they are adopting",
    "digital business tools to drive efficiency and growth. The micro -retail player s are increasingly",
    "taking up digital book -keeping solutions, as it makes this task simpler and there is a demand",
    "coming from small towns and hinterlands. Experiential retail draws the concentration to a",
    "customer driven approach where the client can interac t with products or brands rather than",
    "being a  passive  participant.",
    "Many fintech companies are competing for their presence in local stores. In May 2020, Paytm",
    "announced a US$ 1 billion loyalty programme and launched online ledger services for kirana",
    "stores  in India. Other fintech companies such as PayNearby, Phonepe, BharatPe and Mswipe",
    "introduced different services for small shop owners, enabling better digital payments and",
    "delivery options at these stores. For example, Amazon partnered with local stores t o provide a",
    "platform  for many  small  shops  and  merchants  on its Amazon  marketplace.  While,  Walmart  has",
    "its own network of 28 ‘best -priced’ stores serving local stores across the country. In March",
    "2021,  Big  Bazaar  announced  expansion  into  the instant  home  delivery  service,  aiming  to offer",
    "23",
    "2-hour delivery guarantee service; it has started the service in Delhi NCR, Mumbai and",
    "Bengaluru.",
    "Fig  2.11:  Significant  scope  for  expansion",
    "In FY19, traditional retail, organised retail and E -commerce segments accounted for 88 per",
    "cent,  9 per  cent  and  3 per  cent  of the market,  respectively.  The  organised  retail  market  in India",
    "is growing  at a CAGR  of 20-25 per  cent  per  year.  It is projected  that  by FY21,  traditional  retail",
    "will hold 75 per cent of the total retail market, followed by organised retail at 18 per cent and",
    "Ecommerce retail at 7 per cent.  The unorganised retail sector in India has a huge untapped",
    "potential for adopting digital mod e of payments as 63 per cent of the retailers are interested in",
    "using  digital payments like mobile  and card payments",
    "Fig  2.12:  Rising  prominence  of online  retail",
    "Online  retail  market  is estimated  to reach  US$  60 billion  by 2020  from  US$  32 billion  in",
    "2018.  It is projected to reach US$ 73.00 billion  by 2022F.",
    "During  the online  festive  sale  in October  2020,  the Indian  e-commerce  firms —Flipkart,",
    "Amazon,  Myntra  and  Snapdeal —together  sold  goods  worth  US$  3.1  billion.  During  the festive",
    "24",
    "sale period of September 29 -October 4, 2019, Indian E -tailers achieved US$ 3 billion of gross",
    "merchandise  value (GMV).",
    "Online  retail  rose  to a record  high  during  the festive  season  in October -November  2020,  with",
    "smartphone  sales contributing  53%  to the  total sales.",
    "The  Government  plans  to allow  100  per  cent  FDI  in E-commerce  under  the arrangement  that",
    "the products  sold  must be  manufactured  in India to  gain  from the  liberalised  regime.",
    "India  ranked  73 in the United  Nations  Conference  on Trade  and  Development's  Business -to-",
    "Consumer  (B2C) E -commerce  Index  2019.",
    "Online  retailers  now  deliver  to 15,000 -20,000  pin  codes  out  of nearly  100,000  pin  codes  in",
    "the country.",
    "In 2020,  the most  common  payment  methods  online  were  digital  wallets  (40%),  followed  by",
    "credit cards (15%) and debit cards (15%). Online penetration of retail is expected to reach",
    "10.7%  by 2024 versus 4.7%  in 2019.",
    "In April  2020,  Amazon  India  announced  to invest  Rs.10  crore  (US$  1.3 billion)  to strengthen",
    "its pilot ‘Local Shop on Amazon’ programme, which added >5,000 local shops and retailers",
    "on the platform from >100 cities.",
    "By 2024, India's e -commerce industry is expected to increase by 84% to US$ 111 billion,",
    "driven by mobile shopping, which is projecte d to grow at 21% annually over the next four",
    "years.",
    "2.2.5  Revenue  Generation",
    "Revenue generated  from  online  retail is  projected  to grow  to reach  US$ 60  billion  by 2020.",
    "Fig 2.13:  Revenue  from  online  retail  in India",
    "25  2016 was a challenging year for many e -commerce players who witnessed course correction",
    "both in terms of the market approach and valuations. With lower funding, falling valuations",
    "and  pressure from  investors,  the e -commerce space is  now seen  shifting its  focus  from",
    "achieving  higher  Gross  Merchandise  Value  (GMV)  to achieving  profitability  and",
    "sustainability.",
    "Fig  2.14:  Reliance  Retail  – Revenue  and  EBITDA  evolution  over  past  decade",
    "Business  Overview: -",
    "Reliance Retail has been one of the key catalysts in the growth of modern retail in India. With",
    "its pan India presence, Reliance Retail has attained a leadership position in the industry that is",
    "capable of delivering unmatched customer experience at a scale comparable to none. Reliance",
    "Retail has once again delivered strong revenues and profits for the year. The performance is a",
    "reflection of strong business fundamentals and focused execution by a highly trained and",
    "capable team. Reliance Retail continues to deliver its promise of trust to all its customers,",
    "suppliers  and employees.",
    "Reliance Retail is India’s largest and most successful retailer. In just 14 years of launch,",
    "Reliance Retail has accomplished a feat which no other retailer has achieved. Reliance Retail",
    "touches every aspect of its consumers’ life from morning to evening, food to fashion, items of",
    "necessities to luxuries of life, cities to towns, online to offline and much more, enabling the",
    "ease of living for every Indian. Reliance Retail is not only India’s foremost retailer, but it has",
    "emerged as  the fastest growing retailer in the world and features among the top 100 retailers",
    "globally .",
    "Reliance  Retail  has  adopted  multi -channel  strategy  and  has  integrated  “offline -online”  models",
    "to truly  differentiate  the customer  experience.  Reliance  Retail  also  became  the first  organised",
    "26  retail  chain  in India  to support  UPI -based  payments.  Reliance  Retail  has  established  its business",
    "across five key consumption baskets of: a) Consumer Electronics, b) Fashion & Lifestyle, c)",
    "Grocery, d) Petro Retail and e) Connectivity with deep business moats. The dimensions of the",
    "business span across 12,711 physical retail stores across 7,000+ towns and cities, direct to",
    "consumer,  Digital  commerce  channels  and  B2B  channels  serving  millions  of Indian  consumers",
    "across  underserved  markets.  The  adjacent  table  sets  out  the spread  of Reliance  Retail’s",
    "business.",
    "Reliance  Retail  is catalysing  development  of organised  retail  in the country.  It touches  millions",
    "of lives  every  day  with  an unparalleled  reach,  size  and  scale.  Reliance  Retail’s  commitment  to",
    "deliver inclusive growth is reflected in its core strategy to integrate with a large number of",
    "farmers, small manufacturers and retailers and connect them with millions of consumers.",
    "Reliance  Retail  has invested  enormous  efforts  in the past  10 years  in building  an infrastructure",
    "that is cutting edge, scalable and world class. Over the years, Reliance Retail has transformed",
    "shopping experience for discerning Indian consumers and commands leadership across key",
    "consumption  baskets.",
    "Fig  2.15:  Presence  across  consumption  baskets",
    "Reliance Retail is the retail initiative of Reliance Industries and an epicentre of its consumer",
    "facing businesses. It has adopted a multi -retail concept strategy and operates a wide array of",
    "store  concepts  which  caters  to diverse  needs  of the customers  across  core  consumption  baskets",
    "of Grocery,  Consumer  Electronics,  Connectivity,  Fashion  & Lifestyle  and  Petro  Retail.",
    "27  Fig  2.16:  Contribution  from  consumption  baskets",
    "Business  performance:",
    "FY  2019 -20 has  been  a growth  year  for Reliance  Retail  with  all consumption  baskets",
    "consistently delivering  on business strategy. Current posi tioning of the business and the",
    "business  momentum is highlighted in the following  points:",
    "1. In the backdrop  of slowing  economy  and  tepid  consumer  sentiment  brought  out  by the onset",
    "of COVID 19, Reliance Retail delivered robust and competitive performance with steady",
    "margin  improvement.",
    "2. Business continues to grow in scale, driven by new store expansion across the geography,",
    "improving  store  throughput and favourable product mix.",
    "3. Operat ing  leverage  is resulting  in release  of strong  operating  cash flows  to continue  making",
    "requisite  investments  to secure  future readiness  and  delivering  profitable  growth  alongside.",
    "4. Business  continues  to improve  customer  experience  across  all store  concepts  and  focuses  on",
    "providing unmatched value proposition, which has resulted in robust growth in footfalls and",
    "operating  metrics.",
    "5. Reliance Retail is aiming to capture a sizable share of the large untapped consumption",
    "opportunity  in the  country  through physical  stores, digital platforms  and  B2B  channels.",
    "28  2.3 LEVEL  & TYPE  OF  COMPETITION  – FIRMS  OPERATING  IN THE  INDUSTRY",
    "The retail industry is comprised of the process where retailers sell their final products and",
    "services  to the end  consumers.  Indian  Retail  Industry  comprised  of two  levels  :- Organised  and",
    "Unorganised Sector. Most of the revenues come from organised sector. In the developed",
    "economies, organized retail is in the range of 75 -80 per cent of total retail, whereas in",
    "developing  econo mies, the  unorganized sector  dominates the  retail business.",
    "Organized retailing refers to trading activities undertaken by licensed retailers, that is, those",
    "who are registered for sales tax, income tax, etc. Organised retailing was absent in most rural",
    "and  small  towns  of India  in 2010.  Supermarkets  and  similar  organised  retail  accounted  for just",
    "4% of the market. Most Indian shopping happens in open markets or numerous small grocery",
    "and  retail  shops.  These  include  the corporate  backed  hypermarkets  and  retail  chains,",
    "departmental store, discount stores, drug stores, factory outlets, and also the privately owned",
    "large  retail businesses.",
    "The organized retail stores are characterized by professionally managed stores or large chain",
    "of stores, providing goods and services that appeal to customers, in an ambience that is",
    "encouraging for shopping and agreeable to customers. For example: Vishal Mega Mart, Big",
    "Bazaar, Wills Lifestyle, Shoppers Stop, Reliance Trends, Spencers, Reebok, Nike , Catmos,",
    "Lilliput, McDonald‟s, Pizza Hut, Barista, Cafe Coffee Day, Koutons, Cotton County, Peter",
    "England,  Titan,  Raymonds, Sony,  Samsung,  Next,  LG, Apollo  Pharmacy,  etc.",
    "2.3.1  Competitive  landscape  in Indian  retail  sector  – Firms  Operating  in the  Industry",
    "1. Departmental  stores",
    " Pantaloon  has  342 stores  in >155  towns",
    " Westside  operates  158  stores  across  82 cities",
    " Shoppers  Stop  has  90 stores  & Lifestyle  operates across  77 stores  in India",
    " Reliance  Retails  operates  670  fashion  concept  stores  across  350 cities  in India",
    "2. Hypermarkets",
    " Big  Bazar,  Spencer  Easy  day  and  Reliance  are some  major  players  present  in the",
    "market",
    " Aditya Birla  Retail  (More  Hypermarket)  - 20 stores",
    " Trend  has 10  stores under  retail chain  Star",
    " Big  Bazaar operates  295  stores  Spencer  Hyper  has 37  stores across  the country",
    "29  3. Supermarkets/  convenience  stores",
    " Aditya Birla  Retail - More  Supermarket (523  stores)",
    " Spencer’s Daily  (120  stores)",
    " Reliance  Fresh  (621  stores)",
    " REI  6Ten (350 stores)",
    " HyperCITY  (20  stores)",
    "4. Specialty  stores",
    " Titan  Industries  is a large  player,  with  496  World  of Titan,  262  Tanishq  and  509",
    "Titan  Eye+  shops",
    " Vijay  Sales,  Croma  and  E-Zone  in consumer electronics",
    " Landmark  and  Crossword  in books  and  gifts  segment.",
    "5. Cash  and carry  stores",
    " Metro  started  the cash  and  carry  model  in India  -operates  27 stores  across  Mumbai,",
    "Kolkata,  Delhi, Punjab,  Hyderabad and  Bengaluru",
    "  Reliance  Retail  operates  52 cash  and  carry  stores  called  ‘Reliance  Market’,  as of",
    "FY20",
    "2.3.3  Porter’s  Five  Force  Analysis  of Indian  Retail  Industry",
    "30  Competitive  Rivalry :",
    " Entry  of foreign  players in  the market  & e-retailers  have  intensified  competition",
    " Customers’  low  switching  cost  increases  competition",
    " The Indian retail sector is highly fragmented, which increases competition",
    "Threat  of New Entrants :",
    " Entry  as a retailer  is quite  simple.  However,  players  need  to establish  strong  distribution",
    "channels  & achieve  economies of scale to compete.",
    "Substitute  Products:",
    " Threat  of substitute products  is low.  However, customers may  purchase products  from",
    "a local store  instead of purchasing  from  a retailer.",
    "Bargaining  power  of Suppliers:",
    " Retailers  have  low  switching  costs,  which  make  the supplier  power  low.  Larger  retailers",
    "can  easily  switch to different suppliers.",
    "Bargaining  power  of Customers:",
    " The  consumers  are price  sensitive  & have  information  about  the product  & its  price",
    " Low  switching  cost  gives customers  high  bargaining  power",
    "2.3.4  PESTEL  Analysis  of Retail  Industry",
    "The retail industry comprises of shops, stores, shopping streets and malls, and e -commerce",
    "stores; where buyers visit such stores either by going there physically or online. The aim is to",
    "complete the transaction,  and  it could  be about  anything like;  food,  clothing,  electronic",
    "equipment, grocery  etc.",
    "Political  Factors  affecting  Retail Industry",
    " Government  Regulation &  Political Influence",
    "The government and the politicians work in collaboration to devise rules and regulations, the",
    "citizens, businesses and the retail industry has to obey them. Such laws can seriously impact",
    "the profit  and  revenue  stream  of businesses. If  the government  raises  sales  taxes,  then  it would",
    "increase the prices of the product and services. Consequently, pe ople would become picky in",
    "their  choices, which means a  drop  in total sales. Fewer sales mean less  profit.",
    "31  If the political environment of the country c hanges like protests, roadblocks or bans, then it",
    "would  disrupt  the supply  chain  of products  and  services.  Therefore,  businesses  cannot  run  their",
    "operations  smoothly, if there’s  a conflict in local  politics.",
    " Economic  Factors",
    "Wise governments  and  economies  appreciate  business  activitie s; they  create  a favorable",
    "environment for businesses to grow. They encourage customers to spend their mone y, instead",
    "of holding  on to it and  buying  what  they  need.  Such  an economic  mindset  proliferate  economic",
    "activities.",
    "On the contrary, when business activities are declining, that means unemployment is higher",
    "and  people  have  fewer  resources.  It’s  a completely  different  environment  of the economy,  and",
    "it creates a different mindset of the people. When people don’t have a job and their resources",
    "are limited,  then  they  would  go on the saving  mode.  Few  spending  means  less  business  activity.",
    "According  to an estimate,  the total  sale  in the retail  industry  would  reach  30 trillion  US  dollars",
    "by the end  of 2023.  It means  that  people  would  have  more  extra  money;  therefore,  the increase",
    "in personal spending  would cause  the total increase  in global sales in retail  businesses.",
    "The economy of a country creates an environment and mindset and of the people, whether to",
    "spend or not. If the economy is good and people have jobs and sources of income, then they",
    "would be able to spend. Otherwise, they won’t. There’s a limit to price cutting, retailers can’t",
    "go below  at a certain limit.",
    "Social  factors  affecting  Retail Industry",
    "Society and social trends develop the shopping habits norms of people, their attitude and",
    "behavior may change and transform because of many factors. Like if they are educated, then",
    "their choices and preferences would be different. In such a case, they would prefer pro ducts",
    "and services of certain multinational brands with their logo on it. Rural customers would buy",
    "any  food  items  based  on their  tastes  or whatever  is available.  Educated  buyers  would  study  the",
    "calories  and  vitamins  of food  items,  and  then one would  decid e based on  one’s  diet  needs.",
    "Demographic social factors like age,  gender, race, income level, and education level of",
    "customers affect the business of retailers. Choices and preferences also vary with gender, age,",
    "and other factors. Like, ladies, educated aged people would comfortable products, and young",
    "ones  would want adventurous and exciting  products.",
    "32  E-commerce retail stores offer products and services to the customers based on shopping",
    "patter ns and the time that the customer spends online. Whenever a customer visits the store",
    "next time, the software would provide him the information based on the data of previous",
    "searches.",
    "Technological  Factors  Affecting  Retail Industry",
    "Whether  it’s  an online  retail  store  or a physical  shopping  mall,  technology  has  influenced  them",
    "both  equally.  It could  be in  the form  of generating  sales  reports,  cash  management,  or",
    "management of the store’s sales record. Businesses have to adopt hardware and software",
    "technology  to keep moving  with time.",
    "Ecommerce stores are the ones that benefited from the technology the most. Especially with",
    "the help of the internet, online retailers can advertise their products and services globally",
    "without any restriction of borders. Companies like Amazon and Alibaba are doing, they offer",
    "products  and  services  worldwide.  All  you  need  is one  good  website  with  the catalog  of products",
    "and  services  that  you’re  offering,  a stable  internet connection  and a  reliable  delivery  system.",
    "Walmart and Amazon both are competitive online retail stores. They offer products and",
    "services along with shipment to deliver the product at the doorstep of customers. It doesn’t",
    "mean that there aren’t other online retailers, as a matter of fact; i t’s rather easy to establish an",
    "online  store  and advertise it.",
    "Legal  Factors  Affecting  Retail  Industry",
    "A retail  store  operates  within  the legal  environment  of a country ; therefore,  it has  to follow  the",
    "prevailing local labor laws, excise and taxation regulation, and other business laws. When a",
    "brand plans to go globally, the rules and regulations become a bit complicated. It’s because",
    "every  country  has different copyrights, trade  and tariff laws.",
    "If a business decides not to follow the local rules and regulations of certain or multiple",
    "countries, then it would result in ban, restrictions, bankruptcy or foreclosure of the business.",
    "Therefore,  the business  must  obey  a country’s laws.",
    "Environment  Factors  Affecting  Retail  Industry",
    "Some  retail  offer  food  and  edible  items.  As we know  that  such  items  can’t  remain  fresh  for a",
    "long  time  in a certain  environment,  there’s  a time  limit  on them.  After  that,  they’ll  be expired",
    "33  or contaminated. Therefore, a retailer has to follow local legal and economical factors. For",
    "instance,  some  countries  apply  taxes on the  sale of  soda  or fatty  food.",
    "The  other  environmental  issue  some  companies  have  to face  is the expiration  dates  of products",
    "and removal of the contaminated stock. Companies have multiple suppliers who provide",
    "products  with  different  expiring  dates  when  sales  staff  put  them  on the rackets.  All  the products",
    "get mixed up, what comes first or  expire  earlier  than the other.",
    "If a retail  store  doesn’t  maintain  a standard  healthy  environment  within  the store,  then  food  and",
    "safety  departments would eit her ban or  impose some penalty  of a  certain  amount on the store.",
    "After  carefully  studying  the political,  economical,  technological,  social,  legal  and",
    "environmental  issues  that  the retail  industry  has  to face.  If they  follow  the prevailing  rules and",
    "regulations of a country, then it’s good. Otherwise, they would end up in a lot of lawsuits and",
    "legal  penalties and it would cost a  lot to a business.",
    "Effect  of COVID -19 on Indian  Retail  Market",
    "During Lockdown a survey conducted by Retailers Association of India says, In Non -Grocery",
    "Retails  80 to 100  percent  of sales  is reduced.  As 85 percent  of retail  costs  are fixed  retailers  are",
    "facing  immense  pressure.  Most  importantly  Retail  industry  is facing  severe  liquidity  challenges",
    "that can lead to huge unemployment. While the Food -Retailers expect to earn 56 percent of",
    "profits  when  compared  to the previous  year.  The  Non -Food  Retailers  expect  to earn  40 percent",
    "of previous year profits in the next six months provided pandemic situation doesn’t worsen.",
    "Though, Indian Retail Market Size is showing a growing trend unexpected onslaught of the",
    "pandemic  has worsened the  situation for retailers .",
    "2.4 PRICING  STRATEGIES  IN TH E INDUSTRY",
    "One  of the most  important  element  or variables,  and  the retailing  buying  decision  is price.  The",
    "entire retail organization is dependent on the single factor; it was either make i t or break it. It",
    "is also known as  the biggest and easiest  measurement, which is  subject to change.",
    "Rising  helps  the retail  organization  to complete  its objective.  This  is also  significant  for",
    "new market entrant whose primary function is to establish their brand and then enjoy the",
    "increasing profits as and when the brand gets acceptance from the customers. From the",
    "customer’s  point  of your  price  is considered  as one  of the main  reason  to visit  a particular  retail",
    "store.",
    "34  The pricing strategy in the case of the retail marketing mix should be consistent and consider",
    "the overall positioning  of retailers  sales, profits, and rate  of return on investment.",
    "The  lowest  price  may  not  necessarily  mean  the best  price.  Profit  is the difference  between  cost",
    "and  price. This can be  very  high  when an urgent situation  is exploited by  the salesman.",
    "Cash  flow,  overall  growth,  and  profitability  are sort  out  by the retailers  in order  to survive",
    "the retail business . But in this case, pricing cannot be determined in isolation, and operating",
    "expenses and  costs  are equally  important  while  establishing  the retail  price.  Pricing  the",
    "products  is either based on the  market at the  cost  of the product.",
    "The profits that are generated are within this and  is controlled by the government and oriented",
    "by consumer  or competition.  Before  one  can  determine  the price,  it needs a certain",
    "consideration such as the position of the market the position of the product in the market the",
    "perception of the customer various stages of a product life cycle through which the product is",
    "passing  along  with the  competitive strategy  and the overall  retail marketing mix.",
    "The calculation of retail price should always be based on the markup and not the cost that is",
    "involved.  Competition,  organizational  objectives,  credit  terms,  discount,  cost  and  profit,",
    "variable and fixed cost, pricing options, positioning strategies , pricing policies, etc. are the",
    "compone nts of pricing  strategies.",
    "Reliance  Retail  Pricing  Strategy:",
    "Below is the pricing strategy in Reliance Retail marketing strategy:",
    "Reliance  Retail  stores  offer goods  at extremely  competitive  prices.",
    "At a place like India, where there are about 7 million retail stores, pricing plays a big factor of",
    "differentiation. With setting up big and attractive supermarkets, the number of people coming",
    "inside wish to buy in bulk. Reliance offers them a price which  is generally lower than general",
    "stationery  stores.  This  strategy  is mostly  applied  in FMCG  sector.  This  is possible  from  getting",
    "the products directly  from suppliers in bulk  and their connection with the  farms.",
    "However, in the clothing sector and in footw ear, Reliance Retail offer mid -range to premium",
    "pricing, this is because they offer premium quality products from well -known brands. In",
    "jewellery business, they keep pricing similar to their competitors and rely upon their designs",
    "for differentiation. They  have the dedicated Card named Reliance cards where they give",
    "discounts  on multiple  buys.",
    "35  2.5 PROSPECTS  & CHALLENGES  OF  THE  INDUSTRY",
    "The  COVID -19 pandemic  has  brought  the global economy  to its knees.  Economies  around  the",
    "world are expected to contract by higher single digits. India being a consumption -driven",
    "economy,  the lockdown  has  hit retail  industry  the worst  affecting  wages,  employment,",
    "operations, supply chain, sales and finances. It has even driven businesses to per manent",
    "closure.  Retail  contributes  to around  40%  of India’s  consumption,  10%  of national  India’s  GDP",
    "and employs around 46 Mn people. Therefore, any impact on retail directly puts a dent in the",
    "country’s  economy.",
    "E-commerce  has  been  slightly  better  but  even  it has  faced  supply  chain  shocks  due  to lockdown.",
    "The pandemic has changed the rules of the game. The ABC of consumer Attitudes, Behavior",
    "and  Consumption  will  change  significantly  in the coming  days.  Even  before  the consumers  exit",
    "their lockdown cocoons and head to a store, their priorities would have changed, and many",
    "rules  of retailing  may  need  to be refined,  or even  rewritten.  Retail  is nothing  if not  resilient  and",
    "retailers are doing everything they can to bounce back. To quote the great inventor Thomas",
    "Edison, “There is a great value in disaster because we can start all over again”. Reinventing",
    "retail for the  new reality  is the way  forward.",
    "2.5.1  Prospects  of the  Retail  Industry",
    "Robust  Demand:",
    " According  to the Retailers  Association  of India  (RAI),  the retail  industry  achieved  93%",
    "of pre -COVID  sales  in February  2021;  consumer  durables  and  quick  service  restaurants",
    "(QSR)  increased by  15%  and 18%  respectively. ",
    " Increasing purchasing power has led to growing demand",
    "Innovation  in Financing: ",
    " Collective  efforts  of financial  houses  and  banks  with  retailers  are enabling  consumers",
    "to go for  durable products with easy  credit. ",
    "Policy  Support :",
    " About  51%  FDI  in multi -brand retail. ",
    " 100%  FDI  in single -brand  retail under  the automatic  route.",
    " Goods  and  Service Tax (GST)  was  introduced  for single  unified  tax system. ",
    " To provide  a level -playing  field  to stakeholders,  the Government  is preparing  policies",
    "of retail, FMCG  and E -commerce  within a  single  policy  framework ",
    "36  Increasing  Investment:",
    " Foreign  retailers entering  the Indian  market. ",
    " Cumulative  FDI  inflows  in the retail  sector  stood  at US$  3.44  billion  between  April",
    "2000  and December  2020.",
    " India’s  retail  sector  attracted  US$  6.2  billion  from  various  private  equity  and  venture",
    "capital  funds in 2020 ",
    "Indian  Retail is  set to  benefit from  FDI  Policy",
    " Minimum  investment cap  is US$  100 million. ",
    " 30%  procurement of  manufactured or processed  products must be  from SMEs. ",
    " Minimum  50%  of total  FDI  must  be invested  in backend  infrastructure  (logistics,  cold",
    "storage,  soil testing  labs,  seed farming  and  agro processing  units). ",
    " Removes  middlemen  and  provides  better  price  to farmers. ",
    " Development  in retail  supply  chain  system. ",
    " 50%  jobs  in retail  outlet  could  be reserved  for rural  youth  and  a certain  amount  of farm",
    "produce  to be procured from poor farmers. ",
    " Products  to be sold  under  the same  brand  internationally.  Sale  of multi -brand  goods  is",
    "not  allowed even if produced by  the same manufacturer. ",
    " 100%  FDI  allowed  in single -brand  retail  under  the automatic  route.",
    " 100%  FDI  in retail trading  of food  products  manufactured  or produced  in India.",
    " Liberalisation of FDI is expected to give a boost to Ease of Doing Business and Make",
    "in India",
    " It will  keep  food  and  commodity  prices  under  control.  It will  also  cut agricultural  waste",
    "as mega  retailers  would  develop  backend  infrastructure.  Consumers  will  receive  higher",
    "quality  products  at lower  prices and with better service. ",
    "New  Goods  and  Service Tax (GST)  would simplify  Tax Structure",
    "SUPPLY  CHAIN  STRUCTURE",
    " Goods  and  Service  Tax  (GST)  as a unified  tax regime  is expected  to lead  to re-",
    "evaluation  of procurement and distribution arrangements. ",
    " Removal  of excise duty  on products would result  in cash flow improvements ",
    "37  CASH  FLOW",
    " Tax refunds on goods purchased for resale implies a significant reduction in the",
    "inventory  cost of distribution. ",
    " Distributors are also expected to experience cash flow from collection of GST in their",
    "sales,  before  remitting  it to the  Government  at the  end of  the tax -filing  period. ",
    "SYSTEM  CHANGES  AND  TRANSITION  MGMT",
    " Changes need to be made to accounting and IT systems in order to record transactions",
    "in line with GST requirements. ",
    " Appropriate measures need to be taken to ensure smooth transition to the G ST regime",
    "through employee training, compliance under GST, customer education and inventory",
    "credit  tracking. ",
    "PRICING  AND  PROFITABILITY",
    " Elimination  of tax cascading  is expected  to lower  input  costs  and  improve  profitability. ",
    " Application  of tax at all points  of supply  chain  is likely  to require  adjustments  to profit",
    "margins,  especially  for distributors and retailers. ",
    "2.5.2  Challenges  of Retail  Industry",
    "The  growth  of retail  industry  to slow  down  amid  the imposed  nationwide  lockdown.  The  share",
    "of organised  retail  & e-commerce  to rise  exponentially,  which  may  affect  the unorganised  retail",
    "sector.  Reduction  in consumption  due  to fear  of economic  slowdown  and  subsequent  job  losses.",
    "Complete  halt  on manufacturing  activities  due  to lockdown  restricted  the supply  to retail  stores.",
    "Financial stress in manufacturing industry lead to reduction in credit period for retail stores.",
    "All  this seems to be  have a  great impact on Retail Industry.",
    "The rural sector is likely to revive faster owning to the government’s focus. Th e stimulus",
    "packages and the impetus provided in the union budget and the stimulus to combat the effect",
    "of the pandemic  is set to  create  a robust rural economy  which is capable to  drive  demand.",
    "2.6 KEY  DRIVERS OF  THE INDUSTRY",
    "Large population base and rapidly c hanging consumer needs are likely to drive the future of",
    "Indian retail industry. While a large portion of the market still remains unorganised, the share",
    "of organised retail is growing  rapidly.",
    "38  2.6.1  Key  Drivers  for Global  Retail  Industry",
    "Growing  consumption:  USD  6 Tn consumption  expenditure  by 2030  India  to be the 3rd  largest",
    "consumer  market in the world after  USA &  China.",
    "Income growth:  Rising per Capita Income (Current) – USD 2,014; more than doubled in last",
    "10 years.",
    "Transition from joint to nuclear families : 74% nuclear households by 2025 from 70% in 2016",
    "Nuclear families’  household expenditure  is 30%  more  than joint  families.",
    "Rapid  urbanization:  Urban  residents  increased  from  30.9%  in 2010  to 34.9%  in 2020  40.1%  of",
    "Indians will be  urban residents by  2030.",
    "Government initiatives :100% FDI allowed via automatic route in case of single brand retail",
    "whereas  51%  FDI  is permissible  via government  route  in case  of multi -brand  retail",
    "Implementation of GST eased the supply cha in of retail stores Model Shop & Establishment",
    "Act  allows state  governments to permit  retailers to  operate 24X7.",
    "Rise in online spending: Online shoppers are projected to increase from 15% in 2019 to 50%",
    "of the  total online population by  2026.",
    "Expansion of  the middle & high -income segment:  Middle1 & high -income2 households are",
    "likely  to incur ~USD 4 Tn of incremental consumption spend by  2030",
    "Young  population : Median  age  of 31 by 2030;  remains  one  of the youngest  nations  in the world",
    "90 Mn new households headed by  millennials by  2030.",
    "Digitally influenced spending:  Estimated to reach USD 550 Bn (30 -35% of all retail sales) by",
    "2025  from USD 45 -50 Bn (8 -10%  of all retail sales)  in 2016",
    "Generation Z:  370 Mn generation Z^ consumers by 2030  Comfortable with online shopping",
    "and  equipped  with latest  gadgets",
    "Increase in internet penetration : 55% or more by 2025 850 Mn users by 2021; more than the",
    "population  of ‘six  G7’  countries.",
    "2.6.2  Key Growth  Drivers  for  Retail  in India",
    " Consumer  preference",
    "India’s per capita GDP increased to Rs. 143,048 (US$ 1,982.65) in FY19 from Rs. 129,901",
    "(US$  1,800.43)  FY18.  Indian  consumers are  now shifting  more  towards  premium  brands",
    "39  Fig  2.17: Growth  Drivers  for  Retail in  India",
    " Brand  consciousnes s",
    "Factors like  young demographic composition, increasing personal disposable income,",
    "preference towards affordable luxury and rising middle class population are developing",
    "preferences  for specific  brands",
    " Consumer  finance  opportunity",
    "According to India Ratings and Research (Ind -Ra), domestic organised food and grocery",
    "retailers are expected to increase by 10% YoY in FY22, with organised retailers and e -",
    "commerce  likely  to benefit from the  ongoing  demand for essentials.",
    " FDI  approval",
    "Department for Promotion of Industry and Internal Trade (DPIIT) approved three foreign",
    "direct investments (FDI), Mountain Trail Food, Kohler India Corporation, and Merlin",
    "Entertainments India in single -brand retail. DPIIT has approved two FDI proposals wor th",
    "more  than Rs. 400 crore  (US$  62.45 million) within the retail  sector.",
    " Hybrid  retail  model",
    "In December  2020,  Flipkart's  independent  value -driven  platform  ‘2GUD’  launched  '2GUD",
    "Local’,  which  is aimed  at extending  the benefits  of ecommerce  to traditional  retail",
    "businesses.",
    " Investment",
    "In September  2020,  US  private  equity  firm  Silver  Lake  announced  plan  to invest  Rs.  7,500",
    "crore (US$ 1.00  billion) in Reliance Retail, by Silver Lake in a Reliance Industries",
    "subsidiary  after the  US$ 1.35 billion  investment in Jio  Platforms earlier in 2020.",
    "40  In November 2020, Saudi Arabia's sovereign Public Investment Fund (PIF) announced",
    "plans  to invest in Reliance  Retail Ventures  Ltd. for 2.04%  stake.",
    "In November 2020, FreshToHome, a Bengaluru -based online fresh fish and meat retailer,",
    "raised  US$  121  million  in Series  C funding,  led by Investment  Corporation  of Dubai  (ICD).",
    "In December  2020,  Singapore’s  sovereign  wealth  fund,  GIC  Pte  Ltd.  and  ESR  Cayman  Ltd.",
    "formed  a JV to develop  and  purchase  industrial  and  logistics  assets  worth  US$  750  million",
    "in India.",
    "2.6.3  Opportunities  in Indian Retail  Industry",
    "Fig  2.18: Growth  value  proposition",
    "Ample Growth Opportunities in Indian Retail Industry: -",
    "LARGE NUMBER OF  RETAIL  OUTLETS",
    " India  is the fifth  largest  preferred retail  destination globally.",
    " The sector is experiencing exponential growth, with retail development taking place not",
    "just  in major cities and metros, but  also in tier  II and tier III  citie s.",
    "41  PRIVATE  LABEL  OPPORTUNITIES",
    " The organised Indian retail industry has begun experiencing an increased level of activity",
    "in the private label space.",
    " The  organised retail  sector  is forecast  to witness  strong  growth  in the coming  years.",
    " The  share  of private  label  strategy  in the US  and  UK  markets  is 19%  and  39%,  respectively,",
    "while its share in India is just 6%. Stores like Shopper Stop and Lifestyle generates 15 to",
    "25%  of their revenue  from private  label brands.",
    "SOURCING  BASE",
    " India‘s  price  competitiveness  attracts  large  retail  players  to use  it as a sourcing  base.",
    " Global  retailers  such  as Walmart,  GAP,  Tesco  and  JC Penney  are increasing  their  sourcing",
    "from  India  and  are moving  from  third  party  buying  offices  to establishing  their  own  wholly -",
    "owned/wholly  managed sourcing and buying  offices.",
    "LUXURY  RETAILING",
    " Luxury  retailing  is gaining  importance  in India.  This  includes  fragrances,  gourmet  retailing,",
    "accessories and jewellery  among  many  others.",
    " Luxury  market  of India  is expected  to grow  to US$  30 billion  by the end  of 2020  from  US$",
    "23.8 billion in 2017, supported by growing exposure of international brands among Indian",
    "youth and higher purchasing power of the upper class in tier II and III cities, according to",
    "ASSOCHAM.",
    "Indian retail industry is no doubt one of the largest and fastest growing industries. Like most",
    "developed countries,  India’s growth also relies on growth of its retail industry.  India is",
    "becoming  a dynamic  market  with  many  international  brands  entering  India to  capitalize  on the",
    "growing consumption pattern shown by the country. With right reforms and government",
    "initiatives, India retail industry is surely inching its way towards becoming the next boom",
    "industry. The future of the retail industry looks pro mising, as more and more Government",
    "policies  have  come into play, making  it favourable to do  business.",
    "42",
    "CHAPTER -III",
    "REVIEW  OF  LITERATURE",
    "43  3.1 BRIEF  THEORETICAL  CONSTRUCT  RELATED  TO  THE  PROBLEM",
    "The present chapter is an attempt to give the theoretical frame work applied for the present",
    "study.  Finance  is rightly  said  to be the life  blood  of an enterprise.  The  main  activities essential",
    "to the successful administration of finance in any organization consists of financial planning",
    "and  control,  determinant  of business  success,  focal  point  of decision  making,  raising  the needed",
    "fund,  financial  analysis and measure  of performance.",
    "Business is  mainly concerned with the financial activities. In order to ascertain the financial",
    "status  of the business  every  enterprise  prepares  certain  statements,  known  as financial",
    "statements. Financial statements are mainly prepared for decision making purposes. But the",
    "information as is provided in the financial statements is not adequately helpful in drawing a",
    "meaningful  conclusion.  Thus,  an effective  analysis  and  interpretation  of financial  statements  is",
    "required.",
    "3.1.1  Financial  Performance  Analysis",
    "Financial  Performance  analysis  involves  using financial  data to assess  a company’s",
    "performance and make recommendat ions about how it can improve going forward. It is the",
    "process  of identifying the financial  strength  and  weakness  of a firm  from  the available",
    "accounting data and financial statement. The analysis is done by properly establishing the",
    "relationship between t he items of balance sheet and profit and loss account the first take of",
    "financial analyst is to determine the information relevant to the decision under consideration",
    "form the total information contained in the financial statement. The second step is to arrange",
    "information in a way to highlight significant relationship. The final step is interpretation and",
    "drawing of inferences and conclusion. Thus financial analysis is  the process of selection",
    "relating  and evaluation of the  accounting  data information.",
    "3.1.2  Financial  Statement",
    "Financial  statements  are the summarised  statements  and  reports  prepared  by business  concerns",
    "to disclose their accounting information and to communic ate them to the interested parties.",
    "According to John N. Myer, “Financial statements provide a summary of the accounts of a",
    "business enterprise, the Balance Sheet reflecting the assets and liabilities and the income",
    "statement  showing  results  of operations during  a certain  period”.",
    "Financial statements are mirrors which reflect the financial position and operating strength or",
    "weakness  of a  concern.",
    "44",
    "Types  of financial",
    "Analysis",
    "According  to",
    "materials  used  According  to modus",
    "operandi  According  to",
    "objectives  of analysis",
    "External",
    "Analysis        Horizontal",
    "Analysis     Long  term",
    "Analysis",
    "Internal",
    "Analysis  Vertical",
    "Analysis     Short  term",
    "Analysis  AICPA (American Institute of Certified Public Accountants) states that “Financial statements",
    "are prepared for the purpose of presenting a periodical review or report on the progress of the",
    "management and deal with (i) the status of the investments in the business and (ii) the results",
    "achieved  during  the period under review”.",
    "These  statements  include: -",
    " Income  Statement known as  Profit  & Loss  Account",
    " Position  Statement  known  as Balance  Sheet.",
    "Profit and Loss Account is prepared to ascertain the net results of business activities of a",
    "particular period and Balance Sheet is prepared to show the financial position of the business",
    "as at a particular  date.",
    "3.1.3  Types  of Financial  Analysis",
    "Distinction  between  the different  types  of financial analysis  can  be made  either  on the basis  of",
    "materials used for the same or on the basis of the modus operandi of the analysis or the",
    "objectives  of analysis. The  following chart  will  give  a snap -shot view  of it.",
    " According  to materials  used:",
    " External  Analysis:  External  analysis  of financial  statement  is made  by those  who  do not",
    "have  access  to the detailed  accounting  records  of the company,  i.e.,  banks,  creditors  and",
    "general  public.  These  people  depend  almost  entirely  on published  financial  statements.",
    "The  main objective  of such analysis varies  from party  to party.",
    " Internal Analysis:  Such analysis is made by the finance and accounting department to",
    "help  the top  management.  These  people  have  direct  approach  to the relevant  financial",
    "45  records. So they can peep behind the two basic financial statements and narrate the",
    "inside story. Such analysis emphasises on the performance appraisal and assessing the",
    "profitability  of different activities.",
    " According  to modus  operandi:",
    " Horizontal  Analysi s: When  the financial  statements  for a number  of years  are reviewed",
    "and  analysed,  the analysis  is called  Horizontal  analysis.  The  preparation  of comparative",
    "statements  is an example  of horizontal  analysis.  As it is based  on data  from  year  to year,",
    "this  analysis is also known as Dynamic  analysis.",
    " Vertical Analysis:  Vertical analysis is also known as Static Analysis. When ratios are",
    "calculated  from  the items  of income  statement  or Balance  Sheet  of one  year,  it is called",
    "vertical analysis. It is not very useful for long -term planning as it doesnot include the",
    "trend study  for future.",
    " According  to objectives  of analysis:",
    " Long -term Analysis:  In the long -term, the company must earn a minimum amount",
    "sufficient to maintain a sui table rate of return on the investment to provide for the",
    "necessary growth and development of the company and to meet the cost of capital.",
    "Thus, in the long run analysis the stress is on the stability and earning potentiality of",
    "the concern. In long -term a nalysis the fixed assets, long term debt structure and the",
    "ownership  interest are  analysed.",
    " Short -term  Analysis:  The  short -term  analysis  of financial  statement  is mainly",
    "concerned with the working capital analysis. In the short run, a company must have",
    "amp le funds readily available to  meet  its current  needs  and  sufficient  borrowing",
    "capacity  to meet  the contingencies.  Hence,  in short -term  analysis,  the current  assets  and",
    "the current liabilities are analysed and cash position of the concern is determined. For",
    "the purpose, the ratio analysis is most useful tool.",
    "3.1.4  Techniques/  Tools/  Methods  of Financial  Analysis",
    "The  analytical tools used  in the present study  of financial performance  are as follows: -",
    " Comparative  Statements",
    " Common -size  Statements",
    " Trend  Ratios  (Trend  Percentages)",
    " Ratio  Analysis",
    " Du-pont  Analysis",
    " Correlation  analysis",
    "46   Comparative  Statements: -",
    "The preparation of comparative statements are the important devices of horizontal financial",
    "analysis.  Financial  data  becomes  more  meaningful  only  when  these  are compared  with  similar",
    "data  of a previous  period  or a number  of prior  periods.  When  figures  of financial  statements  of",
    "two  or more  years  are placed  side -by-side  to facilitate  comparison,  these  are called  comparative",
    "financial statements. These are prepared in a form that reflects financial data of two or more",
    "periods. Such comparative statements are of great value in forming the opinion regarding the",
    "progress  of the  enterprise. Comparative  Statement show:",
    "(i) Absolute  figures  of two  or more  years.",
    "(ii) Change  in the absolute  figures  between  the periods  (Increase  or decrease  in absolute",
    "figures)",
    "(iii)  Increase  or decrease  in terms  of percentages.",
    "The main aim of preparing financial statements is to present the data of a number of years in",
    "simple and  comparable  form.  When  data of a number of  years are placed  side -by-side,",
    "comparison  becomes  easier  to draw  conclusions  on the operating  result  and  financial  health  of",
    "the concern.",
    "Comparative  statements  are of two  types: -",
    " Comparative  Balance  Sheet",
    " Comparative  Income  Statement",
    "Here in this study, we are doing only Comparative Balance Sheet. It is a statement prepared",
    "from the Balance Sheet figures of two or more years by placing them side -by-side, so as to",
    "facilitate  a comparison,  in forming  an opinion  about  the progress  of the enterprise.  It is a study",
    "of the trend of the same items or group of items of two or more Balance sheets of the same",
    "business enterprise on different dates. The Changes in periodic Balance sheet items reflect the",
    "conduct  of the business.  The  changes  can  be observed  by comparing  the figures  of items  in the",
    "Balance  sheets at the beginning  and at the  end of  the period.",
    "The  Comparative  Balance  Sheet  has  two  columns to  show  the data  of original  Balance  Sheets,",
    "a third column to show increase or decrease in absolute figures and a fourth c olumn for",
    "percentage  increase  or decrease  in figures.",
    "47   Common  size  Statements:",
    "Common size statements are the statements prepared to show the relationship of different",
    "individual items with some common items. Common size elements establish relationship",
    "between:",
    "(i) Various  items  of the statement  of profit  and  loss  account  to the total  revenue/sales",
    "from  operations.",
    "(ii) Various  items  of assets  of Balance  Sheet to  total  of assets.  and",
    "(iii)  Various  items  of liabilities  to the total  of liabilities  over a  period of  time.",
    "Significant conclusion can be  drawn  by studying  the change  in such a  relationship.",
    "A common size Balance sheet statement in which Balance Sheet items are expressed as",
    "percentage of each asset to total of assets and percentage of each liability to total of liabilities",
    "is called Common Size Balance Sheet. In other words each assets is expressed as percentage",
    "of total  assets  and  each  item  of equity  and  liability  is expressed  as percentage  to total  of equity",
    "and  liabilities",
    " Trend  Ratios  (Trend  Percentages)",
    "Trend signifies tendency. Therefore review and appraisal of tendency in accounting variables",
    "is simply called as trend analysis. Trend ratios is also an important tool of horizontal financial",
    "analysis. Under this technique of financial analysis, the ratios of different items for various",
    "periods are calculated and then a comparison is made. An anal ysis of the ratios over the past",
    "few years may well suggest the trend or direction in which the concern is going upward or",
    "downward. The method of trend percentages is a useful analytical device for the management",
    "since  by substituting  percentages  for larg e amounts, the  brevity  and readability  are achieved.",
    "Procedure  for calculation  of trends:",
    "(i) One  year  is taken  as the base  year.  Usually,  the first year  is taken  as the base  year.",
    "(ii) The  figures  of base  year are  taken  as 100.",
    "(iii)  Trend  percentages  are calculated  in relation  to the base  year.",
    "If a figure in a year is less than the base year figure, the trend percentage will be less than 100",
    "and  if the figure  is more  than  the base  year  figure  the trend  percentage  will  be more  than  100.",
    "Trend  percentage  = Current year  amount  × 100",
    "Base  year  amount",
    "48   Ratio  Analysis:",
    "Ratio analysis is the analysis of financial statements with the help of ratios. It includes",
    "comparison and interpretation of ratios and their use of future projections. Ratio analysis",
    "may  be defined  as “The  process  of computing,  determining  and  presenting  the relationships",
    "of items  and  groups  of items  of financial  statements  with  the help  of rati os and  interpreting",
    "the results  there  from”.",
    "Accounting ratios are important tools for measuring the efficiency of an enterprise. They",
    "help the financial management in evaluating the financial position and performance of a",
    "concern. The analysis of accounti ng ratios helps to measure the health of a firm. The",
    "accounting  ratios used in  this study  include: -",
    " LIQUIDITY  RATIOS/  SHORT  TERM LIQUIDITY  RATIOS",
    "Liquidity is the ability of a firm to meet its current liabilities as they fall due. These ratios",
    "are used  to assess  the short -term  financial  position  of the concern.  Liquidity  ratios  include: -",
    " Current Ratio:  Current ratio is the ratio of current assets to current liabilities. It is the",
    "most common ratio for measuring liquidity. It is calculated by dividing current assets",
    "by current  liabilities.",
    "Current  Ratio  = Current  Assets",
    "Current  Liabilities",
    " Quick Ratio : Quick Ratio establishes the relationship between quick or liquid assets",
    "and liabilities.  An asset is liquid if it can be converted into cash immediately or",
    "reasonably soon without a loss of value. This ratio is also known as ‘Acid Test Ratio’",
    "or ‘Liquidity  Ratio’.",
    "Quick  Ratio  = Quick  or Liquid  Assets",
    "Current  Liabilities",
    " Cash Ratio or Absolute Ratio:  Cash is the most liquid asset.  When the relationship",
    "between cash and current liabilities is calculated it is called Cash Ratio or Absolute",
    "Liquid  Ratio.  In the computation  of Cash  Ratio  Marketable  Securities,  Trade",
    "Investment s are included.",
    "Cash  or Absolute  Ratio  = Cash+Marketable  Securities",
    "Current  Liabilities",
    " LEVERAGE  RATIOS  OR LONG  TERM  FINANCIAL  RATIOS",
    "These  ratios  measure  the long  term  solvency  position  of the firm.  The  following  are the",
    "important  leverage  ratios:",
    "49   Debt -equity (D/E) Ratio (Ratio of long term debt to shareholders’ fund): The debt -",
    "equity  ratio  is the ratio  showing  the relationship  between  long  term  debts  and",
    "shareholders fund. This ratio indicates the relative proportion of long -term debt and",
    "equity  in financing  the assets  of a firm.  The  ratio  is computed  by dividing  the long  term",
    "debts  of the firm by  shareholders’  fund or net  worth.",
    "Debt - equity  Ratio  = Debt",
    "Equity  OR   Long term Debts",
    "Shareholders  fund  or Networth",
    " Proprietary  Ratio : Proprietary  ratio  is the ratio  of shareholders’  fund  to total  assets.  This",
    "ratio show the proportion of total assets financed by the owners. It is calculated by",
    "dividing  shareholders’  funds by  the total assets.",
    "Proprietary  Ratio  = Shareholders  fund",
    "Total  assets",
    " Solvency ratio : Solvency Ratio is the ratio of total outside liabilities (both non -current",
    "and  current liabilities)  to the  total assets of a  concern.",
    "Solvency  Ratio  = Total  Liabilities  to outsiders",
    "Total  Assets",
    " Fixed  Asset  Ratio : Fixed  Asset  Ratio  of fixed  assets  after  depreciation  to total  long  term",
    "funds. Here, the total long fund means shareholder’s fund (including preference share",
    "capital)  and long  term fund.",
    "Fixed  Asset  Ratio  = Fixed  asset  ( after  Depreciation)",
    "Total  long  term  funds",
    " Interest Coverage Ratio (Debt Service Ratio):  This ratio expresses the relationship",
    "between Earning Before Interest and Tax (EBIT) and fixed Interest charges. Fixed",
    "interest  charges  include  interest  on debentures  and  bonds  and  other  long  term",
    "borrowings.",
    "Interest  Coverage  Ratio  = EBIT",
    "Fixed  Interest  Charges",
    " Fixed Assets to Net worth:  This ratio shows the relationship between fixed assets and",
    "shareholders fund. The purpose of this ratio is to find out the proportion of the owners",
    "fund  invested in fixed assets.",
    "Fixed  Assets  to Net  worth  = Fixed  assets",
    "Net  worth  or Shareholders  fund",
    " PROFITABILITY  RATIOS",
    "Profitability  is an indication  of the efficiency  with  which  the operations  of the business  are",
    "carried on. The  following are  the important profitability  ratios.",
    "50  I General Profitability  Ratio",
    " Gross  Profit  Ratio:  The  gross  profit  is the ratio  of gross  profit  to revenue  from",
    "operations.  It expresses  the relationship between  gross profit  and sales.",
    "Gross  Profit  Ratio  = Gross  profit  ×100",
    "Net  Sales",
    " Net Profit Ratio/ Net profit Margin Ratio: The net profit is the ratio of  net profit to",
    "revenue from operations .It measures the profit per rupee of sales. It is determined by",
    "dividing  the net profit after tax  by the net  revenue  for the period.",
    "Net  Profit  Ratio  = Net  profit",
    "Revenue  from  Operations  ×100",
    " Operating Ratio : Operating ratio is the proportion of operational cost of a business to",
    "its revenue from operations. It is an important ratio used to ascertain the general",
    "profitability of the concern. It is calculated by dividing the total operating cost by",
    "revenue from operations.",
    "Operating  Ratio =  Operating  Cost",
    "Revenue  from  Operations  × 100",
    "II Overall Profitability  Ratios",
    " Return  on Shareholders’  fund:  It relates  the profit  available  for the shareholders  on their",
    "total  investment.  It is also known  as ‘Profit on  Net Worth’  ratio.",
    "Return on  Shareholders’  fund =  Net  profit(after  interest  and  tax)",
    "Shareholders  fund",
    " Return on Equity Share Capital: This ratio indicates the return on the equity share",
    "capital. Owners are more interested with this ratio since it indicates the success of the",
    "company  in generating  earnings on their  behalf.  It is calculated  as follows:",
    "Return  on E.S.C  = Net  profit(after  interest,tax  and  preference  dividend)",
    "Equity  Share  Capital",
    " Return on Capital Employed (Yield on capital): This ratio is also known as Return on",
    "Investment  (ROI). It  indicates  the return  on capital  employed  in the business  and  it can",
    "be used to  show the  efficiency  of the  business as  a whole.",
    "ROI/  ROCE  = Net  profit(  before  interest,tax  and  dividend)×100",
    "Capital  Employed",
    "51   Earning  Per  Share  (EPS ): This  ratio  helps  in the assessment  of the profitability  of a firm",
    "from the standpoint of equity shareholders. This measures the profit available to the",
    "equity  shareholders per share.  It is calculated  as:",
    "EPS =  Net profit available to the equity shareholders",
    "Number  of equity  shares  issued",
    " Return on Total Assets : Profitability can be measured in terms of relationship between",
    "net profit and total assets.  It measures the profitability  of investment.",
    "Return  on Total Assets  = Net  profit",
    "Total  assets  ×100",
    " Capital Turnover Ratio: It is the relationship between revenue from operations and",
    "capital employed. This ratio is calculated to measure the efficiency or effectiveness",
    "with which a  firm utilises its  capital.",
    "Capital  Turnover  Ratio  = Revenue  from  operations  ×100",
    "Capital  Employed",
    " TURNOVER  RATIOS  (ACTIVITY  RATIOS)",
    "The  activity  ratios  are those  ratios  which  measure  the level  of activities  and  operating  efficiency",
    "of a business concern. These ratios are also known as ‘efficiency ratios’ These ratios indicate",
    "the speed with which assets are being converted into revenue. Activity ratios measure how",
    "efficiently  the assets are  employed by  the firm.",
    " Inventory Turnover Ra tio (Stock turnover ratio or Stock velocity): Inventory turnover",
    "ratio is the ratio which helps to measure whether the investment is efficiently used or",
    "not. It measures the speed at which the inventory is converted into revenue from",
    "operations(sales).  The  ratio is calculated as follows:",
    "Inventory  Turnover  Ratio  = Cost  of revenue  from  operations",
    "Average  Inventory",
    " Fixed assets turnover ratio: This ratio indicates the extent to which the investments in",
    "fixed  assets contribute  towards sales.",
    "Fixed Assets Turnover Ratio  = Net  Revenue  from  operations",
    "Fixed  Assets",
    " Working  capital  turnover  ratio:  This  ratio  reflects  the turnover  of the firms  net working",
    "capital  in the course  of the year.  It’s  a good  measure  of over  trading  and  under -trading.",
    "Working  capital  Ratio  = Net  revenue  from  operations",
    "Net  working  capital",
    " Trade Receivables Turnover Ratio (Debtors Turnover Ratio/ Debtor’s velocity:  This",
    "ratio  is calculated  to establish  the relationship  between  average  trade  receivables  and",
    "52  net credit  revenue  from  operations  within  a period.  It shows  the credit  collection  power",
    "and  policy  of the  firm.  It is calculated as:",
    "Trade Receivables  Turnover  Ratio  = Net  credit  revenue  from  operations",
    "Average  trade  receivables",
    " Trade Payables Turnover Ratios (Creditors Turnover Ratio/ Creditors’ velocity): It",
    "indicates  the number  of times  the trade  payables  turnover  in a year.  It signifies  the credit",
    "period enjoyed by  the firm in paying  off its creditors.",
    "Trade  Payables  Turnover Ratio  = Net  credit  purchases",
    "Average  trade  payables",
    "Thus  analysis  of accounting  ratios  help  anyone  to easily  grasp  the relationship  between  various",
    "items  in financial statements.",
    " Du-pont  analysis :",
    "DuPont Analysis is a tool for a detailed assessment of the company’s profitability. DuPont",
    "Analysis  is a tool  that  may  help  us to avoid  misleading  conclusions  regarding  a",
    "company’s  profitability.  The  standard  ratios  of the company  are compared  to present  ratios  and",
    "changes in performance are judged.  DuPont analysis is a useful technique used to decompose",
    "the different  drivers  of return  on equity  (ROE).  The  decomposition  of ROE  allows  investors  to",
    "focus on the key metrics of financial performance individually to  identify strengths and",
    "weaknesses . The equation for  the basic  DuPont model is  as follows:",
    "ROE  = Net  profit  margin  × Total  Asset  Turnover ×  Equity  Multiplier/  Leverage Factor",
    "OR",
    "ROE  = Net  Profit  × Sales",
    "× Total  Assets",
    "Sales  Total  Assets  Common  Equity",
    "It gives a broader view of the Return on Equity of the company. It highlights the company’s",
    "strengths  and  pinpoints  the area  where  there  is a scope  for improvement.  Say  if the shareholders",
    "are dissatisfied with lower ROE, the company with the help of DuPont Analysis formula can",
    "assess  whether  the lower  ROE  is due  to low -profit  margin,  low  asset  turnover  or poor  leverage.",
    "Once  the management  of the company  has found  the weak  area, it may  take  steps  to correct  it.",
    "The  lower  ROE  may  not  always  be a concern  for the company  as it may  also  happen  due  to",
    "53  normal  business  operations.  For  instance,  the ROE  may  come  down  due  to accelerated",
    "depreciation  in the  initial  years.",
    " Correlation  Analysis:",
    "The  study  is to find  out  the relationship  between  two  performance  measures.  The  data  extracted",
    "from annual report and accounts of the company. The correlation are engaged to examine the",
    "relationship  between the  variables.",
    "1.5 Analysis  and  Interpretation  of Financial  Statements",
    "The financial statements become meaningless unless they are analysed and interpreted. On",
    "proper analysis and interpretation of the results, they become valuable and useful. Managerial",
    "decisions  often  depend  on the results  of analysis  of financial  statements  and  their  interpretation.",
    "Analysis of financial statement is a process of evaluating the relationship between component",
    "parts  of a financial  statement  to obtain  a better  understanding  of a firm’s  position  and",
    "performance.",
    "Interpretation  refers  to drawing  inferences  or conclusion  on the  basis  of analysis  conducted  on",
    "financial  statements.  Proper  interpretation  leads  to proper  conclusion  and  judgement  and  taking",
    "effective  measures for  improvements.",
    "3.2 AN  OVERVIEW  OF  EARLIER  STUDIES",
    "A number  of research  studies  have  been  carried  out  on different  aspects  of financial",
    "performance analysis by the researchers, economists and academicians in India and abroad.",
    "Different authors have analysed performance in diffe rent perspectives. A review of these",
    "analyses is important in order to develop an approach that can be employed in the context of",
    "the study. Therefore, the present chapter reviews the studies related with different aspects of",
    "financial  performance  analysis .",
    "Kallu Rao (1993) has made a study of inter -company financial analysis of tea industry -",
    "retrospect and prospect. An attempt has been made in this study to analyse the important",
    "variables of tea industry and projected future trends regarding sales and profit for the next 10",
    "year periods, with a view to help the policy makers to take appropriate decisions. Various",
    "financial  ratios have  been calculated for  analyzing  the financial he alth  of the  industry.",
    "Pai, Vadivel and Kamala (1995) studied the diversified companies and financial performance:",
    "A study.  An effort  was  made  to study  the relationship  between  diversified  firms  and  their",
    "54  financial  performance.  Seven  large  firms  having  different  products -both  related  and  otherwise -",
    "in their portfolio and operating in diverse industries were analyzed. A set of performance",
    "measures / ratios was employed to determine the level of financial performance. The results",
    "reveal  that the  diversified  firms  studied have  been  healthy  financial performance.",
    "In RBI study (1995) an attempt was made to study the financial performance of private",
    "corporate business sector during the period 1994 -95. Of the 1030 companies covered in this",
    "study, 925 are non -financial companies and 105 are financial companies. The results of the",
    "non -financial and financial companies are also analyzed size -wise apart from the analysis of",
    "the consolidated results for the entire sector. The good corporate performa nce during 1994 -95",
    "reflected  in major  profitability  ratios  registering  distinct  improvement  in the year  under  review",
    "as compared to the  previous  year.",
    "Sardeesh Babu (1999)12 in her study “A Study on Financial Performance of Fertilizers and",
    "Chemicals Travan core Limited”. The cost on various overheads can be brought down by",
    "carefully scrutinizing each item and applying cost cutting techniques. The profitability of the",
    "company  can  be improved  by reducing  the expenses  that  do not  contribute  any  productive  use.",
    "The current assets can be managed efficiently by examining the material holding and stock",
    "holding procedure and pattern. If the company increase its turnover and reduces its cost, the",
    "profit will increase leading to an increases in the growth rate of sales , profit before tax and",
    "profit  after tax",
    "Joanne Loundes (2001) in the study „The Financial performance of Australian Government",
    "Trading Enterprises Pre -and Post -Reform‟ revealed that during the 1990's there were several",
    "measures introduced to improve the e fficiency and financial performance of government",
    "trading enterprises in Australia. The purpose of this study was to discover whether there had",
    "been any change in the financial performance of government trading enterprises operating in",
    "electricity,  gas,  water,  railways  and  ports  industries as  a result  of these  changes.",
    "Debasish Sur and Kaushik Chakraborty (2006) in his study financial performance of Indian",
    "Pharmaceutical  industry.  The  comparative  analysis  the financial  performance  of Indian",
    "Pharmaceutical  industry  for the period 1993  to 2002  by selecting  six notable  companies  of the",
    "industry. The comparison has been made from almost all points of view regarding financial",
    "performance  using  relevant statistical tools.",
    "55  Zafar S.M.Tariq & Khalid S.M (2012) The study explored that ratios are calculated from",
    "financial statements which are prepared as desired policies adopted on depreciation and stock",
    "valuation  by the management.  Ratio  is simple  comparison  of numerator  and  a denominator  that",
    "cannot produce complete and authentic picture of business. Results are manipulated and also",
    "may  not highlight other factors which  affect performance  of firm by  promoters.",
    "Ray  Sabapriya  (2012)  Studied  the sample  of automobile  companies  to evaluate  the",
    "performance of industry through indicators namely sales, production and export trend etc for",
    "period of 2003 -04 to 2009 -10. The study finds that automobile industry has been passing",
    "through  disruptive  phases  by over  debt  burden,  under  utilizati on of assets  and  liquidity",
    "instability. The researcher suggested to improving the labour productivity, labour flexibility",
    "and capital efficiency  for success of industry  in future",
    "Jothi, K. & Geethalakshmi, A. (2016) This study tries to evaluate the profita bility & financial",
    "position of selected companies of Indian automobile industry using statistical tools like, ratio",
    "analysis,  mean, standard  deviation, correlation.",
    "3.3 UNIQUENESS  OF  RESEARCH  STUDY",
    "Many  of the previous  studies  are focused  on the performance  evaluation  of selected  industries.",
    "The above kinds of literature clearly state that many studies have been done on profitability,",
    "financial  performance, and liquidity  analysis of various  industries.",
    " The present study was conducted to evaluate the financial  performance analysis of",
    "Reliance  Retail  Limited,  for the period  of 5years  ranging  from  2015  to 2020.  It helps  to",
    "explore  the strength  and  weakness of  the company.",
    " The central focus of the study was to conduct an evaluative study of the financial state",
    "of the firm by using ratio investigation, comparative financial statements, and trend",
    "analysis  by taking  into accounts  the past  years  of the  company’s  financial  statements.",
    " Examination and explanation of financial statements show that, shows a critical vie w",
    "on the overall  financial  efficiency of  RRL  and  Covid -19 impact  on its financial",
    "performance.",
    "56",
    "CHAPTER IV",
    "METHODOLOGY  OF  THE  STUDY",
    "57  4.1 RESEARCH  APPROACH  AND  DESIGN",
    "The research design applicable for the present study is of analytical. Analytical data based on",
    "the collection  of secondary  data  published  by Reliance  Retail  limited  (RRL).  As the use  of facts",
    "information are already available and analyses these to make a critical evaluation of the",
    "material.",
    "4.2 SOURCES  OF  ONLINE DATA",
    "Sources  of online  data in  this  study  are:",
    " Company  website",
    " Online  journals",
    " Online  magazines",
    " Online  articles like blogs .",
    "4.3 DATA  ANALYSIS TOOLS",
    "The  data analysis tools used in the study  include:",
    " Statistical  analysis  include  : Correlation  and  Regression",
    " Figures  and  Charts",
    " Financial analysis  tools  (Ratio  analysis,  Trend  analysis,  Du-pont  analysis  etc.)",
    "4.4 REPORT  STRUCTURE",
    "The  report  is presented in  five  chapters as  given  below;",
    " Chapter  1 Introduction.",
    " Chapter  2 Profile  of Retail  industry  in India",
    " Chapter  3 Review  of Literature.",
    " Chapter  4 Methodology  of the Study.",
    " Chapter  5 Data  Analysis, Interpretation, Inference.",
    " Chapter  6 Findings of the  Study",
    " Chapter  7 Conclusions",
    "4.5 LIMITATIONS  OF  THE STUDY",
    " As the study  was  mainly  based  on secondary  information,  the inherent  limitations  of",
    "the secondary  data might  have  affected the  findings of the  study.",
    " Accuracy  of the  result  depends the  accuracy  of secondary  data.",
    " The  study  has  been  carried  out  for the period  of five  years  and  it is not  sufficient  enough",
    "to analyze  the entire  aspect of the  company.",
    " The  result  of the study  cannot  be generalized  for other  organization  and  we cannot",
    "predict future financial position of the  company  based on the study",
    "58",
    "CHAPTER  V",
    "DATA  ANALYSIS,  INTERPRETATION  & INFERENCE",
    "59  The purpose of any study is to the decision by interpreting the information, so as to draw",
    "conclusions relevant for decision. The purpose of this study is to help decision by providing a",
    "historical  record for managerial decisions.",
    "Analysis  of data  is a process  of inspecting,  cleaning,  transforming,  and  modeling  data  with  the",
    "goal  of highlighting  useful  information,  suggesting conclusions,  and  supporting decision",
    "making.  The  objectives  of the  data analysis:",
    " Validity  and  reliability",
    " Testing there hypotheses of the investigation",
    "Data  analysis can  offer the  following  benefits:",
    " Structuring  the findings from  survey  research or  other  means of data  collection.",
    " Break  a macro  picture  into  a micro  one",
    " Acquiring  meaningful  insights  from  the dataset",
    " Basing  critical decisions from  the findings",
    " Ruling  out  human  bias  through  proper  statistical  treatment",
    "Data Interpretation can be defined as \"the application of statistical procedures to analyze",
    "specific observed or assumed facts from a particular study\". Data interpretation is something",
    "that  is pretty  common  in education  circles.  Data  interpretation  is use d as a means  to understand",
    "a student's  grasp of the  subject",
    "It is very important to understand how to interpret data in order to do well in these tests. It is",
    "especially important in case of students planning to study finance and mathematics. An",
    "interpretation  question  will  usually  contain  a chart  or a graph.  It will  also  contain  some  data  or",
    "even  sets of data which the  student has to  analyze  and come to a  conclusion.",
    " Financial  Analysis",
    " COMPARATIVE  BALANCE  SHEET  ANALYSIS  FOR  THE  PERIOD  OF  5",
    "YEARS  (2015 -16 to  2019 - 20)",
    "Since,  this  study  analyse  comparative  statement  for the period  of 5 years.  At first  2015  is",
    "compared  with  2016  and  then  2016  with  2017  and  2017  with  2018  and  2018  with  2019  and",
    "2019 with 2020.",
    "60  Table 5.1: Comparative Balance Sheet of Reliance Retail Limited (RRL) for the year",
    "2015 &  2016",
    "As at March",
    "2016  (in crore)  As at March",
    "2015  (in crore)  Absolute Change",
    "(Increase/Decrease)  Percentage change",
    "(Increase/Decrease)",
    "EQUITY  AND  LIABILITIES  A B A – B = C  C/B ×100",
    "Shareholders’  funds",
    "Share  capital  4,989.54  4,989.54  - -",
    "Reserves  and  surplus  505.36  198.82  306.54  154.18",
    "Total  5494.9  5188.36  306.54  5.91",
    "Non -current  liabilities",
    "Long -term  borrowings  76.03  3.37  72.66  2156.08",
    "Other  long -term  liabilities  - 75.00  (75.00)  -",
    "Long -term  provisions  14.62  11.95  (2.67)  22.34",
    "Total  90.65  90.32  0.33  0.37",
    "Current  liabilities",
    "Short -term  borrowings  1,086.89  1,670.16  (583.27)  (34.92)",
    "Trade  payables",
    "Micro  and  Small",
    "Enterprises  7.32  4.51  2.81  62.31",
    "Other  2,761.08  1,194.91  1566.17  131.07",
    "Other  current  liabilities  484.68  416.22  68.46  16.45",
    "Short -term  provisions  1.88  1.09  0.79  72.48",
    "Total  4341.85  3286.89  1054.96  32.10",
    "TOTAL  9927.40  8565.57  1361.84  15.90",
    "ASSETS",
    "Non -current  Assets",
    "Fixed  Assets",
    "Tangible  assets  2,026.87  2,053.83  (26.96)  (1.31)",
    "Intangible  assets  2.62  0.36  2.26  627.78",
    "Capital  work -in-progress",
    "Intangible  Assets  under",
    "Development  483.90",
    "48.87  423.16",
    "- 60.74",
    "48.87  14.35",
    "-",
    "Total  2,562.26  2,477.35  84.91  3.43",
    "Non -current  investments  484.81  470.10  14.71  3.13",
    "Deferred  tax assets  (net)  445.58  563.33  (117.75)  (20.90)",
    "Long -term  loans  and  advances  491.83  448.62  43.21  9.63",
    "Total  3,984.48  3959.40  25.08  0.63",
    "Current  assets",
    "Inventories  5,251.22  3,881.73  1369.49  35.28",
    "Trade  receivables  217.93  210.81  7.12  3.38",
    "Cash  and bank  balances  47.60  150.52  (102.92)  (68.38)",
    "Short -term  loans  and advances  426.09  363.03  63.06  17.37",
    "Other  current  assets  0.08  0.08  - -",
    "Total  5942.92  4606.17  1336.75  29.02",
    "TOTAL  9927.40  8565.57  1361.84  15.90",
    "Interpretation:",
    "Shareholder’s fund shows an increase of 5%. Whereas, fixed assets shows an increase of",
    "4%, which might have been financed through long -term borrowings. It is a good sign of",
    "investment  of long -term  fund.  Cash  and  bank  equivalence  have  decreased  by 68.38%.  This",
    "indicates a negative cash position of the company. It further hints towards the fact that",
    "company  might find it challenging  to meet  its short term obligations.",
    "61  Table 5.2: Comparative Balance Sheet of Reliance Retail Limited (RRL) for the year",
    "2016 &  2017",
    "As at March",
    "2017  (in crore)  As at March",
    "2016  (in crore)  Absolute Change",
    "(Increase/Decrease)  Percentage change",
    "(Increase/Decrease)",
    "EQUITY  AND  LIABILITIES  A B A – B =  C C/B ×100",
    "Equity",
    "Equity  Share  capital  4,989.54  4,989.54  0.00  -",
    "Other  Equity  1,830.03  1,134.51  695.52  38.01",
    "Total  6,819.57  6124.05  695.52  10.20",
    "Non -current  liabilities",
    "Long -term  Borrowings  0.22  1.03  (0.81)  (368.18)",
    "Long -term  Provisions  19.85  14.62  5.23  26.35",
    "Total  20.07  15.65  4.42  22.02",
    "Current  liabilities",
    "Short -term  borrowings  27.48  1,086.89  (1,059.41)  (3855.20)",
    "Trade  payables  3,926.86  2,711.25  1,215.61  30.96",
    "Others  287.67  119.32  168.35  58.52",
    "Other  current  liabilities  585.08  424.20  160.88  27.50",
    "Short -term  provisions  5.87  1.88  3.99  67.97",
    "Total  4,832.78  4,343.54  489.24  10.12",
    "TOTAL  11,672.42  10.483.24  1.189.18  10.19",
    "ASSETS",
    "Non -current  Assets",
    "Property.  Plant  and  Equipment  2,245.88  2,026.87  219.01  10.81",
    "Capital  work -in-progress  434.18  483.90  (49.72)  (10.27)",
    "Intangible  assets  10.05  2.62  7.43  283.59",
    "Intangible  Assets  under",
    "Development  290.65  48.87  241.78  494.74",
    "Total  2980.76  2562.26  418.50  16.33",
    "Financial  Assets",
    "Investments  486.28  484.81  1.47  0.30",
    "Loans  53.39  31.57  21.82  69.12",
    "Deferred  tax assets  (net)  851.85  1,001.42  (149.57)  (14.94)",
    "Other  Non - Current  Assets  146.30  236.60  (90.30)  (38.17)",
    "Total  4,518.58  4,316.66  201.92  4.68",
    "Current  assets",
    "Inventories  5,096.68  5,249.57  (152.89)  (2.91)",
    "Investments  340.00  - -",
    "Trade  receivables  730.09  217.93  512.16  235.01",
    "Cash  and  Cash  equivalents  252.33  47.60  204.73  430.11",
    "Other  financial  Assets  232.33  264.11  (31.78)  (12.03)",
    "Other  current  assets  502.43  384.37  118.06  30.72",
    "Total  7,153.84  6,166.58  987.26  16.01",
    "TOTAL  11672.42  10,483.24  1,189.18  11.34",
    "Interpretation:",
    " Long term borrowings have decreased. The owner’s equity has improved by 10%. This",
    "indicates that the company need not depend on the external lenders thus showing a great",
    "financial  strength.",
    "62   Current  assets  show  an increase  of 16%.  Whereas,  current  liabilities  show  an increase  of",
    "only  10.12%.  It means that the  liquidity  position of the  concern shows  an improvement.",
    "Table 5.3: Comparative Balance Sheet of Reliance Retail Limited (RRL) for the year",
    "2017 &  2018",
    "As at March",
    "2018  (in crore)  As at March",
    "2017  (in crore)  Absolute Change",
    "(Increase/Decrease)  Percentage change",
    "(Increase/Decrease)",
    "EQUITY  AND  LIABILITIES  A B A – B = C  C/B ×100",
    "Equity",
    "Equity  Share  capital  4,989.54  4,989.54  0.00  0.00",
    "Other  Equity  4,076.92  1,830.03  2,246.89  122.78",
    "Total  9,066.46  6,819.57  2,246.89  32.95",
    "Non -current  liabilities",
    "Long -term  Borrowings  - 0.22  - -",
    "Long -term  Provisions  21.46  19.85  1.61  8.11",
    "Total  21.46  20.07  1.39  6.93",
    "Current  liabilities",
    "Short -term  borrowings  3,447.80  27.48  3,420.32  12446.58",
    "Trade  payables  8,231.87  3,926.68  4,305.19  109.64",
    "Others  2,811.94  287.67  2,524.27  877.49",
    "Other  current  liabilities  1.43  5.87  (4.44)  (75.64)",
    "Short -term  provisions  503.14  585.08  (81.94)  (14.00)",
    "Total  14,996.49  4,832.78  10,163.71  210.31",
    "TOTAL  24,084.41  11,672.42  12,411.99  106.34",
    "ASSETS",
    "Non -current  Assets",
    "Property.  Plant  and  Equipment  3,100.61  2,245.88  854.73  38.06",
    "Capital  work -in-progress  2,007.78  434.18  1,573.60  362.43",
    "Intangible  assets  58.34  10.05  48.29  480.50",
    "Intangible  Assets  under",
    "Development  2,138.58  290.65  1,847.93  635.79",
    "Total  7,305.31  2,980.76  4,324.55  145.08",
    "Financial  Assets",
    "Investments  534.41  486.28  48.13  9.90",
    "Loans  462.47  53.39  409.08  766.21",
    "Deferred  tax assets  (net)  620.38  851.85  (231.47)  (27.17)",
    "Other  Non - Current  Assets  209.39  146.30  63.09  43.12",
    "Total  9,131.96  4,518.58  4,613.38  102.10",
    "Current  assets",
    "Inventories  10,465.28  5,096.68  5,368.60  105.34",
    "Investments  - 340.00  - -",
    "Trade  receivables  2,215.72  730.09  1,485.63  203.49",
    "Cash  and  Cash  equivalents  156.12  252.31  (96.19)  (38.12)",
    "Other  financial  Assets  267.12  232.33  34.79  14.97",
    "Other  current  assets  1,848.12  502.43  1,345.69  267.84",
    "Total  14,952.45  7,153.84  7,798.61  109.01",
    "TOTAL  24,084.41  11,672.42  12,411.99  106.34",
    "Interpretation: Current liabilities have increased by 210% whereas, the current assets show an",
    "increase of 109% only. Though the percentage increase of current asset is low, the ratios of",
    "current  assets to current liabilities  of both periods are  satisfactory.",
    "63  Table 5.4: Comparative Balance Sheet of Reliance Retail Limited (RRL) for the year",
    "2018 &  2019",
    "As at March",
    "2019  (in crore)  As at March",
    "2018  (in crore)  Absolute Change",
    "(Increase/Decrease)  Percentage change",
    "(Increase/Decrease)",
    "EQUITY  AND  LIABILITIES  A B A – B = C  C/B ×100",
    "Equity",
    "Equity  Share  capital  4,989.54  4,989.54  0 -",
    "Other  Equity  7,597.87  4,076.92  3,520.95  86.36",
    "Total  12,587.41  9,066.46  3,520.95  38.83",
    "Non -current  liabilities",
    "Deferred  Tax  Liabilities  (net)  22.85  - - -",
    "Long -term  Provisions  26.68  21.46  5.22  24.32",
    "Total  49.53  21.46  28.07  130.80",
    "Current  liabilities",
    "Short -term  borrowings  12,800.56  3,447.80  9,352.76  271.27",
    "Trade  payables  due  to :",
    "Micro  and  small  Enterprise  13.03  24.77  (11.74)  (47.40)",
    "Other  than  MSE  4,109.07  8,207.10  (4,098.03)  (49.93)",
    "Other  financial  liabilities  4,142.12  2,811.94  1,330.18  47.30",
    "Short -term  provisions  1.99  1.43  0.56  39.16",
    "Other  current  liabilities  673.84  503.45  170.39  33.84",
    "Total  21,740.61  14,996.49  6,744.12  44.97",
    "TOTAL  34,377.55  24,084.41  10,293.14  42.74",
    "ASSETS",
    "Non -current  Assets",
    "Property.  Plant  and  Equipment  6,067.50  3,100.61  2,966.89  95.69",
    "Capital  work -in-progress  2,533.09  2,007.78  525.31  26.16",
    "Intangible  assets  1,091.03  58.34  1,032.69  1,770.12",
    "Intangible  Assets  under",
    "Development  1,788.99  2,138.58  (349.59)  (16.35)",
    "Total  11,480.61  7,305.31  4,175.30  57.15",
    "Financial  Assets",
    "Investments  573.24  534.41  38.83  7.27",
    "Loans  1,122.14  462.47  659.67  142.64",
    "Deferred  tax assets  (net)  - 620.38  - -",
    "Other  Non - Current  Assets  145.29  209.39  (64.10)  (30.61)",
    "Total  13,321.28  9,131.96  4,189.32  45.88",
    "Current  assets",
    "Inventories  11,291.83  10,465.28  826.55  7.90",
    "Investments  3,002.89  - - -",
    "Trade  receivables  4,330.17  2,215.72  2,114.45  95.43",
    "Cash  and  Cash  equivalents  329.69  156.12  173.57  111.18",
    "Other  financial  Assets  381.30  267.12  114.18  42.74",
    "Other  current  assets  1,720.39  1,848.12  (127.73)  (6.91)",
    "Total  21,056.27  14,952.45  6,103.82  40.82",
    "TOTAL  34,377.55  24,084.41  10,293.14  42.74",
    "Interpretation:",
    " Property,  Plant  and  machinery  increased  by 95%.  This  was  on account  of the huge  addition",
    "made  to the  plant and  machinery  by the company  in the  given  accounting  periods.",
    " Such  additional  machinery  leads  to an incredible  improvement  in the revenue  of the",
    "company  during  the year.",
    "64  Table 5.5: Comparative Balance Sheet of Reliance Retail Limited (RRL) for the year",
    "2019 &  2020",
    "As at March",
    "2020  (in crore)  As at March",
    "2019  (in crore)  Absolute Change",
    "(Increase/Decrease)  Percentage",
    "change",
    "(Increase/Decr",
    "ease)",
    "EQUITY  AND  LIABILITIES  A B A – B = C  C/B ×100",
    "Equity",
    "Equity  Share  capital  4,990.40  4,989.54  0.86  0.02",
    "Other  Equity  13,124.78  7,597.87  5,526.91  72.74",
    "Total  18,115.18  12,587.41  5,527.77  43.92",
    "Non -current  liabilities",
    "Deferred  Tax  Liabilities  (net)  38.10  22.85  15.25  66.74",
    "Long -term  Provisions  908.20  26.68  881.52  3304.05",
    "Total  946.30  49.53  896.77  1810.56",
    "Current  liabilities",
    "Short -term  borrowings  4,665.74  12,800.56  (8,134.82)  (63.55)",
    "Trade  payables  due  to :",
    "Micro  and  small  Enterprise  33.97  13.03  20.94  160.71",
    "Other  than  MSE  5,642.87  4,109.07  1,533.80  37.33",
    "Other  financial  liabilities  5,109.43  4,142.12  967.31  23.35",
    "Short -term  provisions  3.09  1.99  1.10  55.28",
    "Other  current  liabilities  1,049.33  673.84  375.49  55.72",
    "Total  16,504.43  21,740.61  (5,236.18)  (24.08)",
    "TOTAL  35,565.91  34,377.55  1,188.36  3.46",
    "ASSETS",
    "Non -current  Assets",
    "Property.  Plant  and  Equipment  7,185.34  6,067.50  1,117.84  18.42",
    "Capital  work -in-progress  6,068.34  2,533.09  3,535.25  139.56",
    "Intangible  assets  981.80  1,091.03  (109.23)  (10.01)",
    "Intangible  Assets  under",
    "Development  2,752.74  1,788.99  963.75  53.87",
    "Total  16,988.22  11,480.61  5,507.61  47.97",
    "Financial  Assets",
    "Investments  578.24  573.24  5 0.87",
    "Loans  2,436.10  1,122.14  1,313.96  117.09",
    "Deferred  tax assets  (net)  - - - -",
    "Other  Non - Current  Assets  222.91  145.29  77.62  53.42",
    "Total  20,225.47  13,321.28  6,904.19  51.83",
    "Current  assets",
    "Inventories  9,348.16  11,291.83  (1,943.67)  (17.21)",
    "Investments  - 3,002.89  - -",
    "Trade  receivables  2489.10  4,330.17  (1,841.07)  (42.52)",
    "Cash  and  Cash  equivalents  334.50  329.69  4.81  1.46",
    "Other  financial  Assets  1,508.67  381.30  1,127.37  295.66",
    "Other  current  assets  1,660.01  1,720.39  (60.38)  (3.51)",
    "Total  15,340.44  21,056.27  (5,715.83)  (27.15)",
    "TOTAL  35,565.91  34,377.55  1,188.36  3.46",
    "Interpretation:",
    " It is evident  that  current  liabilities  have  decreased  by 24.08%  and  the current  assets  also",
    "decreased  by 27.5%.  This  indicates  that  the company  might  finding  challenging  to meet  its",
    "65  short  term  obligation.  But  since  it’s  a very  small  proportion  it doesnot  have  a negative",
    "impact on the  liquidity  position.",
    " COMMON -SIZE  BALANCE  SHEET  ANALYSIS  FOR  THE  PERIOD  OF  5 YEARS",
    "(2015 -16 to-2019 -2020)",
    "This  study  analyse common size  statement  for the period  of 5 years.",
    "Table 5.6: Common size Balance Sheet of Reliance Retail Limited (RRL) for the year",
    "2015 &  2016",
    "Absolute  Amounts",
    "(in crore)  Percentage  change  to",
    "Balance  Sheet  total",
    "2015  2016  2015  2016",
    "EQUITY  AND  LIABILITIES",
    "Shareholders’  funds",
    "Share  capital  4,989.54  4,989.54  58.25  50.26",
    "Reserves  and  surplus  198.82  505.36  2.32  5.09",
    "Total  5188.36  5494.9  60.57  55.35",
    "Non -current  liabilities",
    "Long -term  borrowings  3.37  76.03  0.04  0.77",
    "Other  long -term  liabilities  75.00  - 0.88  -",
    "Long -term  provisions  11.95  14.62  0.14  0.15",
    "Total  90.32  90.65  1.05  0.91",
    "Current  liabilities",
    "Short -term  borrowings  1,670.16  1,086.89  19.50  10.95",
    "Trade  payables",
    "Micro  and  Small  Enterprises  4.51  7.32  0.05  0.07",
    "Other  1,194.91  2,761.08  13.95  27.81",
    "Other  current  liabilities  416.22  484.68  4.86  4.88",
    "Short -term  provisions  1.09  1.88  0.01  0.02",
    "Total  3286.89  4341.85  38.37  43.74",
    "TOTAL  8565.57  9927.40  100  100",
    "ASSETS",
    "Non -current  Assets",
    "Fixed  Assets",
    "Tangible  assets  2,053.83  2,026.87  23.98  20.42",
    "Intangible  assets  0.36  2.62  0.00  0.03",
    "Capital  work -in-progress",
    "Intangible  Assets  under",
    "Development  423.16",
    "- 483.90",
    "48.87  4.94",
    "- 4.87",
    "0.49",
    "Total  2,477.35  2,562.26  28.92  25.81",
    "Non -current  investments  470.10  484.81  5.49  4.88",
    "Deferred  tax assets  (net)  563.33  445.58  6.58  4.49",
    "Long -term  loans  and  advances  448.62  491.83  5.24  4.95",
    "Total  3959.40  3,984.48  46.22  40.14",
    "Current  assets",
    "Inventories  3,881.73  5,251.22  45.32  52.90",
    "Trade  receivables  210.81  217.93  2.46  2.20",
    "Cash  and bank  balances  150.52  47.60  1.76  0.48",
    "Short -term  loans  and advances  363.03  426.09  4.24  4.29",
    "Other  current  assets  0.08  0.08  0 0",
    "Total  4606.17  5942.92  53.78  59.86",
    "TOTAL  8565.57  9927.40  100  100",
    "66  Interpretation:",
    "For instance, there is a relative decrease in the share capital from 2015 to 2016. While the",
    "current  liabilities  show  an uptrend  during  the same  period.  Shareholders  fund  in relation  to total",
    "equities and liabilities are too high in 2015 & 2016. Similarly, current assets show a greater",
    "percentage  in relation to the total assets as the base value.",
    "Table 5.7: Common -size Balance Sheet of Reliance Retail Limited (RRL) for the year",
    "2016 &  2017",
    "Absolute Amounts",
    "(in crore)  Percentage  change  to",
    "Balance  Sheet  total",
    "2015  2016  2015  2016",
    "EQUITY  AND  LIABILITIES",
    "Equity",
    "Equity  Share  capital  4,989.54  4,989.54  47.60  42.75",
    "Other  Equity  1,134.51  1,830.03  10.82  15.68",
    "Total  6124.05  6,819.57  58.42  58.42",
    "Non -current  liabilities",
    "Long -term  Borrowings  1.03  0.22  0.01  0.00",
    "Long -term  Provisions  14.62  19.85  0.14  0.17",
    "Total  15.65  20.07  0.15  0.17",
    "Current  liabilities",
    "Short -term  borrowings  1,086.89  27.48  10.37  0.24",
    "Trade  payables  2,711.25  3,926.86  25.86  33.64",
    "Others  119.32  287.67  1.14  2.46",
    "Other  current  liabilities  424.20  585.08  4.05  5.01",
    "Short -term  provisions  1.88  5.87  0.02  0.05",
    "Total  4,343.54  4,832.78  41.43  41.40",
    "TOTAL  10,483.24  11,672.42  100  100",
    "ASSETS",
    "Non -current  Assets",
    "Property.  Plant  and  Equipment  2,026.87  2,245.88  19.33  19.24",
    "Capital  work -in-progress  483.90  434.18  4.62  3.72",
    "Intangible  assets  2.62  10.05  0.02  0.09",
    "Intangible  Assets  under",
    "Development  48.87  290.65  0.47  2.49",
    "Total  2562.26  2980.76  24.44  25.54",
    "Financial  Assets",
    "Investments  484.81  486.28  4.62  4.17",
    "Loans  31.57  53.39  0.30  0.46",
    "Deferred  tax assets  (net)  1,001.42  851.85  9.55  7.30",
    "Other  Non - Current  Assets  236.60  146.30  2.26  1.25",
    "Total  4,316.66  4,518.58  41.18  38.71",
    "Current  assets",
    "Inventories  5,249.57  5,096.68  50.08  43.66",
    "Investments  - 340.00  - 2.91",
    "Trade  receivables  217.93  730.09  2.08  6.25",
    "Cash  and  Cash  equivalents  47.60  252.33  0.45  2.16",
    "Other  financial  Assets  264.11  232.33  2.52  1.99",
    "Other  current  assets  384.37  502.43  3.67  4.30",
    "Total  6,166.58  7,153.84  58.82  61.29",
    "TOTAL  10,483.24  11672.42  100  100",
    "67  Interpretation:",
    "Current assets as a percentage of total assets increased substantially from 58.82% to 61.29%.",
    "Investments increased to 2.91% in 2017, whereas Inventories shows a decrease of 6.42%.",
    "Equity/  Shareholders fund  remained same  for both  the year",
    "Table 5.8: Commo n-size Balance Sheet of Reliance Retail Limited (RRL) for the year",
    "2017 &  2018",
    "Absolute Amounts",
    "(In crore)  Percentage change",
    "(In crore)",
    "2017  2018  2017  2018",
    "EQUITY  AND  LIABILITIES",
    "Equity",
    "Equity  Share  capital  4,989.54  4,989.54  42.75  20.72",
    "Other  Equity  1,830.03  4,076.92  15.68  16.93",
    "Total  6,819.57  9,066.46  58.42  37.64",
    "Non -current  liabilities",
    "Long -term  Borrowings  0.22  - 0.00  -",
    "Long -term  Provisions  19.85  21.46  0.17  0.09",
    "Total  20.07  21.46  0.17  0.09",
    "Current  liabilities",
    "Short -term  borrowings  27.48  3,447.80  0.24  14.32",
    "Trade  payables  3,926.68  8,231.87  33.64  34.18",
    "Others  287.67  2,811.94  2.46  11.68",
    "Other  current  liabilities  5.87  1.43  0.05  0.01",
    "Short -term  provisions  585.08  503.14  5.01  2.09",
    "Total  4,832.78  14,996.49  41.40  62.27",
    "TOTAL  11,672.42  24,084.41  100  100",
    "ASSETS",
    "Non -current  Assets",
    "Property.  Plant  and  Equipment  2,245.88  3,100.61  19.24  12.87",
    "Capital  work -in-progress  434.18  2,007.78  3.72  8.34",
    "Intangible  assets  10.05  58.34  0.09  0.24",
    "Intangible  Assets  under",
    "Development  290.65  2,138.58  2.49  8.88",
    "Total  2,980.76  7,305.31  25.54  30.33",
    "Financial  Assets",
    "Investments  486.28  534.41  4.17",
    "2.22",
    "Loans  53.39  462.47  0.46  1.92",
    "Deferred  tax assets  (net)  851.85  620.38  7.30  2.58",
    "Other  Non - Current  Assets  146.30  209.39  1.25  0.87",
    "Total  4,518.58  9,131.96  38.71  37.92",
    "Current  assets",
    "Inventories  5,096.68  10,465.28  43.66  43.45",
    "Investments  340.00  - 2.91  -",
    "Trade  receivables  730.09  2,215.72  6.25  9.20",
    "Cash  and  Cash  equivalents  252.31  156.12  2.16  0.65",
    "Other  financial  Assets  232.33  267.12  1.99  1.11",
    "Other  current  assets  502.43  1,848.12  4.30  7.67",
    "Total  7,153.84  14,952.45  61.29  62.08",
    "TOTAL  11,672.42  24,084.41  100  100",
    "Interpretation:",
    "68   Equity  have  decreased  from  42.25%  to 20.72%  in 2018.  In 2017  equity  remained  the major",
    "portion  of total  base  value,  whereas  in 2018,  current  liabilities  share  become  high  in relation",
    "to the total base  value of Equities  and  Liabilities.",
    " Investments show a decreased trend in the year of 2018. Current assets form a major part",
    "in relation to total assets in 2017 &  2018.",
    "Table 5.9: Common -size Balance Sheet of Reliance Retail Limited (RRL) for the year",
    "2018 &  2019",
    "Absolute Amount",
    "(in crore)  Percentage change",
    "(in crore)",
    "2018  2019  2018  2019",
    "EQUITY  AND  LIABILITIES",
    "Equity",
    "Equity  Share  capital  4,989.54  4,989.54  20.72  14.51",
    "Other  Equity  4,076.92  7,597.87  16.93  22.10",
    "Total  9,066.46  12,587.41  37.64  36.62",
    "Non -current  liabilities",
    "Deferred  Tax  Liabilities  (net)  - 22.85  - 0.07",
    "Long -term  Provisions  21.46  26.68  0.09  0.08",
    "Total  21.46  49.53  0.09  0.14",
    "Current  liabilities",
    "Short -term  borrowings  3,447.80  12,800.56  14.32  37.24",
    "Trade  payables  due  to :",
    "Micro  and  small  Enterprise  24.77  13.03  0.10  0.04",
    "Other  than  MSE  8,207.10  4,109.07  34.08  11.95",
    "Other  financial  liabilities  2,811.94  4,142.12  11.68  12.05",
    "Short -term  provisions  1.43  1.99  0.01  0.01",
    "Other  current  liabilities  503.45  673.84  2.09  1.96",
    "Total  14,996.49  21,740.61  62.27  63.24",
    "TOTAL  24,084.41  34,377.55  100  100",
    "ASSETS",
    "Non -current  Assets",
    "Property.  Plant  and  Equipment  3,100.61  6,067.50  12.87  17.65",
    "Capital  work -in-progress  2,007.78  2,533.09  8.34  7.37",
    "Intangible  assets  58.34  1,091.03  0.24  3.17",
    "Intangible  Assets  under",
    "Development  2,138.58  1,788.99  8.88  5.20",
    "Total  7,305.31  11,480.61  30.33  33.40",
    "Financial  Assets",
    "Investments  534.41  573.24  2.22",
    "1.67",
    "Loans  462.47  1,122.14  1.92  3.26",
    "Deferred  tax assets  (net)  620.38  - 2.58  -",
    "Other  Non - Current  Assets  209.39  145.29  0.87  0.42",
    "Total  9,131.96  13,321.28  37.92  38.75",
    "Current  assets",
    "Inventories  10,465.28  11,291.83  43.45  32.85",
    "Investments  - 3,002.89  - 8.74",
    "Trade  receivables  2,215.72  4,330.17  9.20  12.60",
    "Cash  and  Cash  equivalents  156.12  329.69  0.65  0.96",
    "Other  financial  Assets  267.12  381.30  1.11  1.11",
    "Other  current  assets  1,848.12  1,720.39  7.67  5.00",
    "Total  14,952.45  21,056.27  62.08  61.25",
    "TOTAL  24,084.41  34,377.55  100  100",
    "69  Interpretation: Equity and liabilities decreased in a very small proportion from 2018 to 2019.",
    "Non -current liabilities show a very less proportion in relation to total base value of Balance",
    "Sheet. Whereas, in asset side Non -current assets have small proportion in relation total assets",
    "value  than current assets.",
    "Table  5.10:  Common -size  Balance  Sheet  of Reliance  Retail  Limited  (RRL)  for  the  year",
    "2019 &  2020",
    "Absolute Amount",
    "(in crore)  Percentage change",
    "(in crore)",
    "2019  2020  2019  2020",
    "EQUITY  AND  LIABILITIES",
    "Equity",
    "Equity  Share  capital  4,989.54  4,990.40  14.51  14.03",
    "Other  Equity  7,597.87  13,124.78  22.10  36.90",
    "Total  12,587.41  18,115.18  36.62  50.93",
    "Non -current  liabilities",
    "Deferred  Tax  Liabilities  (net)  22.85  38.10  0.07  0.11",
    "Long -term  Provisions  26.68  908.20  0.08  2.55",
    "Total  49.53  946.30  0.14  2.66",
    "Current  liabilities",
    "Short -term  borrowings  12,800.56  4,665.74  37.24  13.12",
    "Trade  payables  due  to :",
    "Micro  and  small  Enterprise  13.03  33.97  0.04  0.10",
    "Other  than  MSE  4,109.07  5,642.87  11.95  15.87",
    "Other  financial  liabilities  4,142.12  5,109.43  12.05  14.37",
    "Short -term  provisions  1.99  3.09  0.01  0.01",
    "Other  current  liabilities  673.84  1,049.33  1.96  2.95",
    "Total  21,740.61  16,504.43  63.24  46.41",
    "TOTAL  34,377.55  35,565.91  100  100",
    "ASSETS",
    "Non -current  Assets",
    "Property.  Plant  and  Equipment  6,067.50  7,185.34  17.65  20.20",
    "Capital  work -in-progress  2,533.09  6,068.34  7.37  17.06",
    "Intangible  assets  1,091.03  981.80  3.17  2.76",
    "Intangible  Assets  under",
    "Development  1,788.99  2,752.74  5.20  7.74",
    "Total  11,480.61  16,988.22  33.40  47.77",
    "Financial  Assets",
    "Investments  573.24  578.24  1.67  1.63",
    "Loans  1,122.14  2,436.10  3.26  6.85",
    "Deferred  tax assets  (net)  - - - -",
    "Other  Non - Current  Assets  145.29  222.91  0.42  0.63",
    "Total  13,321.28  20,225.47  38.75  56.87",
    "Current  assets",
    "Inventories  11,291.83  9,348.16  32.85  26.28",
    "Investments  3,002.89  - 8.74  -",
    "Trade  receivables  4,330.17  2489.10  12.60  7.00",
    "Cash  and  Cash  equivalents  329.69  334.50  0.96  0.94",
    "Other  financial  Assets  381.30  1,508.67  1.11  4.24",
    "Other  current  assets  1,720.39  1,660.01  5.00  4.67",
    "Total  21,056.27  15,340.44  61.25  43.13",
    "TOTAL  34,377.55  35,565.91  100  100",
    "70  Interpretation:",
    " Shareholders fund showed an increase from 36.62% in 2019 to 50.93% in 2020.Thus, it",
    "forms a high relation with total base value of liabilities in 2020. Current liabilities show a",
    "decreased  trend in relation with total va lue in 2020.",
    " Non -current asset shows an upper trend in 2020. In 2019, Current assets were in high",
    "relation  to total  assets  value  whereas, it  changed  to non -current  assets  in the  year  2020.",
    " TREND  ANALYSIS  FOR  THE  PERIOD  OF  FIVE  YEARS (2015 -16 to 2019 -20)",
    " ESTIMATING  NET  PROFIT  FOR  THE  PERIOD  OF  NEXT  FIVE  YEARS  (2020 -",
    "21 to 2024 -25",
    "Table  No 5.11:  Table  calculating trend analysis  for  Net Profit",
    "YEAR  X Y XY X2",
    "2015 -16 1 306.54  306.54  1",
    "2016 -17 2 442.6  885.2  4",
    "2017 -18 3 1246.89  3740.67  9",
    "2018 -19 4 3138.26  12553.04  16",
    "2019 -20 5 5539.79  27698.95  25",
    "TOTAL  15 10674.08  45184.4  55",
    "Y= a + bX",
    "Where,",
    "b = N×∑XY -∑X×∑Y",
    "N×∑X2 - ∑(X)2",
    "b = 5×45184.4−15×10674.08",
    "5×55−15  ×15",
    "b = 225922−160111.2  = 1316.21",
    "275−225",
    "a = ∑ Y−b(∑ X)",
    "N",
    "a = 10674.08−1316.21(15)",
    "5",
    "a= 10674.08−19743.15  = -1813.81",
    "5",
    "Estimated  Net Profit  for  the year  2020 -21 to 2024 -2025",
    "Y = a + bx",
    "For  the year  2020 -21,  Y = -1813.81  + 1316.21(6) = 6083.45",
    "71  For  the year  2021 -22, Y =  -1813.81 +  1316.21(7) =  7399.66",
    "For  the year  2022 -23,  Y =  -1813.81 +  1316.21(8) =  8715.87",
    "For  the year 2023 -24,  Y =  -1813.81  + 1316.21(9)  = 10032.08",
    "For  the year 2024 -25,  Y =  -1813.81  + 1316.21(10) =  11348.29",
    "Table  No 5.12: Table  showing the  trend for  Estimated  Profit  from  2020 -21 to 2024 -25",
    "YEAR  ESTIMATED  PROFIT",
    "2020 -21 6083.45",
    "2021 -22 7399.66",
    "2022 -23 8715.87",
    "2023 -24 10032.08",
    "2024 -25 11348.29",
    "Graph  No 5.1: Graph showing  estimated  profit  for  the  years  2020 -21 to 2024 -25",
    "INTERPRETATION:",
    "On the basis  of last  5 years  (2015 -16 to 2019 -20)  profit  position,  we can  predict  the profit  trend",
    "for the future years (2020 -21 to 2024 -25). Here this trend shows out a positive growth for the",
    "company in their future period of time. The estimated profit for the next five years is moving",
    "with  a CAGR  of 13.28%.  This  positive  net profit  indicates  the firm  is in a good  position  and  is",
    "earning  more  than its competitors.",
    "72",
    " ESTIMATING  NET  SALES  FOR  THE  PERIOD  OF  NEXT  YEAR  (2020 -21 to 2024 -",
    "25)",
    "Table  no 5.13:  Table  showing  Net Sales  from  2015 -16 to  2019 -20",
    "YEAR  X Y XY X2",
    "2015 -16 1 18399.22  18399.22  1",
    "2016 -17 2 26437.68  52875.36  4",
    "2017 -18 3 51456.17  154368.5  9",
    "2018 -19 4 101946.52  407786.1  16",
    "2019 -20 5 130367.36  651836.8  25",
    "TOTAL  15 328606.95  1285266  55",
    "Y=  a + bX",
    "Where,",
    "b = N×∑XY -∑X×∑Y",
    "N×∑X2 - ∑(X)2",
    "b = 5×1285266−15×328606.95",
    "5×55−15  ×15",
    "b = 6426330−4929104.25  = 29944.52",
    "275−225",
    "a = ∑ Y−b(∑ X)",
    "N",
    "a = 328606.95−29944.52(15)",
    "5",
    "a= 328606.95−449167.8  = -24112.17",
    "5",
    "Estimated  Net  Sales  for the  year  2020 -21 to 2024 -2025",
    "Y =  a + bx",
    "For  the year  2020 -21, Y =  -24112.7  + 29944.52(6)  =155554.42",
    "For  the year  2021 -22, Y =  -24112.7  + 29944.52(7)  =185498.94",
    "For  the year 2022 -23, Y = -24112.7 +  29944.52(8)  =215443.46",
    "For  the year  2023 -24, Y =  -24112.7  + 29944.52(9)  =245387.98",
    "For  the year  2024 -25, Y =  -24112.7  + 29944.52(10)  =275332.5",
    "73",
    "Table No 5.14: Table showing estimated net sales for the period of next five years",
    "(2020 -21 to  2024 -25)",
    "YEAR  ESTIMATED  NET  SALES",
    "2020 -21 155554.42",
    "2021 -22 185498.94",
    "2022 -23 215443.46",
    "2023 -24 245387.98",
    "2024 -25 275332.5",
    "Graph No 5.2: Graph showing estimated net sales for the period of next five",
    "years  (2020 -21 to 2024 -25)",
    "INTERPRETATION:",
    "Estimated Net sales shows a positive trend for the next 5 years (2020 -21 to 2024 -25)",
    "from the analysis of sales over the period of past five years (2015 -16 to 2019 -21). It",
    "indicates  good sign  of financial  performance  and business  profitability.",
    "74   RATIO  ANALYSIS FOR  THE  PERIOD  OF  5 YEARS  (2015 -16 to 2019 -20)",
    " LIQUIDITY  RATIO",
    " Current  Ratio",
    "Current  Ratio  = Current  Assets",
    "Current  Liabilities",
    "Table  No 5.15:  Table  Showing Current  Ratio  for  the  5 years  (2016  – 2020)",
    "YEAR  CURRENT  ASSETS",
    "(in crores)  CURRENT  LIABILITIES",
    "(in crores)  CURRENT",
    "RATIO",
    "2015 -16 5942.92  4341.85  1.37",
    "2016 -17 7153.84  4832.78  1.48",
    "2017 -18 14952.45  14996.49  1.00",
    "2018 -19 21056.27  21740.61  0.97",
    "2019 -20 15340.44  16504.43  0.93",
    "Graph  No 5.3: Graph  Showing  Current  Ratio  analysis  (2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "The current ratio of a firm measures its short -term solvency, i.e., its ability to meet short term",
    "obligations.  An ideal  current  ratio  should  be 2:1.  A high  ratio  indicates  sound  solvency  position",
    "and a low ratio indicates inadequate working capital. Here,  it is evident that in the year 2015 -",
    "16 & 2016 -17 the ratio satisfactory compared to the ideal ratio. In the year 2017 -18, current",
    "ratio became equal to current liabilities not leaving a comfortable margin of working capital",
    "after  paying  off the current  liabilities.  In the year  2018 -19 & 2019 -20,  current  ratio  again  comes",
    "down leaving inadequate safety to creditors. From this, it is clear that short -term financial",
    "position of  the company  shows  a decreasing  trend.",
    "75   Quick  Ratio ‘Acid Test  Ratio’  or ‘Liquidity  Ratio’ .",
    "Quick  Ratio  = Quick  or Liquid  Assets",
    "Current  Liabilities",
    "Table  No 5.16: Table  Showing  Quick  Ratio  for  the  5 years  (2016 -2020)",
    "YEAR  QUICK  ASSETS",
    "(in crores)  CURRENT  LIABILITIES",
    "(in crores)  QUICK/LIQUIDITY",
    "RATIO",
    "2015 -16 691.7  4341.85  0.16",
    "2016 -17 2057.16  4832.78  0.43",
    "2017 -18 4487.17  14996.49  0.30",
    "2018 -19 9764.44  21740.61  0.45",
    "2019 -20 5992.28  16504.43  0.36",
    "Graph  No 5.4:  Graph showing  Quick/  Liquidity  Ratio  for  the  5 years",
    "(2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "A quick/liquidity/acid -test ratio of 1:1 is considered satisfactory as a firm can easily meet",
    "all its current  liabilities.  If the ratio  is less  than  1:1  then  the financial  position  of the concern",
    "shall be deemed to be unsound. On the other hand, if the rat io is more than 1:1, then the",
    "financial position of the concern is sound and good. Quick ratio is the true test of business",
    "solvency.  A higher  ratio  indicates  sound  financial position  and  vice -versa.  From  this  table,",
    "it is evident that quick ratio is less than 1, indicating company might find it challenging to",
    "meet  its short term obligations,  especially  in the  year  2015 -16 & 2017 -18.",
    "76   Cash  Ratio  or Absolute  Ratio",
    "Cash  or Absolute  Ratio  = Cash+Marketable  Securities",
    "Current  Liabilities",
    "Table  5.17:  Table  showing cash/  absolute  ratio  for  5 years",
    "YEAR  CASH+MARKETABLE",
    "SECURITIES",
    "(in crores)  CURRENT  LIABILITIES",
    "(in crores)  CASH/ABSOLUTE",
    "RATO",
    "2015 -16 473.77  4341.85  0.11",
    "2016 -17 1327.07  4832.78  0.27",
    "2017 -18 4487.17  14996.49  0.30",
    "2018 -19 5434.27  21740.61  0.25",
    "2019 -20 3503.18  16504.43  0.21",
    "Graph  No 5.5: Graph  showing  Cash/  Absolute  Ratio",
    "INTERPRETATION:",
    "An absolute ratio of 0.5:1 is considered ideal. This ratio ensures most liquidity of the business",
    "organization.  Here,  the ratio  is comparatively  less  than  0.5,  so it represents  the company’s  day -",
    "to-day  cash  management  is in a very poor  light.  During  the year  2017 -18, the ratio  is",
    "considerable more compared to other years, so it represents enough funds within the type of",
    "cash  in order to  fulfill its short -term obligations in time.",
    "77   LEVERAGE  RATIOS OR  LONG  TERM  FINANCIAL  RATIOS",
    " Debt -equity  (D/E)  Ratio  (Ratio  of total  debt  to shareholders’  fund)",
    "Debt - equity  Ratio  = Debt",
    "Equity  OR   Total Debt",
    "Shareholders  fund  or Networth",
    "Table No 5.18: Table showing Debt -Equity Equity ratio for the years",
    "(2015 -16 to 2019 -20)",
    "YEAR  DEBT  EQUITY  DEBT/EQUITY  RATIO",
    "2015 -16 1162.92  5494.9  0.21",
    "2016 -17 27.7  6819.57  0.00",
    "2017 -18 3447.8  9066.46  0.38",
    "2018 -19 12800.56  12587.41  1.02",
    "2019 -20 4665.74  18115.18  0.26",
    "Graph No 5.6: Graph showing Debt -Equity ratio for the years",
    "(2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "Debt -equity ratio which is low, 0.00,0.01, would suggest that the company is not fully",
    "utilizing  the cheaper  source  of finance  (i.e  debt),  whereas  a debt -to-equity  ratio  that  is high,",
    "would indicate that the company is facing a very high financial risk. Companies generally",
    "aim  to maintain a debt -equity  ratio between the two extremes.",
    "Here, For Reliance Retail it suits low debt -to equity ratio as it is operating under volatile",
    "and  unpredictable  business  environments  as they  cannot  afford  financial  commitments  that",
    "78  they cannot meet in case of sudden downturns in economic activity. So, here, low debt -",
    "equity ratio implies a higher claim of owners than that of the long term lenders and is",
    "favorable  to the  firm.",
    " Proprietary  Ratio",
    "Proprietary  Ratio  = Shareholders  fund",
    "Total  assets",
    "Table  No 5.19:  Table  showing  Proprietary ratio  for  the  years  (2015 -16 to 2019 -20)",
    "YEAR  SHAREHOLDERS  FUND",
    "(in crores)  TOTAL  ASSETS",
    "(in crores)  PROPRIETARY",
    "RATIO",
    "2015 -16 5494.9  9927.4  0.55",
    "2016 -17 6819.57  11672.42  0.58",
    "2017 -18 9066.46  24084.41  0.38",
    "2018 -19 12587.41  34377.55  0.37",
    "2019 -20 18115.18  35565.91  0.51",
    "Graph  No 5.7: Graph  showing  Proprietary ratio  for  the  years  (2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "This ratio shows the financial strength of the company. It helps the lenders to find out the",
    "proportion of shareholders’ fund to the total assets. Higher ratio indi cates a secured",
    "position to lenders and a low ratio indicates more risk to lenders. It indicates the long",
    "term solvency  of the firm.",
    "79",
    " Solvency  ratio",
    "Solvency  Ratio  = Total  Liabilities  to outsiders",
    "Total  Assets",
    "Table  No 5.20:  Table  showing  Solvency ratio  for  the  years  (2015 -16 to 2019 -20)",
    "YEAR  TOTAL  LIABILITIES(in  crores)  TOTAL  ASSETS  (in crores)  SOLVENCY  RATIO",
    "2015 -16 10018.05  9927.4  1.01",
    "2016 -17 4852.85  11672.42  0.42",
    "2017 -18 15017.95  24084.41  0.62",
    "2018 -19 21790.14  34377.55  0.63",
    "2019 -20 17450.73  35565.91  0.49",
    "Graph  No 5.8: Graph  showing  Solvency  ratio  for  the  years  (2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "Generally,  lower  the ratio  of total  liabilities  to total  assets,  more  satisfactory  or stable  is the",
    "long term solvency position of a firm. The lower the company’s ratio, the greater the",
    "profitability  that  the company  will  default  on its default  obligations.  Here  the high  solvency",
    "ratio  is 1.01 in the year 2015 -16 and low  ratio is in the year 2016 -17.",
    "80   Fixed  Asset  Ratio",
    "Fixed  Asset  Ratio  = Fixed  asset  ( after  Depreciation)",
    "Total  long  term  funds",
    "Table  No 5.21:  Table  showing Fixed  Asset ratio for  the years  (2015 -16 to 2019 -20)",
    "YEAR  FIXED  ASSET",
    "(in crores)  TOTAL  LONG -TERM  FUNDS",
    "(in crores)  FIXED ASSET",
    "RATIO",
    "2015 -16 2562.26  5585.55  0.46",
    "2016 -17 2980.76  6839.64  0.44",
    "2017 -18 7305.31  9087.92  0.80",
    "2018 -19 11480.61  12636.94  0.91",
    "2019 -20 16988.22  19061.48  0.89",
    "Graph  No 5.9: Graph showing  Fixed  Asset  ratio  for  the  years  (2015 -16 to 2019 -20)",
    "INTERPRE  TATION:",
    "The ratio indicates the extent to which the total of fixed assets are financed by total long",
    "term funds of the firm. It is better if the total assets is equal to total long term fund i.e,1:1.",
    "If it is more, means that some of the fixed assets are financed from current liabilities,",
    "which  is not a good  financial policy.",
    " Interest  Coverage  Ratio  (Debt  Service  Ratio) ",
    "Interest  Coverage  Ratio  = EBIT",
    "Fixed  Interest  Charges",
    "81  Table  No 5.22:  Table  showing Interest  Coverage ratio for  the years  (2015 -16 to 2019 -20)",
    "YEAR  EBIT",
    "(in crores)  FIXED  INTEREST  CHARGES",
    "(in crores)  INTEREST",
    "COVERAGE  RATIO",
    "2015 -16 489.97  117.56  4.17",
    "2016 -17 752.82  77.23  9.75",
    "2017 -18 1874.68  100.96  18.57",
    "2018 -19 4818.78  611.7  7.88",
    "2019 -20 7423.42  867.03  8.56",
    "Graph No 5.10: Graph showing Interest Coverage ratio for the years",
    "(2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "This  ratio  shows  how  many  times  the interest  charges  are covered  by EBIT.  Higher  the",
    "ratio better is the position of long term lenders and vice -versa. It is better to have the",
    "ratio  at more  than  6 or 7 times.  So,  for RRL  2017 -18 has  higher  interest  coverage  ratio.",
    "And  in the  year  2015 -16,  it shows  the lowest interest  coverage  ratio.",
    " Fixed  Assets  to Net  worth ",
    "Fixed  Assets  to Net  worth  = Fixed  assets",
    "Net  worth  or Shareholders  fund",
    "82  Table  No 5.23:  Table  showing Fixed  Assets ratio  for  the years  (2015 -16 to 2019 -20)",
    "YEAR  FIXED  ASSET  SHAREHOLDERS  FUND  FIXED  ASSETS  to NET -WORTH",
    "(in crores)  (in crores)  RATIO",
    "2015 -16 2562.26  5494.9  0.47",
    "2016 -17 2980.76  6819.57  0.44",
    "2017 -18 7305.31  9066.46  0.81",
    "2018 -19 11480.61  12587.41  0.91",
    "2019 -20 16988.22  18115.18  0.94",
    "Graph No 5.11: Graph showing Fixed assets to Net worth ratio for the years",
    "(2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "This ratio indicates the extent to which the owners cash is frozen in the form of fixed",
    "assets, such as property, plant and equipment etc., and the extent to which funds are",
    "available for the company’s operation. Here, the fixed assets to net worth ratio is",
    "higher  in the  year 2019 -20 and lower in the  year  2016 -17.",
    " PROFITABILITY RATIOS",
    "I Gene ral Profitability  Ratio",
    " Gross Profit  Ratio",
    "Gross  Profit  Ratio  = Gross  profit  ×100",
    "Net  Sales",
    "83",
    "Table  No 5.24:  Table  showing  Gross profit ratio  for  the  years  (2015 -16 to 2019 -20)",
    "YEAR  COST OF GOODS",
    "SOLD  REVENUE FROM",
    "OPERATION  GROSS  PROFIT  GROSS PROFIT",
    "RATIO",
    "2015 -16 16385.6  18399.22  2013.62  10.94",
    "2016 -17 21504.46  26437.68  4933.22  18.66",
    "2017 -18 50042.81  51456.17  1413.36  2.75",
    "2018 -19 87565.72  101946.52  14380.8  14.11",
    "2019 -20 109413.78  130367.36  20953.58  16.07",
    "Graph  No 5.12: Graph showing  Gross  profit ratio  for  the  years  (2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "The gross profit ratio plays an important role in financial management. It serves as a",
    "valuable indicator of the firm’s ability to utilise effectively the outside  sources of fund. It",
    "also serves as important tool in shaping the pricing policy of the firm. This ratio helps in",
    "ascertaining  whether  the average  percentage  of profit on  the goods  is maintained  or not.",
    " Operating  Ratio",
    "Operating  Ratio  = Cost  of Goods  Sold",
    "Revenue  from  Operations",
    "×100",
    "84",
    "Table  No 5.25:  Table showing  Operating  ratio for  the  years  (2015 -16 to 2019 -20)",
    "YEAR  COST OF  GOODS  SOLD  REVENUE  FROM  OPERATION  OPERATING  RATIO",
    "2015 -16 16385.6  18399.22  89.06",
    "2016 -17 21504.46  26437.68  81.34",
    "2017 -18 50042.81  51456.17  97.25",
    "2018 -19 87565.72  101946.52  85.89",
    "2019 -20 109413.78  130367.36  83.93",
    "Graph  No 5.13: Graph  showing  Operating ratio  for  the  years  (2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "This ratio shows the efficiency of a company’s management by comparing operating",
    "expenses  to net sales.  80%  -95%  of operating  ratio  is considered  desirable.  From  this,  it is",
    "evident  that RRL  is having  desirable operating  ratios over the  years.",
    " Operating  Profit  Margin/EBITDA :",
    "Operating  Profit  Margin  = EBITDA",
    "Operating  Revenue",
    "× 100",
    "85  Table No 5.26: Table showing Operating Profit Margin for the years",
    "(2015 -16 to 2019 -20)",
    "YEAR  EBITDA  OPERATING  REVENUE  EBITDA  MARGIN",
    "2015 -16 1438.95  18399.22  7.82",
    "2016 -17 1805.35  26437.68  6.83",
    "2017 -18 3084.23  51456.17  5.99",
    "2018 -19 6817.13  101946.52  6.69",
    "2019 -20 10082.81  130367.36  7.73",
    "AVERAGE  EBITDA/OPERATING  PROFIT  MARGIN  7.01",
    "Graph No 5.14: Graph showing Operating Profit Margin for the years",
    "(2015 -16 to 2019 -20)",
    "INTERPRETATION :",
    "It appears that RRL has maintained its EBITDA at an average of 7%, and in fact, on a",
    "closer look it is clear the EBITDA margin is increasing from 2017 -18. This is a good",
    "sign  as it shows  consistency  and  efficiency  in the management’s  operational",
    "capabilities .",
    " PAT  Margin :",
    "Profit  Margin =   PAT",
    "Total  Revenue",
    "× 100",
    "86  Table  No 5.27:  Table showing  PAT Margin  for  the  years (2015 -16 to 2019 -20)",
    "YEAR  PAT  TOTAL  REVENUE  PAT  MARGIN",
    "2015 -16 306.54  18418.36  1.66",
    "2016 -17 442.6  26473.13  1.67",
    "2017 -18 1243.4  51501.73  2.41",
    "2018 -19 3138.26  102058.55  3.07",
    "2019 -20 5539.79  130627.71  4.24",
    "Graph  No 5.15  : Graph  showing  PAT  Margin  for  the  years (2015 -16 to 2019 -20)",
    "The PAT and PAT margin trend seems impressive as we can clearly see a margin",
    "expansion.  The  5 year  CAGR  growth  stands  at 78.40%,  which  is again  good.  Needless",
    "to say, it always makes sense  to compare  ratios with its competitors.",
    "II Overall Profitability  Ratios",
    " Return  on Equity  Share  Capital ",
    "Return  on E.S.C  = Net  profit(after  interest,tax  and  preference  dividend)",
    "Equity  Share  Capital",
    "Table  No 5.28:  Table  showing  Return  on Equity  for  the  years  (2015 -16 to  2019 -20)",
    "YEAR  PBIT  EQUITY  SHARE  CAPITAL  RETURN  ON  EQUITY",
    "2015 -16 306.54  5494.9  5.58",
    "2016 -17 442.6  6819.57  6.49",
    "2017 -18 1243.4  9066.46  13.71",
    "2018 -19 3138.26  12587.41  24.93",
    "2019 -20 5539.79  18115.18  30.58",
    "87  Graph  No 5.16:  Graph showing  Return  on Equity  for  the  years  (2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "This ratio helps to measure the efficiency with which a company uses shareholders’",
    "investment to generate more revenue. This profitability ratio is a projection of investors",
    "investment in a company. Mostly, a robust ROE indicates that a company is utilizing the",
    "fund generated through shareholders’ investment efficiently. It is evident th at RRL has a",
    "desirable  return on equity.",
    " Return  on Investment/Capital  Employed  (Yield  on capital )",
    "ROI/  ROCE  = Net  profit(  before  interest,tax  and  dividend)×100",
    "Capital  Employed",
    "Table No 5.29: Table showing Return on Investment for the years",
    "(2015 -16 to 2019 -2020)",
    "YEAR  EBIT  CAPITAL  EMPLOYED  ROCE/ROI",
    "2015 -16 1438.95  5585.55  25.76",
    "2016 -17 1805.35  6839.64  26.40",
    "2017 -18 3084.23  9087.92  33.94",
    "2018 -19 6817.13  12636.94  53.95",
    "2019 -20 10082.81  19061.48  52.90",
    "88  Graph No 5.17: Graph showing Return on Investment for the years",
    "(2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "The higher the return on investment ratio, the more efficiently the company is using",
    "its asset base to generate sales. ROI is higher in the year 2018 -19 and lower in the",
    "year  2015 -16.  Therefore,  ROI  of RRL  is considered desirable.",
    " Capital  Turnover  Ratio :",
    "It is the relationship  between  revenue  from  operations  and  capital  employed.  This  ratio",
    "is calculated to measure the efficiency or effectiveness with which a firm utilises its",
    "capital.",
    "Capital  Turnover  Ratio  = Revenue  from  operations  ×100",
    "Capital  Employed",
    "Table  No 5.30:  Table showing  Capital  Turnover  ratio  for  the  years  (2015 -16 to  2019 -20)",
    "YEAR  REVENUE  FROM  OPERATIONS  CAPITAL  EMPLOYED  CAPITAL  TURNOVER  RATIO",
    "2015 -16 18399.22  5585.55  3.29",
    "2016 -17 26437.68  6839.64  3.87",
    "2017 -18 51456.17  9087.92  5.66",
    "2018 -19 101946.52  12636.94  8.07",
    "2019 -20 130367.36  19061.48  6.84",
    "89  Graph No 5.18: Graph showing Capital turnover ratio",
    "for  the  years (2015 -16 to 2019 -20)",
    "INTERPERTATION:",
    "It is the relationship  between  revenue  from  operations  and  capital  employed.  This  ratio",
    "is calculated to measure the efficiency or effectiveness with which a firm utilises its",
    "capital. Here, these ratios implies capital investment has contributed towards the sales",
    "of the company  and  it seems  that  the utilization  of capital  investment  is done  efficiently",
    "by the company. From the graph it shows that capital turnover ratio increases year by",
    "year  till 2018 -19. So we can  conclude  that  the company  able  to achieve  maximum  sales",
    "with  minimum amount of capital employed.",
    " TURNOVER  RATIOS  (ACTIVITY  RATIO S/EFFICIENCY RATIOS)",
    " Inventory  Turnover  Ratio  (Stock  turnover  ratio  or Stock  velocity) ",
    "Inventory  Turnover  Ratio  = Cost  of revenue  from  operations",
    "Average  Inventory",
    "Table No 5.31: Table showing Inventory Turnover ratio for the years",
    "(2015 -16 to 2019 -20)",
    "YEAR  COST OF REVENUE",
    "FROM  OPERATIONS",
    "AVERAGE  INVENTORY  INVENTORY",
    "TURNOVER  RATIO  AVERAGE AGE OF",
    "INVENTORY IN",
    "MONTHS",
    "2015 -16 16385.6  6507.34  2.52  4.77",
    "2016 -17 21504.46  7797.91  2.76  4.35",
    "2017 -18 50042.81  13013.62  3.85  3.12",
    "2018 -19 87565.72  16524.47  5.30  2.26",
    "2019 -20 109413.78  14994.075  7.30  1.64",
    "90  Graph No 5.19: Graph showing Inventory turnover ratio",
    "for  the  years (2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "The inventory turnover ratio signifies the liquidity of the inventory. A high inventory",
    "turnover  ratio  indicates  brisk  sales.  The  ratio  helps  to identify  over  stocking  of",
    "inventory. A low inventory turnover ratio results in blocking of funds in inventory.",
    "There is no standard ratio for the inventory turnover. Each field and kind of business",
    "has  its own standard.",
    " Fixed  assets turnover  ratio",
    "Fixed  Assets Turnover  Ratio  = Operating  Revenues",
    "Total  Average  Fixed  Assets",
    "Table No 5.32: Table showing Fixed asset turnover ratio",
    "for  the  years (2015 -16 to 2019 -20)",
    "YEAR  OPERATING",
    "REVENUES  TOTAL  AVERAGE  FIXED  ASSET  FIXED  ASSET  TURNOVER  RATIO",
    "2015 -16 18399.22  3800.935  4.84",
    "2016 -17 26437.68  5139.09  5.14",
    "2017 -18 51456.17  8795.69  5.85",
    "2018 -19 101946.52  15133.26  6.74",
    "2019 -20 130367.36  26886.11  4.85",
    "91  Graph No 5.20: Graph showing Fixed Asset turnover ratio",
    "for  the  years (2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "For  a very  well  established  company,  the company  may  not  be utilizing  its cash  to invest",
    "in fixed assets. However for a growing company, the company may invest in fixed",
    "assets and hence the fixed assets value may increase year on year. We can notice this",
    "in case of RRL as well, for the FY18 the Fixed assets value is at Rs. 8795.69 Crs and",
    "for the FY20  the fixed asset value  is at Rs. 26886 Crs.",
    "This  ratio  is mo0stly  used  by capital  intensive  industries  to analyze  how  effectively  the",
    "fixed assets of the  comp any  are used.",
    " Working  capital  turnover  ratio",
    "Working  capital  Ratio  = Net  revenue  from  operations",
    "Average  working  Capital",
    "Table No 5.33: Table showing Working Capital turnover ratio",
    "for  the  years (2015 -16 to 2019 -20)",
    "YEAR  NET REVENUE FROM",
    "OPERATIONS  AVERAGE  WORKING  CAPITAL  WORKING CAPITAL",
    "TURNOVER  RATIO",
    "2015 -16 18399.22  2119.82  8.68",
    "2016 -17 26437.68  2983.57  8.86",
    "2017 -18 51456.17  2299.04  22.38",
    "2018 -19 101946.52  -386.21  -263.97",
    "2019 -20 130367.36  -1266.335  -102.95",
    "92  Graph No 5.21: Graph showing Working Capital turnover ratio",
    "for  the  years (2015 -16 to 2019 -20)",
    "INTERPRETATION:",
    "In 2015 -16, the number indicates that for every Rs.1 of working capital, the company is",
    "generating Rs. 8.68 in terms of revenue. Higher the wo rking capital turnover ratio the better it",
    "is, as it indicates the company is generating better sales in comparison with the money it uses",
    "to fund the sales. But in 2018 -19 & 2019 -20 it is negative showing that company has not",
    "sufficient short -term funds f or fulfilling the sales done for that period. This will cause a",
    "shortage  of funds  and can cause  a business to  run  out of money.",
    " Trade  Receivables  Turnover  Ratio  (Debtors  Turnover  Ratio/  Debtor’s  velocity ",
    "Trade Receivables  Turnover  Ratio  = Net  credit  revenue  from  operations",
    "Average  trade  receivables",
    "Table No 5.34: Table showing Trade Receivables turnover ratio",
    "for  the years (2015 -16 to 2019 -20)",
    "YEAR  NET",
    "REVENUE",
    "FROM",
    "OPERATIONS",
    "AVERAGE TRADE",
    "RECEIVABLES  TRADE",
    "RECEIVABLES",
    "TURNOVER  RATIO",
    "AVERAGE  COLLECTION",
    "PERIOD(in  days)",
    "2015 -16 18399.22  323.34  56.90  6.41",
    "2016 -17 26437.68  948.02  27.89  13.09",
    "2017 -18 51456.17  2580.77  19.94  18.31",
    "2018 -19 101946.52  5438.03  18.75  19.47",
    "2019 -20 130367.36  6819.27  19.12  19.09",
    "93  Graph 5.22: Graph showing Trade Receivables turnover ratio",
    "for  the years (2015 -16 to 2019 -20)",
    "INTERPERTATION:",
    "This ratio measures the efficiency of debt collection and also the quality of debtors. A shorter",
    "period implies prompt payment by debtors. It reduces the chance of bad debts. A longer",
    "collection  period implies inefficient  credit collection performance.",
    " Du-pont  analysis :",
    "ROE  = Net  profit  margin ×  Total  Asset  Turnover  × Leverage Factor",
    "OR",
    "ROE  = Net  Profit  × Sales",
    "× Total  Assets",
    "Sales  Total  Assets  Common  Equity",
    "Net  Profit  Margin",
    "Table  No 5.35:  Table  calculating Net  Profit  Margin",
    "YEAR  PAT  TOTAL  REVENUE  PAT  MARGIN",
    "2015 -16 306.54  18418.36  1.66",
    "2016 -17 442.6  26473.13  1.67",
    "2017 -18 1243.4  51501.73  2.41",
    "2018 -19 3138.26  102058.55  3.07",
    "2019 -20 5539.79  130627.71  4.24",
    "94  Total  Asset  Turnover",
    "Table  No 5.36:  Total Asset  Turnover",
    "YEAR  SALES  NET ASSETS  ASSET  TURNOVER",
    "2015 -16 18418.36  5942.92  3.10",
    "2016 -17 26473.13  11672.42  2.27",
    "2017 -18 51501.73  24084.41  2.14",
    "2018 -19 102058.6  34377.55  2.97",
    "2019 -20 130627.7  35565.91  3.67",
    "Leverage  factor",
    "Table  No 5.37: Leverage  Factor",
    "YEAR  ASSETS  SHAREHOLDERS  EQUITY  LEVEARAGE  FACTOR",
    "2015 -16 5942.92  5494.9  1.08",
    "2016 -17 11672.42  6819.57  1.71",
    "2017 -18 24084.41  9066.46  2.66",
    "2018 -19 34377.55  12587.41  2.73",
    "2019 -20 35565.91  18115.18  1.96",
    "DU  PONT  ANALYSIS",
    "= Net  profit  margin ×  Total  Asset  Turnover  × Leverage  Factor",
    "Table  No 5.38:  Du -pont  Analysis",
    "YEAR  PAT",
    "MARGIN  ASSET",
    "TURNOVER",
    "LEVERAGE  FACTOR",
    "RETURN  ON  EQUITY",
    "2015 -16 1.66  3.10  1.08  5.56",
    "2016 -17 1.67  2.27  1.71  6.48",
    "2017 -18 2.41  2.14  2.66  13.69",
    "2018 -19 3.07  2.97  2.73  24.89",
    "2019 -20 4.24  3.67  1.96  30.57",
    "95",
    "Graph  No 5.23:  Du - pont analysis",
    "ROE Comparison using Ratio Analysis & Du -Pont Analysis",
    "Table  5.39: ROE Comparison",
    "YEAR",
    "RETURN  ON  EQUITY(  using  ratio  analysis)  RETURN ON EQUITY( using du -pont",
    "analysis)",
    "2015 -16 5.58  5.56",
    "2016 -17 6.49  6.48",
    "2017 -18 13.71  13.69",
    "2018 -19 24.93  24.89",
    "2019 -20 30.58  30.57",
    "INTERPRETATION:",
    "From the above table it is realized that the ROE computed using Du -pont model is equivalent",
    "to the ROE  computed  using  ratio analysis.",
    "96   CORRELATION  ANALYSIS",
    "Hypothesis – Finding the significance between Sales and Profit",
    "H0:  There  is no relationship between sales and  profit",
    "Table  No 5.40:  Calculating  Correlation  analysis  –sales  and  profit",
    "X",
    "Y",
    "XY",
    "X2",
    "Y2",
    "18399.22",
    "306.54",
    "5640096.899",
    "338531296.6",
    "93966.77",
    "26437.68",
    "442.6",
    "11701317.17",
    "698950923.8",
    "195894.8",
    "51456.17",
    "1246.89",
    "64160183.81",
    "2647737431",
    "1554735",
    "101946.52",
    "3138.26",
    "319934685.9",
    "10393092940",
    "9848676",
    "130367.36",
    "5539.79",
    "722207797.3",
    "16995648553",
    "30689273",
    "∑X=",
    "328606.95  ∑Y=",
    "10674.08  ∑XY=",
    "1123644081  ∑X2=",
    "31073961145  ∑Y2=",
    "42382545",
    "Co-efficient  of correlation,  r =",
    "5 × 1123644081  − (328606.95)(10674.08)",
    "√5  × 31073961145  − (328606.95  × 328606.95 ) √5 ×  42382545  − (10674.08  × 10674.08)",
    "= 2110643532",
    "√47387278136  √97976742.53",
    "= 2100643532",
    "217686.19×9898.32",
    "= 0.979",
    "H1:  There  is high  correlation between  sales and  profit",
    "97",
    "Graph  No 5.24  : Correlation  between  net  sales  and  profit",
    "INTERPRETATION:",
    "Since  the correlation  is positive  and  it is near  to 1 signifies  that  there  is high  correlation  between",
    "sales and profit. So, it is evident that the value of sales and profit moves in same direction i.e.,",
    "increase in the value of one variable results into an increase in the value of other variable also",
    "or if a decrease  in the value  of one  variable,  results  into  a decrease  in the value  of other  variable.",
    "From  this it  is clear  that any  change  in net sales  will affect net  profit as  it is  highly  correlated.",
    "98",
    "CHAPTER – VI",
    "FINDINGS  OF  THE  STUDY",
    "99  Findings :",
    "The  following  were  the findings  from  the study  of financial  performance  & analysis  on",
    "Reliance  Retail  Limited: -",
    " Findings  from  comparative  statement  analysis:",
    " As per the analysis done on comparative balance sheet for the period of 5 years (2015 -",
    "16 to 2019 -20),  the current  assets  of Reliance  Retail  Limited  have  increased  by 29.02",
    "% in the year 2016 over 2015 whereas, it changed to 16.01% in the year 2017 over",
    "2016,  109.01%  in the year  2018  over  2017,  40.82%  in the year  2019  over  2018  and",
    "decreased  by 27.51%  in the year 2020  over  2019",
    " Comparative balance sheet of 2015 & 16, shows good sign of investment of long -term",
    "fund.  It further  hints  towards  the fact  that  company  might  find  it challenging  to meet  its",
    "short  term obligations. ",
    " In the year 2016 & 2017, Long term borrowings have decreased. The owner’s equity",
    "has  improved  by 10%.  This  indicates  that  the company  need  not  depend  on the external",
    "lenders  thus showing a  great financial strength. ",
    " In the year 2017& 2018, there was on account of the huge addition made to the plant",
    "and machinery by the  company in the  given  accounting periods.  Such additional",
    "machinery leads to an incredible improvement in the r evenue of the company during",
    "the year. ",
    " Findings  from  common -size  balance  sheet:",
    " From the analysis over the period of 5 years, each line item on balance sheet is",
    "expressed  as a percentage  of total  assets  or total  liabilities.  The  common  size",
    "percentages  show  how  each  line  item  or component  affects  the financial  position  of the",
    "company. ",
    " Findings  from  trend  analysis:",
    " The  Net  profit  on the basis  of last  5 years  (2015 -16 to 2019 -20)  position,  we can  predict",
    "the profit trend for the future years (2020 -21 to 2024 -25). Here this trend shows out a",
    "positive  growth  for the company  in their  future  period  of time.  The  estimated  profit  for",
    "the next  five  years  is moving  with  a CAGR  of 13.28%.  This  positive  net profit  indicates",
    "the firm is in a good position  and is earning  more than its  competitors. ",
    " Estimated Net sales shows a positive trend for the next 5 years (2020 -21 to 2024 -25)",
    "from the analysis of sales over the period of past five years (2015 -16 to 2019 -21). It",
    "indicates  good sign  of financial  performance  and business  profitability. ",
    "100    Findings  from  Ratio  analysis:",
    " From the analysis of Current ratio, it is found that, overall the company has good",
    "liquidity  position,  it can able  to meet its  current  liabilities during  the period 2015 -16 &",
    "2016 -17. But in the year 2017 -18, current ratio became equal to current liabilities not",
    "leaving a comfortable margin of working capital after paying off the current liabilities.",
    "In the year 2018 -19 & 2019 -20, curren t ratio again comes down leaving inadequate",
    "safety to creditors. From this, it is clear that short -term financial position of  RRL is",
    "may  not be desirable. ",
    " From the analysis of quick ratio, it is found that the company has not meet ideal ratio",
    "in the five y ears. The ratio is less than 1 over these years, indicating the financial",
    "position of the concern shall be deemed to be unsound.  It is evident that quick ratio is",
    "less than 1 in these 5 years, indicating company might find it challenging to meet its",
    "short  term obligations, especially  in the  year 2015 -16 &  2017 -18.",
    " From the analysis of absolute ratio, the ratio is comparatively less than 0.5, so it",
    "represents the company’s day -to-day cash management is in a very poor light. During",
    "the year  2017 -18, the ratio  is considerable  more  compared  to other  years,  so it",
    "represents  enough  funds  within  the type  of cash  in order  to fulfil  its short -term",
    "obligations  in time. ",
    " From  the analysis of  Debt –equity  ratio,  it is found  that the  company  is using  low  debt,",
    "the company  is focusing  on shareholders  not  creditors.  Here,  for Reliance  Retail  it suits",
    "low debt -to equity ratio as it is operating under volatile and unpredictable business",
    "environments as they cannot afford financial commitments that they cannot meet in",
    "case of s udden downturns in economic activity. So, here, low debt -equity ratio implies",
    "a higher  claim  of owners  than  that  of the long  term  lenders  and  is favourable  to the firm.",
    " Proprietary  shows  the financial  strength  of the company.  It helps  the lenders  to find  out",
    "the proportion of shareholders’ fund to the total assets. Higher ratio of Reliance Retail",
    "Limited  indicates a  secured position to lenders. ",
    " The lower Solvency ratio of 2016 -17, ensures stability is the long term solvency",
    "position of  a firm.",
    " From the analysis of fixed asset ratio, indicates the extent to which the total of fixed",
    "assets are financed by total long term funds of the firm. The ratio over these years",
    "indicates  good  financial policy  of the company. ",
    " Interest Coverage ratio shows how many times the interest charges are covered by",
    "EBIT.  Higher  the ratio  better  is the position  of long  term  lenders  and  vice -versa.  It is",
    "101   better to have the ratio at more than 6 or 7 times. So, for RRL 201 7-18 has higher",
    "interest  coverage  ratio.  It indicates  the better  position of  long  term  lenders.",
    " The  fixed  assets  to net worth  ratio  over  these  years  was  satisfactory. ",
    "  From the analysis of Fixed asset turnover ratio, it is found that the company had",
    "utilizing the asset efficiently in all the years. It has reached the ideal ratio in all the",
    "years.",
    " From the analysis of gross profit ratio, it is found that the company gross profit ratio",
    "grew  with a  CAGR of 59.75% ",
    " Higher  Net Profit  Ratio in  2017 -18, indic ates  efficiency  and profitability  of business. ",
    " It appears that RRL has maintained its EBITDA at an average of 7%, and in fact, on a",
    "closer look it is clear the EBITDA margin is increasing from 2017 -18. This is a good",
    "sign  as it shows  consistency  and  effici ency  in the management’s  operational",
    "capabilities. ",
    " Mostly, a robust ROE indicates that a company is utilizing the fund generated through",
    "shareholders’ investment efficiently. It is evident that RRL has a desirable return on",
    "equity  and it is increasing  over the  years.",
    " The  higher  the return  on investment  ratio,  the more  efficiently  the company  is using  its",
    "asset base to generate sales. ROI is higher in the year 2018 -19 and lower in the year",
    "2015 -16. Therefore, ROI of  RRL  is considered desirable. ",
    " From  the analysis,  it shows  that  capital  turnover  ratio  increases  year  by year  till 2018 -",
    "19. So we can  conclude  that  the company able  to achieve  maximum  sales  with",
    "minimum  amount of capital employed.",
    " Inventory turnover ratio and Trade receivable ratio of RRL for these years found",
    "satisfactory. ",
    " From the analysis of working capital turnover ratio, it is found that the company has",
    "utilized its working capital usefully for sales in the year 2016 -18, but it  is reduced in",
    "the year 2019  and 2020. ",
    " ROE  calculated from  du-pont  analysis  and from ratio  analysis  remains  to be same. ",
    "102",
    "CHAPTER – VII",
    "CONCLUSION",
    "103",
    "The study aims to evaluate the financial performance of Reliance Retail Limited by using",
    "analysis  tools. Financial performance analysis  is the process of  identifying the financial",
    "strengths and weaknesses of the firm by properly establishing the relationsh ip between the",
    "items  of balance  sheet  and  profit  and  loss  account.  An analysis  of financial  performance  shows",
    "that  the company’s  ability  to meet  its current  obligation  is satisfactory.  Meanwhile  the company",
    "has to go for more debt component, because the company is using low debt component and",
    "moreover it can develop further business activities with the help of more funds. The company",
    "has  to control  over  expenses,  because  the expenses  is keep  on increasing  in all the years,  and  it",
    "results  in decreasing  in profit  available  for shareholders.  The  company  has  to maintain  adequate",
    "cash level to meet out its immediate requirement, because the company maintains less cash",
    "availability. The company inventories is keep o n increasing from the beginning of the year, so",
    "it has to take necessary steps like sales promotion, advertising to clear the stocks because it",
    "affects the liquidity position. The company has to properly utilize the assets efficiently to",
    "generate  more  profits.  Overall  financial  performance  analysis  of Reliance  Retail  found  to very",
    "satisfactory  when  compared  with  industry  average.  The  company  has  a great  growth",
    "opportunity  in the  coming  years.",
    "104",
    "ANNEXURE",
    "105",
    "106",
    "107",
    "108",
    "109",
    "110",
    "111",
    "BIBLIOGRAPHY",
    "112",
    "Reports",
    "Annual  accounts &  reports  of Reliance  Retail  Ltd.  from 2015 -2016  to 2019 -2020.",
    "Jay  Gandhi,  Rutvi  Chokshi.  “HDFC  Securities - Institutional  Research” - Reliance  Retail -",
    "Company  update – 14 April 2020",
    "Alok  Shah,  Abneesh  Roy.  “Edelweiss  Securities  Limited  – India  Equity  Research  | Retail”",
    "Sector  update",
    "Anarock retail, “Indian Retail” – Retail Association of India – September 2020",
    "IBEF,  “Retail” – March  2021",
    "Books  of Reference",
    "1. Chandra , P. “Financial Management” , Tata Me Graw -Hill Publishing Company",
    "Ltd.,  New Delhi,2014",
    "2. Dr. Maheshwari, S.N. “Finan cial Management Principles and Practices” , Sultan",
    "Chand  and Sons, New Delhi, 2009",
    "3. Jain  and  Narang. “Financial  Accounting” , Kalyani  Publishers,  2005",
    "Websites and  Journals",
    "● www.ril.com",
    "● https://www.ibef.org/industry/retail -india.aspx",
    "● https://www.relianceretail.com/investor -relations.html",
    "● https://www.investindia.gov.in/sector/retail -e-commerce",
    "● https://www.indiaretailing.com/2017/11/16/retail/indian -retail -industry -growth -",
    "trends -challenges -opportunity/",
    "113"
]